[
  {
    "id": 1062061362,
    "title": "Why spot ETFs may be a game changer for bitcoin",
    "sourceUrl": "https://www.cnbc.com/2024/01/13/why-spot-etfs-may-be-a-game-changer-for-bitcoin-.html",
    "author": "Emily Glass",
    "content": {
      "elements": [
        "The Securities and Exchange Commission’s approval of 11 spot bitcoin ETFs this week could be a turning point for cryptocurrency investing.",
        "Ark Invest CEO and Chief Investment Officer Cathie Wood is behind one of the new ETFs. Her firm partnered with 21Shares to launch the ARK 21Shares Bitcoin ETF.",
        "“We really believe this is an important moment for us to help with the democratization of bitcoin access, giving more people access,” Wood told “ETF Edge” on Monday.",
        "The first-ever batch of spot ETFs began trading Thursday. Investor interest in bitcoin\nleading up to the historic ETF approvals has been on the upswing. As of Friday, the cryptocurrency is up more than 125% in the past 12 months.",
        "As financial firms begin to get more exposure through the new instruments, Wood said, the impact on bitcoin prices will be noticeable. ",
        "“If institutions with trillions of dollars under management just put 0.2[%] or 0.5% in, that could really move the needle,” Wood said.",
        "Ophelia Snyder’s firm 21.co is heavily involved in the cryptocurrency space. According to its website, the firm “bridges traditional finance and decentralized finance for easy crypto access.”",
        "“It’s also very much part of a new wave of disruptive technology,” the firm’s president and co-founder told “ETF Edge.”",
        "Snyder contended that bitcoin goes beyond being just a new asset class.",
        "“There’s still quite a ways to go in terms of how this actually will interact both with the world at large and sort of our economic systems, as well as, quite frankly, how it will end up interacting with your portfolio,” she said. ",
        "Snyder also said the impact that wider bitcoin access could have on the broader market “can’t be underestimated.”",
        "Disclaimer"
      ]
    },
    "publishedDate": "2024-01-24T00:00:00"
  }
]