[
  {
    "id": -615391961,
    "title": "‘This is a unique time’: ARK Invest’s chief futurist tackles tech innovation from AI to robotics",
    "sourceUrl": "https://www.cnbc.com/2024/04/27/ai-to-robotics-to-blockchain-ark-says-its-a-unique-time-to-invest.html",
    "author": "Meredith Mutter",
    "content": {
      "elements": [
        "ARK Invest’s chief futurist lists five groups that should give tech investors an edge.",
        "According to Brett Winton, robotics, artificial intelligence, multi-omics sequencing, public blockchain and energy storage are key areas because they’re all entering the marketplace at the same time.",
        "“We believe that this is a unique time in technological economic history,” he told CNBC’s “ETF Edge” this week.",
        "Winton collaborates with ARK Invest CEO Cathie Wood to maintain the ARK Venture Fund (ARKVX), which allows investors to buy into the private technology space.",
        "According to the firm’s website, the goal of the fund is to make venture capital offerings of innovative spaces in the market accessible to individual investors. As of April 10, it shows the fund’s top holdings include Epic Games, known for online video game Fortnite, and biotech companies Freenome and Relation Therapeutics.",
        "“Our emphasis is that we are investing in innovation over the long term and going to support management teams,” said Winton.",
        "He contends it’s a strategy that’s often not prioritized.",
        "“That’s a real challenge a lot of public market investors don’t have that long-term view,” Winton added.",
        "The ARK Venture Fund is down more than 7% so far this year. However, it’s up almost 39% percent over the past 52-weeks."
      ]
    },
    "publishedDate": "2024-04-27T00:00:00"
  },
  {
    "id": 353588284,
    "title": "Sanctioned and terrorist entities receive most global illicit crypto",
    "sourceUrl": "https://www.cnbc.com/2024/02/29/sanctioned-and-terrorist-entities-receive-most-global-illicit-crypto.html",
    "author": "Dylan Butts",
    "content": {
      "elements": [
        "Sanctioned entities, like those linked to North Korean hacking groups and U.S.-designated terrorist organizations such as Lebanon’s Hezbollah, continue to rely on cryptocurrency for fundraising, according to a new report from Chainalysis.",
        "The American blockchain analysis firm’s “2024 Crypto Crime Report” found that $24.2 billion of illicit cryptocurrency was transferred in 2023, based on already identified illicit crypto wallets. Chainalysis retroactively updates its yearly crypto figures when new illicit wallets come to light.",
        "While last year’s numbers currently represent a drop from the previous year, Chainalysis noted a much higher proportion of the funds were attributed to sanctioned or terrorist-linked recipients, accounting for about 61.5% of total illicit transaction volume in 2023.",
        "“Actors subject to sanctions are often cut off from international traditional financial systems, and crypto can become an attempted alternative mechanism to store, send, and receive funds,” Andrew Fierman, head of sanctions strategy at Chainalysis, told CNBC on Thursday.",
        "Entities like the crypto “mixer” Tornado Cash and Garantex took the lion’s share of illicit funds in 2023. Tornado Cash was sanctioned in August 2022 for its role in laundering crypto stolen by the North Korean hacking organization Lazarus Group. Russian-based exchange Garantex was sanctioned in April 2022 for its affiliation with illicit actors, including ransomware groups.",
        "Crypto mixers are software that obscure the history and origin of digital assets sent through them.",
        "The amount of crypto transferred to sanctioned entities has climbed in recent years in tandem with a greater share of new trade restrictions specifying crypto wallets.",
        "In 2023, the U.S. Office of Foreign Assets Control sanctions list imposed a total of 18 new sanctions on individuals and entities, including their associated crypto wallets.",
        "At least nine of the new sanctions were against individuals and entities across China and Latin America for their alleged role in fentanyl manufacturing and trafficking. Meanwhile, five of the sanctions targeted entities deemed to have violated sanctions on North Korea.",
        "The top crypto recipient added to the sanctions list last year was Sinbad.io — a bitcoin mixer that was shut down in November of 2023 — which received $665.4 million in crypto from the Lazarus Group.",
        "Still, sanctions have shown the ability to slow the flow of crypto funds to their targets. Tornado Cash’s monthly inflows dropped by as much as 93% immediately following its placement on the U.S. list, according to Chainalysis. Though the firm noted inflows slowly rebounded from that low in the following months.",
        "Of sanctioned countries, Iran was a major recipient of illicit funds, with 73.3% of inflows coming from international mainstream exchanges indicating the services might be used to subvert sanctions, Chainalysis said.",
        "Illicit crypto volume identified by Chainalysis as terrorist financing accounted for a much smaller proportion than that of transactions to sanctioned entities in 2022.",
        "Chainalysis argued that, contrary to popular belief, cryptocurrency is not an effective tool for terrorism funding because blockchain allows funds to be traced at a level of detail not typically available in traditional finance.",
        "“The transparent nature of cryptocurrency combined with blockchain analytics provides an invaluable forensic tool that empowers governments to identify, trace, and disrupt the flow of funds – something that isn’t possible with other forms of value transfer, especially cash,” said Chanalysis’s Fierman.",
        "Despite these obstacles, terrorist organizations have continued to try to utilize cryptocurrencies for fundraising, deploying intricate networks of crypto exchanges and service providers, the report said.",
        "Last year, tracing efforts resulted in the seizure of millions in funds. In one such case, Israel’s National Bureau for Counter Terror Financing said in June that it had seized $1.7 million of cryptocurrency linked to Hezbollah and Iran’s Quds Force through a Syria-based financial facilitator named Tawfiq Muhammad Said Al-Law.",
        "Chainalysis’s report outlined how Al-Law’s relied on a network of legitimate mainstream exchanges and an extensive network of wallets for cryptocurrency transactions to aid Hezbollah’s cryptocurrency financing infrastructure.",
        "The wallets linked to Al-Law collectively received funds ranging from millions to over $1 billion in cryptocurrency, involving up to tens of thousands of transfers.",
        "Meanwhile, entities and individuals linked to designated terrorist groups, such as ISIS and Hayat Tahrir Al-Sham, have continued to solicit cryptocurrency through crowdfunding efforts.",
        "However, according to Fierman, efforts in tracing and seizing these funds have become increasingly sophisticated.",
        "“The data also shows that as crypto adoption by illicit actors continues to grow, sanctioning bodies like OFAC are continually evolving their methods to identify these actors and disrupt their activities,” he added.",
        "In another example cited in the Chainalysis report, Al-Qassam Brigades, the military wing of Hamas, announced their decision to stop accepting crypto donations last year due to the risk of potential donors being traced. This followed reports that Hamas had received large amounts of cryptocurrencies in the lead up to its attack on Israel on Oct. 7.",
        "Although terrorism financing is a “small share” of illicit crypto activity, it still presents an “ever-present concern” in the ecosystem, said Chainalysis in its report.",
        "Strengthened public and private partnerships are needed to help bolster these efforts and to decipher between illicit actors and funds sent to conflict zones for legitimate causes, it added."
      ]
    },
    "publishedDate": "2024-02-29T00:00:00"
  },
  {
    "id": 2070005896,
    "title": "Former UK finance minister joins Coinbase crypto exchange as an advisor",
    "sourceUrl": "https://www.cnbc.com/2024/01/31/george-osborne-ex-uk-finance-minister-joins-coinbase-crypto-exchange.html",
    "author": "Ryan Browne",
    "content": {
      "elements": [
        "LONDON — A former British finance minister on Wednesday joined cryptocurrency exchange Coinbase as a global advisor, beefing up the company’s regulatory bargaining power at a time when it faces severe scrutiny stateside.",
        "Coinbase announced that George Osborne, who served as Britain’s chancellor of the exchequer from 2010 to 2016, will join the company on its global advisory council.",
        "He’ll join the likes of Mark Esper, the former U.S. Secretary of Defense and Patrick Toomey (R-PA) on the council, which is in place to “advise Coinbase on our global strategy as we grow our reach around the world.”",
        "Faryar Shirzad, Coinbase’s chief policy officer, said the company was “pleased to have George join our council at an exciting time for us in the U.K. and globally.”",
        "“George brings with him a wealth of experience in business, journalism and government. We look forward to relying on his insights and experiences as we grow Coinbase around the world,” Shirzard added.",
        "Osborne will serve in an advisory capacity at Coinbase, helping connect the company with politicians and regulators to help further the cause of forming crypto-friendly regulations.",
        "While chancellor of the exchequer, Osborne launched a slew of austerity policies aimed at reducing the budget deficit, including freezing child benefits, reducing housing benefits, and implementing a two-year pay freeze for public sector workers. He also tried to stimulate business activity by cutting corporation tax.",
        "Osborne was temporarily editor-in-chief at London’s Evening Standard newspaper after completing his tenure as Britain’s finance minister. He is currently a partner at Robey Warshaw LLP, a boutique investment bank.",
        "“There’s a huge amount of exciting innovation in finance right now,” Osborne said. “Blockchains are transforming financial markets and online transactions.”",
        "“Coinbase is at the frontier of these developments. I look forward to working with the team there as they build a new future in financial services,” Osborne continued.",
        "Suggestions of a growing relationship between Osborne and Coinbase first emerged last year, when Coinbase’s CEO Brian Armstrong spoke onstage in a fireside moderated by Osborne at a fintech event in London.",
        "Osborne subsequently spoke with Coinbase’s chief financial officer, Alesia Haas, at a fireside chat in the Belvedere Hotel during the World Economic Forum in Davos, Switzerland.",
        "It comes as Coinbase has made something of a land grab across Europe, expanding in multiple countries over the last few months with new licenses in place. The company was granted a virtual asset service provider license in France last month, paving the way for expansion of its services there. It has also recently secured licenses in Spain, Singapore, and Bermuda.",
        "Coinbase is currently facing a harsh regulatory crackdown in the U.S. where the Securities and Exchange Commission has accused the company of violating securities laws. Coinbase denies the allegations.",
        "Last year, Coinbase chief Armstrong appeared on stage with Osborne at the Innovate Finance Global Summit conference in London. At the event, Armstrong said he was open to investing more abroad, including relocating from the U.S. to the U.K. or elsewhere if the regulatory pressure on crypto companies continues.",
        "“I think if a number of years go by where we don’t see regulatory clarity around us ... we may have to consider investing more elsewhere in the world. Anything including, you know, relocating,” Armstrong told Osborne.",
        "He told CNBC’s Arjun Kharpal at the time that Coinbase was “looking at other markets” as it considers its position from a regulatory standpoint.",
        "Armstrong did later clarify in an interview with CNBC’s Dan Murphy that Coinbase had no formal plans to relocate from its U.S. headquarters in San Francisco. “Coinbase is not going to relocate overseas,” Armstrong said. “We’re always going to have a U.S. presence ... But the U.S. is a little bit behind right now.”"
      ]
    },
    "publishedDate": "2024-01-31T00:00:00"
  },
  {
    "id": 452217015,
    "title": "Blockchain may have found its ‘killer use case’ by keeping AI in check",
    "sourceUrl": "https://www.cnbc.com/2024/01/22/blockchain-tech-behind-bitcoin-can-be-used-to-track-ai-training-data.html",
    "author": "Arjun Kharpal",
    "content": {
      "elements": [
        "DAVOS, Switzerland — Blockchain could be used to prevent bias in the data that artificial intelligence models are being trained on — and that could be a “killer use case” for the technology, executives told CNBC.",
        "One of the concerns about the AI models — the kind that underpin applications like ChatGPT — is that the data they are trained on could contain biases or misinformation. That means the answers an AI system may give would contain those biases and false information.",
        "Blockchain hit the market in 2009 with the launch of the cryptocurrency bitcoin. In the context of bitcoin, the technology is an immutable and tamper-proof public ledger of transactions. Businesses have been looking to put these principles to use in other applications for blockchain, which is sometimes referred to as distributed ledger technology.",
        "In the case of AI, training data can be put on the blockchain. That will allow the developers of the AI system to keep track of the data that the model has been trained on.",
        "Casper Labs, a business-focused blockchain firm, partnered with IBM this month to create such a system.",
        "“The product that we are developing, the datasets are actually checkpointed and stored on the blockchain so you have a proof of how the AI is trained,” Medha Parlikar, chief technology officer and co-founder of Casper Labs, told CNBC during a panel discussion at the World Economic Forum in Davos this week.",
        "“And so as you use the AI, if it’s learning and you find that the AI is starting to hallucinate, you can actually roll back the AI. And so you can undo some of the learning and go back to a previous version of the AI.”",
        "Hallucinations broadly refer to when an AI system gives out false information.",
        "Blockchain is a technology that has been spoken about for many years, and a host of industries ranging from finance to health care have been looking at ways to use it.",
        "Sheila Warren, the CEO of the Crypto Council for Innovation, said, however, that a blockchain-based AI training data ledger could be the “killer use case” for the technology.",
        "“I actually do think that the verification of an AI and sort of the checks and balances ... within an AI system, are going to be blockchain driven and blockchain backed,” Warren told CNBC during the panel."
      ]
    },
    "publishedDate": "2024-01-22T00:00:00"
  },
  {
    "id": -2128888440,
    "title": "Why spot ETFs may be a game changer for bitcoin",
    "sourceUrl": "https://www.cnbc.com/2024/01/13/why-spot-etfs-may-be-a-game-changer-for-bitcoin-.html",
    "author": "Emily Glass",
    "content": {
      "elements": [
        "The Securities and Exchange Commission’s approval of 11 spot bitcoin ETFs this week could be a turning point for cryptocurrency investing.",
        "Ark Invest CEO and Chief Investment Officer Cathie Wood is behind one of the new ETFs. Her firm partnered with 21Shares to launch the ARK 21Shares Bitcoin ETF.",
        "“We really believe this is an important moment for us to help with the democratization of bitcoin access, giving more people access,” Wood told “ETF Edge” on Monday.",
        "The first-ever batch of spot ETFs began trading Thursday. Investor interest in bitcoin\nleading up to the historic ETF approvals has been on the upswing. As of Friday, the cryptocurrency is up more than 125% in the past 12 months.",
        "As financial firms begin to get more exposure through the new instruments, Wood said, the impact on bitcoin prices will be noticeable. ",
        "“If institutions with trillions of dollars under management just put 0.2[%] or 0.5% in, that could really move the needle,” Wood said.",
        "Ophelia Snyder’s firm 21.co is heavily involved in the cryptocurrency space. According to its website, the firm “bridges traditional finance and decentralized finance for easy crypto access.”",
        "“It’s also very much part of a new wave of disruptive technology,” the firm’s president and co-founder told “ETF Edge.”",
        "Snyder contended that bitcoin goes beyond being just a new asset class.",
        "“There’s still quite a ways to go in terms of how this actually will interact both with the world at large and sort of our economic systems, as well as, quite frankly, how it will end up interacting with your portfolio,” she said. ",
        "Snyder also said the impact that wider bitcoin access could have on the broader market “can’t be underestimated.”",
        "Disclaimer"
      ]
    },
    "publishedDate": "2024-01-24T00:00:00"
  },
  {
    "id": 118453066,
    "title": "Bitcoin tops $41,000 and hits 19-month high on ETF hopes, bets on Fed cuts",
    "sourceUrl": "https://www.cnbc.com/2023/12/04/bitcoin-tops-40000-for-first-time-in-2023-on-etf-hopes-bets-on-fed-cuts.html",
    "author": "Sheila Chiang",
    "content": {
      "elements": [
        "Bitcoin\nbuilt on its recent rally and hit its highest level in more than a year on Monday, bolstered by anticipation of a bitcoin exchange-traded fund approval and bets on U.S. interest rate cuts.",
        "The world’s largest cryptocurrency surged more than 5% on Monday to a 19-month high, and was trading at $41,809 as of 4:00 pm ET after briefly topping $42,000 earlier in the day, based on Coin Metrics data. This is the first time since April 2022 that bitcoin has breached the $40,000 level, according to LSEG. Bitcoin is now up more than 150% from the start of the year.",
        "This comes after scandals rocked the market including the collapse of crypto exchange FTX in November last year. Last month, FTX founder Bankman-Fried was found guilty of all seven criminal charges brought against him related to the collapse of his crypto empire.",
        "“Now that $40,000 has been revisited for the first time in almost 19 months, $48,000 and $52,000 look to be the next significant lines in the sand,” said Antoni Trenchev, co-founder of digital asset company Nexo.",
        "CNBC reported last week that U.S. Securities and Exchange Commission officials met with representatives from Grayscale, BlackRock and the Nasdaq. In a memo, the SEC said it met with Grayscale on Thursday about the potential conversion of the Grayscale Bitcoin Trust into an ETF. The SEC had previously blocked this move, but Grayscale challenged that decision in court and won.",
        "This boosted confidence in the market that a bitcoin ETF may eventually be approved, pushing up the price of the world’s largest cryptocurrency.",
        "“How swiftly Bitcoin marches towards $50,000 might well depend on when a spot-Bitcoin ETF is approved and even then, there’s no guarantee the much anticipated nod from the SEC will put a rocket booster under the price,” said Trenchev.",
        "During a fireside chat on Dec. 1, Federal Reserve Chairman Jerome Powell said it’s too early to talk about cutting interest rates right now, and the central bank will be “keeping policy restrictive” until policymakers are sure that inflation is returning solidly to 2%.",
        "“Like most forecasters, my colleagues and I anticipate that growth in spending and output will slow over the next year, as the effects of the pandemic and the reopening fade and as restrictive monetary policy weighs on aggregate demand,” he said, according to a transcript.",
        "His comments gave rise to expectations the Fed is probably done raising interest rates for now, as the series of rate hikes since March 2022 have cut into economic activity.",
        "Yet at the same time, Powell said it is “premature to conclude with confidence that we have achieved a sufficiently restrictive stance” and that more hikes could follow.",
        "– CNBC’s Jesse Pound and Jeff Cox contributed to this report."
      ]
    },
    "publishedDate": "2023-12-04T00:00:00"
  },
  {
    "id": 1899953184,
    "title": "Singapore to tighten crypto regulations for retail customers",
    "sourceUrl": "https://www.cnbc.com/2023/11/24/singapore-to-tighten-crypto-regulations-for-retail-customers.html",
    "author": "Sheila Chiang",
    "content": {
      "elements": [
        "Singapore will introduce tighter rules for cryptocurrency service providers, following feedback on its proposed regulations, said the city-state’s financial authority.",
        "“The consulted proposals detail business conduct and consumer access measures to limit potential consumer harm,” the Monetary Authority of Singapore said in a statement on Thursday.",
        "The measures will include barring crypto service providers in Singapore from accepting locally issued credit card payments, offering incentives to trade in cryptocurrencies and providing financing, margin or leverage transactions for retail customers. The finalized measures will take effect in phases starting in mid-2024, said MAS.",
        "The regulator will also issue rules pertaining to business conduct, such as requiring crypto service providers to publish policies, procedures and criteria that govern the listing of a digital payment token and establish effective procedures to handle customer complaints and resolve disputes.",
        "“DPT service providers have the obligation to safeguard the interests of consumers who interact with their platforms and use their services,” said Ho Hern Shin, deputy managing director of financial supervision at MAS.",
        "“While these business conduct and consumer access measures can help meet this objective, they cannot insulate customers from losses associated with the inherently speculative and highly risky nature of cryptocurrency trading,” said Ho.",
        "“We urge consumers to remain vigilant and exercise utmost caution when dealing in digital payment token services, and to not deal with unregulated entities, including those based overseas.”",
        "MAS has repeatedly warned that trading crypto is highly risky and not suitable for the general public, as crypto prices are subject to volatility and speculation.",
        "Singapore’s Payment Services Act — a framework for regulating payment services and the provision of crypto services to the public — first came into effect in January 2020.",
        "Singapore has since stepped up supervision on crypto firms. In July, it ordered firms to safekeep customer assets under a statutory trust before the end of the year. MAS also restricts firms from facilitating lending or staking of their retail customers’ assets.",
        "In January 2022, Singapore banned crypto service providers from promoting their services in public areas or through third parties such as social media influencers. Crypto service providers can only market or advertise on their own corporate websites, mobile applications or official social media accounts.",
        "At the Singapore FinTech Festival 2023 last week, MAS managing director Ravi Menon said that cryptocurrencies “have failed the test of digital money.”",
        "“They have performed poorly as a medium of exchange or store of value. The prices are subject to sharp speculative swings. Many investors in these cryptocurrencies have suffered significant losses,” said Menon."
      ]
    },
    "publishedDate": "2023-11-23T00:00:00"
  },
  {
    "id": -421943699,
    "title": "$115 million stolen from two crypto firms linked to Justin Sun after hack",
    "sourceUrl": "https://www.cnbc.com/2023/11/23/htx-heco-chain-crypto-hack-115-million-stolen-so-far.html",
    "author": "Arjun Kharpal",
    "content": {
      "elements": [
        "Two cryptocurrency platforms linked to high-profile digital entrepreneur Justin Sun were hacked in two exploits that may have stolen an estimated $115 million to date.",
        "The targeted projects include the HTX digital currency exchange, formerly known as Huobi, from which hackers drained around $30 million worth of cryptocurrencies, the company said in a statement on Wednesday.",
        "So-called blockchain bridge Heco Chain, was also attacked, HTX confirmed.",
        "Sun, who is an investor in HTX and linked to the Heco Chain, confirmed the events.",
        "A blockchain bridge connects different networks to allow the fast swap and movement of various cryptocurrencies,. These chains have proven to be vulnerable to hacking.",
        "Market analytics firm CryptoQuant assesses that a total of $85.4 million worth of cryptocurrency has been stolen from the Heco Chain. It was largely denominated in stablecoin USDT\nand ether\n.",
        "A large amount of HTX’s native cryptocurrency, HBTC, was also stolen. The price of HBTC was down more than 5% versus 24 hours before, according to data from CoinGecko.",
        "CNBC has reached out to HTX for comment on Heco Chain losses.",
        "HTX said that it is identifying the source of the attack and “has implemented urgent measures to protect user assets.” The exchange has temporarily suspended deposit and withdrawal services on both HTX and Heco Chain as a “precautionary measure.”",
        "The company also said that it will “fully compensate for any losses incurred due to the hot wallet attack.” A hot wallet refers to a cryptocurrency wallet which is connected to the internet.",
        "CryptoQuant data showed that around 11,100 ether tokens have been moved from the HTX exchange in the last few hours. This is around $23 million worth of cryptocurrency and is mainly the result of hackers stealing the digital coins, as well as a few users trying to get their money from the exchange, a spokesperson for CryptoQuant told CNBC.",
        "CryptoQuant analyst Bradley Park said the hackers are switching their stolen assets into the more liquid ether asset because stablecoins USDT and USDC can be frozen.",
        "Tether, which issues USDT and Circle, the company behind USDC, were not immediately available for comment when contacted by CNBC.",
        "The HTX hack comes after another exchange backed by Sun, Poloniex, suffered a hack this month that led $100 million worth of cryptocurrencies being stolen."
      ]
    },
    "publishedDate": "2023-11-23T00:00:00"
  },
  {
    "id": -1021519600,
    "title": "Mastercard says wide adoption of CBDCs would be ‘difficult’ right now",
    "sourceUrl": "https://www.cnbc.com/2023/11/17/mastercard-says-wide-adoption-of-cbdcs-is-difficult.html",
    "author": "Sheila Chiang",
    "content": {
      "elements": [
        "SINGAPORE — There isn’t enough justification for the widespread use of central bank digital currencies right now, which makes broad adoption of such assets “difficult,” Ashok Venkateswaran, Mastercard\n’s blockchain and digital assets lead for Asia-Pacific, told CNBC.",
        "“The difficult part is adoption. So if you have CBDCs in your wallet, you should have the ability for you to spend it anywhere you want – very similar to cash today,” said Venkateswaran on the sidelines of Singapore FinTech Festival on Wednesday.",
        "A retail CBDC, which is the digital form of fiat currency issued by a central bank, caters to individuals and businesses, facilitating everyday transactions. This is different from a wholesale CBDC which is used exclusively by central banks, commercial banks and other financial institutions to settle large-value interbank transactions.",
        "The International Monetary Fund has said that CBDCs are “a safe and low-cost alternative” to cash, with approximately 60% of countries in the world exploring CBDCs. However, only 11 countries have adopted them, with an additional 53 in advanced planning stages and 46 researching the topic as of June, according to data from the Atlantic Council.",
        "“But [building infrastructure to facilitate that] takes a lot of time and effort on a part of the country to do that. But a lot of the central banks nowadays have gotten very innovative because they are working very closely with private companies like ours, to create that ecosystem,” said the Asia-Pacific lead.",
        "Even then, Venkateswaran said consumers are “so comfortable using today’s type of money” that “there isn’t enough justification to have a CBDC.”",
        "Mastercard, the second-largest card network in the U.S., said last week it has completed testing of its solution in the Hong Kong Monetary Authority’s e-HKD pilot program to simulate the use of a retail CBDC such as electronic Hong Kong dollars.",
        "Hong Kong’s CBDC sandbox facilitates the trial of minting, distributing and spending of e-HKD within the program.",
        "A total of 16 companies across the financial, payments and technology sectors including Mastercard participated in the pilot. Mastercard’s rival Visa also took part in the project alongside HSBC Bank\nand Hang Seng Bank\n, testing the viability of tokenized deposits in business-to-business payments.",
        "Venkateswaran cited Singapore as an example where the case for retail CBDC is not compelling enough as the city-state has a “very efficient” payments system.",
        "Last year, the IMF’s deputy managing director Bo Li named Singapore and Thailand as the countries in Asia which have made “quick progress” by connecting fast payment systems, therefore lowering transaction fees for cross-border payments.",
        "“There isn’t a reason for a retail CBDC [in Singapore] but there is a case for a wholesale CBDC for interbank settlements,” said Venkateswaran.",
        "On Thursday, Singapore’s central bank announced it will be piloting the live issuance and use of wholesale CBDCs from 2024.",
        "During the pilot, the Monetary Authority of Singapore will collaborate with domestic banks to test the use of wholesale CBDCs to facilitate domestic payments, said the managing director of the Monetary Authority of Singapore, Ravi Menon.",
        "It really depends on the need of the country or what problem they are trying to solve, said Mastercard’s Venkateswaran.",
        "It won’t work “if you’re only trying to replace your existing domestic payment network,” he said.",
        "“But if it’s a country where the domestic payment network is not as robust, it may make sense to have a CBDC.”"
      ]
    },
    "publishedDate": "2023-11-19T00:00:00"
  },
  {
    "id": 1630423854,
    "title": "Singapore to pilot use of wholesale central bank digital currencies in 2024",
    "sourceUrl": "https://www.cnbc.com/2023/11/17/singapore-to-pilot-wholesale-central-bank-digital-currencies-in-2024.html",
    "author": "Sheila Chiang",
    "content": {
      "elements": [
        "SINGAPORE — Come 2024, Singapore will pilot the live issuance and use of wholesale central bank digital currencies, said Ravi Menon, managing director of the Monetary Authority of Singapore.",
        "“We will take our experiments a step further next year,” said Menon at Singapore FinTech Festival 2023 on Thursday, without specifying more details on the timeframe.",
        "“I’m pleased to announce that MAS will pilot the live issuance of wholesale CBDCs to instantaneously support payments across commercial banks here,” Menon said. MAS is the city-state’s central bank and financial regulator.",
        "Wholesale CBDC is a digital currency issued by a central bank, that’s used exclusively by central banks, commercial banks or other financial institutions to settle large-value interbank transactions. It’s unlike retail CBDCs which cater to individuals and businesses, facilitating everyday transactions.",
        "“Since 2016, the MAS has conducted many experiments with other central banks and the financial industry to explore the use of wholesale CBDCs on distributed ledgers to facilitate real time cross border payments and settlements,” said Menon, referring to the database spread across a network that is accessible from several geographical locations.",
        "One such pilot project is Project Ubin, which was started in 2016 to explore the use of blockchain and digital ledger technology for the clearing and settlement of payments and securities.",
        "Project Ubin was successfully completed in 2021 after five phases of experimentation. Some of the partners included Singapore’s largest bank DBS and sovereign wealth fund Temasek.",
        "MAS announced Ubin+ in November last year to advance cross-border connectivity with wholesale CBDCs through collaborations with international partners.",
        "During the pilot, Singapore’s central bank will partner with local banks to test the use of wholesale CBDCs to facilitate domestic payments, said Menon.",
        "Banks will issue tokenized bank liabilities in the form of claims in balance sheets. Retail customers can then use the tokenized bank liabilities in transactions with merchants, who will then credit these bank liabilities with their respective banks. Tokenization refers to the process of issuing a digital form of an asset on a blockchain.",
        "The CBDC will then be automatically transferred to the merchant as a form of payment during the transaction.",
        "“So clearing and settlement occurs in a single step on the same infrastructure, unlike the current system in which clearing and settlement take place on different systems and settlement occurs with a lag,” said Menon.",
        "On Wednesday, the International Monetary Fund’s managing director urged the public sector to keep preparing to deploy CBDCs and related payment platforms in the future.",
        "“We have not yet reached land. There is so much more space for innovation and so much uncertainty over use-cases,” said Kristalina Georgieva.",
        "Menon is set to retire from public service and step down as managing director of MAS on Dec. 31 since being appointed to the position in 2011. He will be succeeded by Chia Der Jiun who previously spent 18 years at MAS."
      ]
    },
    "publishedDate": "2023-11-16T00:00:00"
  },
  {
    "id": 459945044,
    "title": "IMF says central bank digital currencies can replace cash",
    "sourceUrl": "https://www.cnbc.com/2023/11/15/imf-says-central-bank-digital-currencies-can-replace-cash.html",
    "author": "Sheila Chiang",
    "content": {
      "elements": [
        "SINGAPORE — Central bank digital currencies have the potential to replace cash, but adoption could take time, said Kristalina Georgieva, managing director of the International Monetary Fund on Wednesday.",
        "“CBDCs can replace cash which is costly to distribute in island economies,” she said Wednesday at the Singapore FinTech Festival. “They can offer resilience in more advanced economies. And they can improve financial inclusion where few hold bank accounts.”",
        "CBDCs are the digital form of a country’s fiat currency, which are regulated by the country’s central bank. They are powered by blockchain technology, allowing central banks to channel government payments directly to households.",
        "“CBDCs would offer a safe and low-cost alternative [to cash]. They would also offer a bridge to go between private monies and a yardstick to measure their value, just like cash today which we can withdraw from our banks,” the IMF chief said.",
        "The IMF has said that more than 100 countries are exploring CBDCs – or approximately 60% of countries in the world.",
        "“The level of global interest in CBDCs is unprecedented. Several central banks have already launched pilots or even issued a CBDC,” the IMF said in a September report.",
        "According to a 2022 survey conducted by the Bank for International Settlements, of the 86 central banks surveyed, 93% said they were exploring CBDCs, while 58% said they were likely to or may possibly issue a retail CBDC in either the short or medium term.",
        "But as of June, only 11 countries have adopted CBDCs, with an additional 53 in advanced planning stages and 46 researching the topic, according to data from the Atlantic Council.",
        "Referring to a 2018 speech by her predecessor Christine Lagarde, when the former IMF chief encouraged policymakers to follow the “winds of change” and explore the use of CBDCs, Georgieva said: “Five years on, I’m here to provide an update on that voyage.”",
        "“First, countries did set sail. Many are investigating CBDCs and are developing regulation to guide digital money developments,” said Georgieva referring to the speech.",
        "On Wednesday, the fund launched a CBDC handbook as a reference guide for policymakers around the world. Georgieva said many countries are investigating CBDCs and developing regulation to guide digital money developments.",
        "“Second, we have not yet reached land. There is so much more space for innovation and so much uncertainty over use-cases,” Georgieva told an audience which included industry experts, investors and journalists.",
        "“In some countries the case seems dim today, but even they should remain open to potentially deploy CBDCs tomorrow. Why?” said Georgieva. “This is not the time to turn back.”",
        "“The public sector should keep preparing to deploy CBDCs and related payment platforms in the future. Fourth, these platforms should be designed from the start to facilitate cross-border payments, including with CBDCs,” the managing director said.",
        "Countries that have issued retail CBDC include the Bahamas, Jamaica and Nigeria.",
        "Singapore’s Monetary Authority of Singapore has said that cash is “generally incompatible” with the digital economy. In a 2021 report, the country’s central bank said the demand for cash as a means of payment is set to decline further.",
        "According to the BIS, using CBDCs for cross-border payments could lower the costs of obtaining, storing and spending foreign currency, depending on design and regulations.",
        "Georgieva also said that artificial intelligence “could amplify some of the benefits of CBDCs” by providing accurate credit scoring and personalized support.",
        "Demand for generative AI has boomed following the release of OpenAI’s ChatGPT in November last year, which was estimated to have reached 100 million monthly active users within two months after launch.",
        "“It could improve financial inclusion by providing rapid, accurate credit scoring based on various data. It could provide personalized support to people with low financial literacy,” said Georgieva.",
        "“To be sure, we need to protect personal privacy and data security, and avoid embedded biases so we don’t perpetuate inequality but aim to reduce it. Managed prudently, AI could help,” she added."
      ]
    },
    "publishedDate": "2023-11-16T00:00:00"
  },
  {
    "id": -210258317,
    "title": "‘No question’ that decarbonization of shipping will contribute to inflation: CEO",
    "sourceUrl": "https://www.cnbc.com/2023/10/18/shipping-going-green-will-add-to-inflation-no-question-says-ceo.html",
    "author": "Lucy Handley",
    "content": {
      "elements": [
        "The cost of decarbonizing the shipping industry will have a knock-on effect on consumers, according to a CEO in the maritime industry.",
        "“There will be an inflationary impact coming from [the] decarbonization of shipping … there is no question of it,” Bertrand Chen, CEO of the Global Shipping Business Network, told CNBC’s East Tech West conference in the Nansha district of Guangzhou, China.",
        "New European rules that effectively tax shipping lines for their emissions would push up costs, Chen added.",
        "“The EU government is imposing this cost to the shipping line … But now what that means is the shipping has to take action to decarbonize and naturally that will impact all the consumer. So, I think it’s just a trade-off people will have to live with.”",
        "The European Union’s Emissions Trading System (ETS) is set to be extended to the shipping industry starting in January 2024, meaning that large ships entering EU ports will be charged for their carbon dioxide emissions.",
        "The ETS currently covers sectors like mining and aviation and is designed to put a cost on carbon for the region’s most polluting industries.",
        "Chen described the EU initiative as “a natural action that will lead to some interesting effects.”",
        "“Suddenly you need to be able to prove that indeed you’re taking the right action [to decarbonize] and you can see in the shipping line industry some people … are investing in the methanol ships, who are setting up investment funds to go buy those resources, because it’s really hard to buy the alternative fuel. Some are more passive [and] are waiting to see,” he said.",
        "Shipping line Maersk\nlaunched its first vessel with an engine fueled by green methanol in September, but analysts expressed concerns about supply of the alternative fuel.",
        "Shoppers may be willing to spend more on items that have been shipped or produced in a way that “doesn’t create greenhouse gas,” but they will require proof because of the high risk of greenwashing, Chen said.",
        "“Everyone will have to become decarbonized, it’s a question of time. And in that world, what you need is to be able to prove to the end consumer that indeed the action you’re taking is right and that’s something that’s not easy to prove today,” he added.",
        "Using the blockchain to store and give access to legal and financial documents could help the shipping industry provide that proof, Chen said.",
        "Maritime nations agreed in July to reduce emissions “by or around 2050,” during a meeting of the United Nations’ International Maritime Organization.",
        "— CNBC’s Silvia Amaro and Sam Meredith contributed to this report."
      ]
    },
    "publishedDate": "2023-10-18T00:00:00"
  },
  {
    "id": 1590629672,
    "title": "Mastercard ends Binance card partnership in latest blow to crypto giant",
    "sourceUrl": "https://www.cnbc.com/2023/08/25/mastercard-ends-binance-card-partnership.html",
    "author": "Ryan Browne",
    "content": {
      "elements": [
        "Embattled cryptocurrency exchange Binance has lost some business with payment card networks Mastercard and Visa.",
        "The development is a sign of how traditional financial institutions are growing wary of working with the company as it faces intense regulatory scrutiny and wider concerns around financial compliance within the crypto industry.",
        "Mastercard will soon no longer offer Binance-branded cards in Latin America and the Middle East, which let customers user their crypto to purchase goods, Binance said Thursday via X, the company formerly known as Twitter.",
        "“The product, like most debit cards, has been utilized by Binance’s users to pay for basic daily expenses but in this case, the cards are funded with crypto assets,” Binance Customer Support said on Twitter.",
        "“Only a tiny portion of our users (less than 1% of users in the markets mentioned) are impacted by this. Users of this product will have until September 21, 2023, when the card will no longer be available for use.”",
        "“Binance accounts around the world are not affected. Where available, users can also shop with crypto and send crypto using Binance Pay, a contactless, borderless and secure cryptocurrency payment technology designed by Binance,” the company added.",
        "Mastercard confirmed that it is ending the partnership, with a spokesperson telling CNBC that, from Sept. 22, four pilot Binance co-branded Mastercard card programs the company had with Binance in Argentina, Brazil, Colombia and Bahrain “will no longer be in use.”",
        "“This provides cardholders with a wind-down period to convert any holdings in their Binance wallet,” the Mastercard spokesperson said. “There is no impact on any other crypto card program.”",
        "Visa, meanwhile, also moved to distance itself from Binance. The company ended a similar card tie-up with Binance, as it ceased issuing new co-branded cards with the firm in Europe as of July, a spokesperson for the company told Bloomberg.",
        "Binance and Visa were not immediately available for comment when contacted by CNBC.",
        "It’s a sign of how crypto continues to face a broadly tepid response from the financial services industry.",
        "Mastercard had warmed to crypto in recent years. In Oct. 2021, the firm began allowing any bank or merchant the ability to offer crypto services. Last year, the company launched a product allowing banks to assess the risk of crime posed by crypto merchants, and started letting banks offer crypto trading.",
        "For its part, Mastercard said its decision to end the tie-up with Binance has “no impact on our wider commitment to enabling and securing digital assets, which we continue to support.”",
        "Binance faces intense backlash from regulators including the U.S. Securities and Exchange Commission and the Commodity Futures Trading Commission.",
        "The SEC brought 13 charges against Binance and its CEO Changpeng Zhao accusing the company of commingling billions of dollars in customer money with Binance’s own funds, similar to allegations made against the now bankrupt crypto exchange FTX.",
        "Binance denies the allegations.",
        "The firm recently filed a protective order against the SEC, saying the regulator’s requests for information were “over broad” and “unduly burdensome.”",
        "Last week, Checkout.com reportedly dropped Binance as a customer, citing “reports of regulators actions and orders in relevant jurisdictions,” “inquiries from partners,” and concerns over the firm’s anti-money laundering, sanctions and compliance controls.",
        "WATCH: How a $60 billion crypto collapse got regulators worried"
      ]
    },
    "publishedDate": "2023-08-25T00:00:00"
  },
  {
    "id": 1025220065,
    "title": "Why big banks want to put Wall Street on a blockchain",
    "sourceUrl": "https://www.cnbc.com/2023/07/26/why-big-banks-like-jpmorgan-want-put-wall-street-on-a-blockchain.html",
    "author": "Jordan Smith",
    "content": {
      "elements": [
        "Watch Daily: Monday - Friday, 3 PM ET",
        "Banking titans such as JPMorgan\nand Citi\nwant to supercharge Wall Street by borrowing a tool from crypto — tokenizing assets on a blockchain.",
        "“Once you have these assets that are tokenized, there are so many different use cases for them,” said Elliot Han, head of digital assets at Cantor Fitzgerald.",
        "Bernstein said in an analyst note from June that tokenization could unlock faster settlement times and lower costs. The firm projects $5 trillion in assets could be tokenized on blockchains over the next five years.",
        "It takes time to transfer ownership of an asset on Wall Street. Investors must use a broker-dealer to buy or sell an asset on an exchange, and they must wait two business days for that transaction to settle — what is known as “T+2,” or trade plus two days. Banks believe tokenization could cut out those middlemen and allow for near-instant transactions.",
        "“A traditional stock certificate is nothing more than a token that represents ownership of the keys of a company,” said James Angel, an associate professor at Georgetown University.",
        "The technology could face regulatory headwinds. U.S. agencies like the Securities and Exchange Commission are cracking down on crypto companies. In May, the agency sued crypto exchanges Binance and Coinbase over alleged securities violations, and Chair Gary Gensler also requested millions of dollars in increased funding to rein in the “Wild West” of crypto.",
        "Watch the video above to learn why big banks are spending millions on tokenization."
      ]
    },
    "publishedDate": "2023-07-26T00:00:00"
  },
  {
    "id": 465352570,
    "title": "Vietnam’s digitalization efforts fuel startup scene",
    "sourceUrl": "https://www.cnbc.com/2023/07/12/vietnams-digitalization-efforts-fuel-startup-scene.html",
    "author": "Nyshka Chandran",
    "content": {
      "elements": [
        "Vietnam’s tech startups are reaping the benefits as the country sets its sights on becoming a fully digital society by 2030.",
        "In 2020, the government announced its national strategy on digital transformation, which aims to increase the digital economy’s share of gross domestic product from 14% currently to 20% by 2025.",
        "The Southeast Asian nation hopes to become a high-income economy by 2045 by focusing on its digital economy.",
        "According to the World Bank, “If digital sectors expand by about 10 percent every year, the cumulated monetary gains for the economy will exceed US$200 billion over 2021-45, or about the size of the country’s current GDP.”",
        "That’s why officials are rolling out the red carpet for tech entrepreneurs.",
        "In 2021, new startup support centers Hanoi, Da Nang and Ho Chi Minh City were announced. One year later, a roadmap for boosting innovation in science was revealed, with promises to spend 1% of GDP on scientific research.",
        "Last year, the country pledged to introduce business innovation surveys to monitor the development of startups.",
        "Vietnam’s start-ups attracted a lot of investor interest in 2022, according to a recent report by venture fund Do Ventures and the National Innovation Center, a government unit under the Ministry of Planning and Investment.",
        "It ranked third in terms of deal count in Southeast Asia, and fourth in deal value last year, the report said. Notably, domestic funds were the top investors in local startups last year, accounting for 45% of total deal value. ",
        "However, the total value of investment in Vietnamese startups was only $634 million in 2022 — down 56% year-on-year from the record high of $1.4 billion in 2021, the report noted.",
        "Fintech, retail, health care and payments were the most in-demand sectors for funding, it said.",
        "The country’s current tech unicorns include electronic payment solutions provider VNPay, gaming startup-turned-conglomerate VNG, smartphone e-wallet Momo and blockchain player Sky Mavis, the maker of NFT-based game Axie Infinity.",
        "Other names making waves include M Village, which offers co-living housing for young professionals, and TopCV, which focuses on resume creation tools to job-seekers.",
        "Digitalization is particularly important for agriculture, one of the country’s most important economic sectors.",
        "In 2022, the Ministry of Agriculture and Rural Development announced plans to build smart rural areas by 2025, specifically focused on improving production efficiency and introducing specialized digital infrastructure for farmers.",
        "“Without going digital, transformation in farming activities and integration among stakeholders along the value chain would be a downward spiral for Vietnam agriculture, not only affecting farmers’ lives, but also all others,” said Tran Thi Nguyen, founder of Koima, an agritech startup.",
        "It helps small-scale farmers increase their income, transform their traditional farm to agroforestry, which improves biodiversity, and gain access to financing without high interest rates through its crowdfunding platform.",
        "Speaking to CNBC, a number of local investors identified their core areas of focus, which range from retail to logistics.",
        "Venture capital firm ThinkZone Ventures has invested in 17 local tech-enabled startups with a collective valuation of nearly $200 million since the company was started in 2018. It believes health care, food and logistics, including transportation and delivery solutions, are particularly ripe for technology disruption. Each one boasts compelling growth potential based on soaring consumer activity from Vietnam’s expanding middle class, a company spokesperson said.",
        "VinaCapital calls itself one of the first venture capital investors in Vietnam. It’s invested in 18 early-stage tech startups through its $100 million platform, VinaCapital Ventures, as well as maintaining 58 direct investments through its portfolio companies. It prioritizes startups that provide tech-enabled solutions to improve existing systems in agriculture, financial services, logistics, media and retail. Emerging technologies such as blockchain, AI, and electric vehicle infrastructure are some areas it believes will drive economic transformation going forward.",
        "VIC Partners said it has invested in about 15 innovative companies since 2017, injecting around $100,000 to $200,000 for the first check in each deal, followed by another $100,000 to $200,000 in the following round.",
        "Managing director Tung A. Tran said VIC is particularly bullish about ecommerce.",
        "“We have invested in B2B SaaS companies that enable ecommerce businesses in recruitment, sales, marketing, payment, customer care, logistics and fulfilment,” he said, referring to cloud-based software programs that service the corporate world.",
        "“We also invest in innovative ecommerce companies that sell directly to consumers through social media and implement technology in seamless business operations.” ",
        "Despite the influx of capital entering the digital tech field, investors warn of several structural obstacles that could limit growth going forward.",
        "At the top of the list was regulatory framework such as tax, intellectual property rights and data protection required to create the most conducive environment for tech.",
        "“The absence of global-class human resources is also a prevailing issue,” ThinkZone noted. “While Vietnam possesses skilled and seasoned professionals in programming, development, design, and various other roles, they have yet to reach the pinnacle of excellence.”",
        "“Limited investment in research and development by large corporations is a significant obstacle for Vietnamese startups,” according to VinaCapital.",
        "“It limits the potential for cross-industry collaboration and innovation, making it more difficult for startups to find potential acquirers or partners who are interested in their products or services.”",
        "VIC Partners is most concerned about the global economic downturn. The firm expects cash flow issues to wipe out many tech startups in 2023 and 2024 while pushing more young people to pursue traditional business models, which would deprive the startup market of new ideas.",
        "Once capital inflows are injected again into the developed market, it will take some time to trickle down to emerging countries like Vietnam, and then from the listed market to private equity and venture capital players, said Tran from VIC Partners.",
        "“I predict 2023 and 2024 to be very good years for pre-IPO and [private equity] opportunities. Then from 2025-2026, the VC market in Vietnam may flourish again with another batch of great companies.”"
      ]
    },
    "publishedDate": "2023-07-20T00:00:00"
  },
  {
    "id": -1331736647,
    "title": "Binance to exit the Netherlands after failing to obtain regulatory approval",
    "sourceUrl": "https://www.cnbc.com/2023/06/16/binance-to-exit-the-netherlands-as-it-fails-to-get-regulatory-approval.html",
    "author": "Ryan Browne",
    "content": {
      "elements": [
        "Watch Daily: Monday - Friday, 3 PM ET",
        "Cryptocurrency exchange Binance said it will leave the Netherlands after the company’s application to register under the Dutch crypto authorization regime was rejected.",
        "Referring to a virtual asset service provider, Binance on Friday said that it could no longer serve Dutch clients “as we have been unable to register as a VASP with the Dutch regulator.”",
        "The company didn’t give a reason for why it was unable to receive a license from regulators.",
        "Starting Friday, no new Binance users will be accepted onto the platform. From July 17, Binance said it will cease allowing users to buy tokens, trade, or make deposits, although its withdrawal function remains active.",
        "Binance recommended that users withdraw their assets from their accounts.",
        "The Dutch central bank, which is responsible for authorizing new virtual asset services providers, was not immediately available for comment.",
        "Under the current regulatory regime, Binance can only get approval to operate in an EU country by registering under its money laundering prevention rules.",
        "The firm has so far received such approvals in France, Italy, Spain, Poland, Sweden and Lithuania. This is set to change once the EU approves its Markets in Crypto Assets (MiCA) regulation.",
        "MiCA aims to harmonize crypto regulation across the bloc and to prevent bad actors from harming consumers, particularly in the wake of the shock bankruptcy of FTX in November.",
        "Once MiCA comes into force, crypto firms with registration in one EU country will be able to then use that to offer their services across other member states.",
        "Binance said it remains “committed to working collaboratively with regulators around the world and are additionally focused on getting our business ready to be fully MiCA compliant.”",
        "“Existing Dutch resident users are being sent an email with comprehensive information about what this means for their accounts and any assets they currently have on the Binance platform, alongside any steps they will need to take,” a Binance spokesperson told CNBC.",
        "“While Binance is disappointed that this has become necessary, it will continue to engage productively and transparently with Dutch regulators.”",
        "The latest blow to the crypto giant follows a tumultuous few months for the broader cryptocurrency industry. Last week, the U.S. Securities and Exchange Commission sued Binance and CEO Changpeng Zhao, alleging that they engaged in the unregistered offer and sale of securities and commingled investor funds with their own.",
        "WATCH: How a $60 billion crypto collapse got regulators worried"
      ]
    },
    "publishedDate": "2023-06-16T00:00:00"
  },
  {
    "id": 269365574,
    "title": "Coinbase CEO says SEC is on ‘lone crusade,’ dials back on suggestion exchange may relocate",
    "sourceUrl": "https://www.cnbc.com/2023/05/08/coinbase-ceo-on-us-crypto-regulation-sec-lawsuit-international-plans.html",
    "author": "Ryan Browne",
    "content": {
      "elements": [
        "The CEO of cryptocurrency exchange Coinbase\n, Brian Armstrong, doubled down on his criticisms of the U.S. Securities and Exchange Commission chief Gary Gensler Monday, but added the exchange would not leave the U.S. despite the regulatory uncertainty the company is facing in the country.",
        "Coinbase has been under intense regulatory scrutiny in the U.S. lately following a grim year for the crypto industry which saw major companies like FTX and Terra fail, prices plunge, and investors lose billions of dollars in the process.",
        "The SEC earlier this year served Coinbase with a Wells Notice, a letter that the regulator sends to a company or firm at the conclusion of an SEC investigation that states the SEC is planning to bring an enforcement action against them.",
        "At the heart of the regulator’s dispute with Coinbase, and a host of other crypto companies, is the allegation that it is selling unregistered securities to investors. Coinbase disputes this.",
        "“The SEC is a bit of an outlier here,” Armstrong told CNBC’s Dan Murphy in an interview in Dubai Monday. “There’s kind of a lone crusade, if you will, with Gary Gensler, the chair there, and he has taken a more anti-crypto view for some reason.”",
        "“I don’t think he’s necessarily trying to regulate the industry as much as maybe curtail it. But he’s created some lawsuits, and I think it’s quite unhelpful for the industry in the U.S. writ large, but it also is an opportunity for Coinbase to go get that clarity from the courts that we feel will really benefit the crypto industry and also the U.S. more broadly.”",
        "The SEC declined to comment when contacted by CNBC.",
        "Armstrong also rowed back on a suggestion he made last month that the company may be forced to move its headquarters overseas.",
        "“Coinbase is not going to relocate overseas,” Armstrong said. “We’re always going to have a U.S. presence ... But the U.S. is a little bit behind right now.”",
        "“I would say we’re seeing more thoughtful approaches, for instance, in the EU [European Union], they’ve actually already passed comprehensive crypto legislation, the U.K. has been incredibly welcoming, and for us there, and that’s been a hub where we’ve decided to serve the U.K. market.”",
        "At a fintech conference in London in April, Armstrong said that Coinbase may consider relocating outside the U.S. if the current regulatory headwinds persist. He said the U.S. “has the potential to be an important market in crypto” but right now is not delivering regulatory clarity.",
        "If this goes on, he said, then Coinbase would consider options of investing more abroad, including relocating from the U.S. to elsewhere.",
        "Still, Armstrong said Monday that Coinbase was looking to increase its international investments, stating it is “very interested” in the United Arab Emirates as a country to do more investment in. Dubai has been a notably favorable regulator when it comes to crypto, courting business from the likes of Binance and Kraken.",
        "Noting that it was his first visit to the UAE, Armstrong said: “I’m here to learn and listen and meet with the relevant regulators both in Abu Dhabi and here in Dubai and decide if this is a good place for us to serve a large region of the world.”"
      ]
    },
    "publishedDate": "2023-05-08T00:00:00"
  },
  {
    "id": -395315204,
    "title": "Crypto has ‘lost its shine’ for institutional investors, says Northern Trust executive",
    "sourceUrl": "https://www.cnbc.com/2023/05/04/crypto-has-lost-its-shine-for-institutional-investors-says-northern-trust-executive.html",
    "author": "Tanaya Macheel",
    "content": {
      "elements": [
        "Watch Daily: Monday - Friday, 3 PM ET",
        "Institutional investors lost interest in crypto after 2022 and even with this year’s uptrend, their appetite for it hasn’t come back yet, according to Northern Trust’s head of digital assets and financial markets.",
        "Justin Chapman told CNBC’s “Crypto World” at the Digital Assets Week conference in San Francisco that institutions have shifted their focus to cryptocurrencies’ underlying blockchain technology, but that his firm “has capabilities” in place should client interest in crypto assets rebound.",
        "“Just after March the crypto market went off a cliff… the client interest has definitely gone off the same cliff in terms of institutional interest in in cryptocurrencies,” he said.",
        "“It’s definitely quiet now, since 2022, from the institutional side,” he continued. “Before that, we were seeing traditional fund managers looking to launch crypto funds, ETPs in Europe, which is the equivalent of ETFs in the U.S. — that’s really gone quiet. Even the hedge funds, who are pretty active in the markets, have certainly reduced their exposure within that particular space.”",
        "Meanwhile, leaders from the biggest financial institutions gathered at the San Francisco conference were energized when it came to the blockchain technology – specifically its potential to help tokenize real-world assets like gold for clients.",
        "The “evolution of the technology” is moving into a “better place” in terms of support from market participants, Chapman said.",
        "“As a firm, we have capabilities that sit there to administer [crypto trading] functions, but it’s a pretty quiet market at the moment and [after] most of the issues we had last year, we haven’t seen a rebound at all on the institutional side yet,” he said.",
        "Specifically, Northern Trust partnered with Standard Chartered in 2020 to launch Zodia, a crypto custodian for institutional investors.",
        "Bitcoin\nhas gained almost 75% this year after losing 64% in 2022. Trading was still to begin the year, with volatility falling to historic lows. The regulatory crackdown in the U.S. been a dark cloud over the industry while the banking crisis has helped push bitcoin’s price higher. Both have brought volatility back to the market. Even as bitcoin currently struggles to break above the $30,000 level, investors agree it remains in a long-term uptrend.",
        "“We’re not focused that much on the asset class because the client isn’t at the moment,” Chapman said. “So we’re not seeing that appetite to have that within their portfolios. If that changes, as a firm, we can account for those capabilities. But it’s certainly lost its shine from the institutional perspective.”"
      ]
    },
    "publishedDate": "2023-05-04T00:00:00"
  },
  {
    "id": -1704693955,
    "title": "XRP cryptocurrency jumps as investors hope Ripple will win SEC legal battle",
    "sourceUrl": "https://www.cnbc.com/2023/03/22/xrp-cryptocurrency-jumps-as-investors-hope-ripple-will-win-sec-case.html",
    "author": "Ryan Browne",
    "content": {
      "elements": [
        "The XRP\ncryptocurrency soared on Wednesday as investors grew hopeful that Ripple, a company closely associated with the token, would win its prolonged legal battle with the U.S. Securities and Exchange Commission.",
        "The token was worth around 45 cents at about 8 a.m. ET, according to data from CoinGecko, up over 11% in the last 24 hours. It was earlier trading up as much as 20%.",
        "Traders pointed to a supplemental notice submitted by Ripple on Monday which pointed to a ruling in a separate case concerning Binance.US’ rescue plan for collapsed crypto lender Voyager Digital. Under the plan, Binance’s U.S. unit was to buy all of Voyager’s assets, including its native VGX token, in a $1.3 billion deal.",
        "The SEC rejected the plan, arguing VGX was akin to a security and calling Binance an unregistered securities exchange, according to the notice from Ripple.",
        "However, the judge rejected the SEC’s objections and approved the bankruptcy plan citing what he called the “vagueness” of the regulator’s arguments and stating the SEC had not “offered any guidance at all as to just what it was that the Debtors allegedly were supposed to prove” to demonstrate VGX was not a security, according to the Ripple letter.",
        "The SEC wasn’t immediately available for comment when contacted by CNBC.",
        "The SEC accuses Ripple, CEO Brad Garlinghouse and co-founder Chris Larsen of breaching U.S. securities laws by selling XRP without first registering it with the regulator. Ripple contests the SEC’s allegations, maintaining the view that XRP should be considered a digital currency rather than a security.",
        "Monica Long, president of Ripple, told CNBC Wednesday morning that she was “very hopeful” about achieving a positive resolution to the SEC battle, adding she thinks it will reach a conclusion sometime this year.",
        "Long said she thinks it’s “very unlikely” the judge will rule in favor of the SEC “considering by our view both the facts and the law are on our side.”",
        "If XRP were to be deemed a security, it could have huge ramifications for the digital currency industry.",
        "Floods of tokens may end up falling into the same category, making them regulated financial instruments that would need SEC supervision and frequent transparency disclosures.",
        "Ripple and the SEC have now both submitted their final round of briefs seeking a summary judgment to the case. The case now rests with Judge Analisa Torres of the Southern District of New York, who is expected to issue a verdict soon.",
        "It is not clear when she will make her decision. However, some crypto investors believe an outcome will arrive in the coming days.",
        "XRP “is being bolstered by a potential positive outcome in the SEC case,” Vijay Ayyar, vice president of international at crpyto exchange Luno, told CNBC via email Wednesday.",
        "The token, which is the sixth-largest globally by market value, is also being boosted by the broader crypto market sentiment, Ayyar said.",
        "Bitcoin\nis up 70% since the start of the year and is currently trading above $28,000 for the first time in nine months. Ether\n, the second-biggest token, has risen 50% year-to-date.",
        "“Overall, crypto markets have rallied in the past week or so, given the anticipation of a pause or slow down in interest rates and the slowdown in inflation,” according to Ayyar.",
        "Ripple’s Long said she believed the SEC was regulating through enforcement rather than establishing clear regulations for the sector. Europe is more advanced in its treatment of crypto, she argued, highlighting the bloc’s Markets in Crypto Assets regulation as an example.",
        "“We’re seeing action through enforcement vs. setting clear rules and regulation which is what all of us in the industry desire,” Long said.",
        "“Europe is really emerging as a leader in setting really clear regulations and rules that allow crypto companies and also traditional finance to embrace crypto.”",
        "For its part, the SEC has said it wants all crypto companies and projects to bring their operations into compliance with federal securities laws.",
        "In an interview with CNBC in February after a crackdown on the crypto exchange Kraken, SEC Chair Gary Gensler said, “There’s a handful of tokens that have actually registered. The intermediaries, the storefronts if you wish, the casinos that people are investing in and investing at need to properly comply and disentangle these bundled products.”",
        "“If this field has any chance of survival and success, it’s time-tested rules and laws to protect the investing public.”",
        "In recent weeks, the regulator has taken aim at numerous crypto firms alleging they are engaged in illegal securities offerings.",
        "Stablecoin issuer Paxos said the SEC served it with a notice threatening legal action over claims that BUSD, the native stablecoin of crypto exchange Binance, was a security that should have been registered with the regulator.",
        "The regulator also hit crypto lender Genesis and exchange Gemini with charges alleging a high-yield investment product offered by the two companies should have been treated as a security.",
        "WATCH: Bitcoin at $10,000 — or $250,000? Investors are sharply divided on 2023"
      ]
    },
    "publishedDate": "2023-03-22T00:00:00"
  },
  {
    "id": -1229514715,
    "title": "Web inventor thinks we’re all going to have our own A.I. assistants like ChatGPT",
    "sourceUrl": "https://www.cnbc.com/2023/02/17/tim-berners-lee-thinks-we-will-have-our-own-ai-assistants-like-chatgpt.html",
    "author": "Arjun Kharpal",
    "content": {
      "elements": [
        "More control over your data. No blockchain. And your own personal artificial intelligence assistant, like ChatGPT.",
        "These are all part of the vision of the future of the web, according to internet inventor Sir Tim Berners-Lee and CEO of Inrupt John Bruce, who spoke on CNBC’s Beyond The Valley podcast published Friday.",
        "Inrupt is a company they co-founded which aims to deliver the web inventors’ original vision of the way the internet should work.",
        "Berners-Lee said that when he invented the web in 1989, “if you were sufficiently switched on geeky, you could get yourself a computer. And you could put a web server on it, you could plug it into the internet. And you could have a website.”",
        "“The spirit of the web was incredibly empowering to individuals,” he said.",
        "But in his view, something has gone wrong since, with the concentration of power now in the hands of large internet companies.",
        "“Well, everybody’s on Facebook\n, so they don’t have the website. They all use Mark Zuckerberg’s website,” Berners-Lee said.",
        "“When people look you up on Facebook, you don’t control actually what they see ... Mark Zuckerberg’s algorithms control what news gets fed to them as they’re looking at your stuff,” he told CNBC.",
        "“That’s very disempowering. It is very useful to Facebook. They have a lot of data about people that they they use for targeting them with advertisements ... but what we’ve lost is the ability for individuals to have power.”",
        "His solution? A product that allows users to control their data and how it’s used. Currently, internet companies collect data on users by default, as a way of using their services.",
        "But Berners-Lee and Bruce’s start-up Inrupt is working on a different way forward. The aim is for users to have a single sign-on across different products and services on the internet.",
        "Data will be stored in so-called “pods,” which are basically a person’s personal data online storage container. Individuals can grant a website or service access to their pod, or silo of data, rather than websites taking data by default.",
        "The system is built on an open protocol on the internet called Solid.",
        "“And that’s the ‘yin’ and the ‘yang’ of Inrupt, which is the personal empowerment. And the opportunity for individuals to take more command over their role on the web,” Bruce told CNBC’s Beyond The Valley.",
        "Such an idea would require buy-in from large internet players. But Bruce said there is an “endless trudge” from companies to get more data on users, so they can target them with products and services. But the endeavour is showing diminishing returns for companies, he said.",
        "“The other way of doing it is instead of, you know, figuring out blindly ‘Are you the likely candidate for my product or service?’ How about I just ask you in a legitimate way? And you tell me,” Bruce said, referencing the idea that users would be able to share the data that they want with companies from their pod.",
        "Users will also need to change their behavior, and there needs to be a desire to control their data in this way. Berners-Lee admitted this change wouldn’t come overnight but instead “bit by bit.”",
        "In the wide-ranging Beyond The Valley episode, Bruce and Berners-Lee also addressed new artificial intelligence product ChatGPT which was developed by OpenAI.",
        "Backed by Microsoft, ChatGPT is an AI-powered chatbot, that responds to questions from users.",
        "Berners-Lee said that users can run their own AI, much like their own personal version of Amazon’s Alexa or Apple’s Siri, when they have their own data pods.",
        "That’s because in the future that Berners-Lee sees, users will have all sorts of data stored in their pods — from fitness information to online shopping habits. The AI could use all that data to learn and be able to assist a user.",
        "“Sometimes you have the whole data spectrum — all of the data to do with your collaborations and your coffees and your projects and your dreams. And the books you’re reading and ... all of your life, then that is in your pod. You run AI on that. That could be sweet,” Berners-Lee said.",
        "What Berners-Lee and Bruce are working on at Inrupt is all part of the future of the internet.",
        "Some have termed it Web3, which proponents say will be a decentralized version of the internet — one that is not dominated by a handful of powerful players such as Amazon, Microsoft and Google.",
        "Many Web3 advocates suggest it will be built on some sort of blockchain technology. Blockchain is the technology that first came to light with bitcoin but has since evolved.",
        "But Berners-Lee is keen to call the next generation of the internet Web 3.0, emphasizing the dot.",
        "“It’s not blockchain,” he said.",
        "Web3 proponents suggest blockchain could be used to underpin the future of the internet. But Berners-Lee said the technology is not fast enough nor does it afford enough privacy.",
        "He also said cryptocurrencies like bitcoin are “only speculative.”",
        "Gavin Wood, founder of blockchain infrastructure company Parity Technologies, coined the term “Web3.”",
        "Wood spoke to CNBC last year about his vision for the future of the web in a previous episode of Beyond the Valley. He advocated blockchain technology as part of the future web make-up."
      ]
    },
    "publishedDate": "2023-02-20T00:00:00"
  }
]