[
  {
    "id": -359225865,
    "title": "Yes, PR Does Still Matter in Blockchain, Despite Balaji’s Advice",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/05/24/yes-pr-does-still-matter-in-blockchain-despite-balajis-advice/",
    "author": "Motti Peer",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/w8qUeHGcoYRNRLmhvLAqPedVnGY\u003d/975x534/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/N7YLLIHF5VBXBM7SKMJ3R34AQA.jpg",
          "description": ""
        },
        "To a startup founder working with a PR agency for the first time, the immediate impacts of a resonant campaign or an extended engagement might not seem clear. This seems especially true when notable influencers and entrepreneurs such as Balaji Srinivasan tell founders rather bluntly to “hire creators, not public relators”.\n",
        "This op-ed is part of CoinDesk\u0027s Web3 Marketing Week.\n",
        "Motti Peer is chairman and co-CEO of ReBlonde, a Web3 marketing and PR firm. Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.\n",
        "Srinivasan’s rationale here builds on Tesla’s strategy of dissolving its PR department in 2020 – an unusual move that the company has recently walked back on – further punctuating the frequently unpredictable or erratic behavior of its CEO Elon Musk.\n",
        "While it might make sense for company leaders to make their communications more direct, that doesn’t necessarily mean they should sideline PR as an antiquated tool. As a PR veteran with decades of experience helping companies navigate every kind of success and setback – I’ve witnessed how the expectations around public relations have shifted radically throughout the years.\n",
        "This is especially true in the blockchain arena, where leaders are still getting their feet wet in the communications space and may end up unwittingly jeopardizing the future of their project by ignoring the virtues and value of a communications plan.\n",
        "Srinivasan echoes many talking points that have been leveled at public relations as an industry for years: It’s a relic of the past, cedes too much narrative control to journalists and doesn’t directly contribute to conversion like direct marketing can. His proposed alternative is to take a company-aligned, content-creator-focused approach that forgoes media – or implementing AI to do it – and advises only hiring PR professionals who have rebranded to “creators” with built-in audiences themselves.\n",
        "Let’s be clear: PR and SEO or marketing are not the same thing. Although they fall under the wider “communications” umbrella, it’s wrong to assume that their strategies, KPIs or added value are interchangeable. It also completely misconstrues what PR professionals do by ascribing their only value to sending out press releases.\n",
        "Yes, content is king in any kind of modern communication. But while PR professionals also function as content creators, not all content creators can enter the PR arena.\n",
        "It’s also true that although the media and individual reporters may be friendly – they are not your friends nor part of a company’s marketing and social media team. A project trying to garner consistent media coverage will never do so by posting TikToks or X threads.\n",
        "PR operates in earned media – leveraging company announcements, iron-clad relations with media outlets and reporters, thought leaderships and other content-focused strategies to garner results without needing to pay for it. The idea that PR professionals are “giving precious content away for free” to journalists greatly mischaracterizes what PR content is for.\n",
        "There’s also a fine line between alerting the media about an exciting announcement or development and spamming your audience with news that is not really news. PR professionals can advise on what information to share and add value to an announcement that rewards your efforts in coverage that truly resonates with key audiences and stakeholders.\n",
        "Just because blockchain and crypto are ingrained in internet culture and social media communication doesn’t make traditional PR obsolete. It just requires a bit of a twist that only a team of experienced communications professionals can provide.\n",
        "Pay-to-play placements or paid social content creation will never stack up or achieve the same results as earned media. And any agency, communications team, or freelance publicist purporting that it can be equated is misguided.\n",
        "Simply put: Users have an allergy to paid media. It’s why most people install ad-blocking extensions on their web browser or pay extra for ad-free streaming on Spotify or Netflix. We live in a world bombarded with ads and sponsored content vying for clicks across social media and virtually any other platform. So, unless an ad or influencer campaign is particularly memorable, we naturally develop a blindness to it.\n",
        "That very concretely translates to media consumption. You likely don’t remember the last ten advertisements or sponsored posts you saw on TikTok, but you do remember a thought-provoking article about an interesting company or a podcast with an incisive founder on your daily commute.\n",
        "See also: How Web3 Marketing Changes the Game | Opinion\n",
        "Social media is a fickle thing, and just because a creator or company leader might have an audience doesn’t necessarily mean your project will sustainably gain the same resonance.\n",
        "Likewise, focusing solely on content creators to lead “public relations” efforts won’t help too much in a crisis or controversy, two things that blockchain companies and founders, unfortunately, find themselves prone to. No investor wants to learn about a disappointing quarter from an X post, and no employee wants to hear about impending layoffs from a TikTok.\n",
        "By all means, projects should have an SEO and marketing plan to boost conversion and lead generation, but it cannot substitute the hard work of earned PR or downplay its results.\n",
        "All of these fields come with singular approaches with unique drawbacks, advantages, and expectations. There might be some overlap, but ultimately, the ROI in PR comes from establishing and maintaining a timeless and respected brand – not affiliate link clicks or snarky, ephemeral creator posts.\n",
        "Founders and leaders of startups pushing the boundaries of what’s possible in tech should be wary of these differences, and of any organization that claims to either guarantee coverage or manufacture results that don’t reflect the reality of a company’s standing.\n",
        "Otherwise, flattening a communications strategy to solely focus on social media or quick wins and generally meaningless metrics risks upending the hard work and dedication of a team trying to make innovation a reality.\n"
      ]
    },
    "publishedDate": "2024-05-24T00:00:00"
  }
]