[
  {
    "id": -467085931,
    "title": "Plume, Layer-2 Blockchain for Real-World Assets, Pulls $10M in Seed Funding from Haun, Galaxy",
    "sourceUrl": "https://www.coindesk.com/tech/2024/05/23/plume-layer-2-blockchain-for-real-world-assets-pulls-10m-in-seed-funding-from-haun-galaxy/",
    "author": "Sam Kessler",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/mfUIW-mYkXz9Ud2XDcfN7ffzWj0\u003d/975x512/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/6D2GA7PTEFCYDNX42X5HHIIXE4.jpg",
          "description": ""
        },
        "As blockchain vies for mainstream acceptance this week in the halls of the United States Congress, a growing number of compliance-oriented crypto projects are hopeful that a more favorable regulatory environment could soon lead to a surge in blockchain-based RWAs, or real-world assets.\n",
        "One such startup, Plume, has raised $10 million in seed funding for what it says will be the first layer-2 blockchain purpose-built for RWAs. The round was led by Haun Ventures and included participation from Galaxy Ventures, Superscrypt, A Capital, SV Angel, Portal Ventures and Reciprocal Ventures.\n",
        "Plume\u0027s Ethereum-based blockchain is pitched as a one-stop shop for easily bringing off-chain assets onto blockchains, meaning the protocol helps people navigate the morass of paperwork, custodial requirements and other legwork required to bring things like real estate, art and certain kinds of financial instruments onto blockchains.\n",
        "\"The RWA industry is one of the fastest-growing verticals in crypto today but there remains a critical gap – to date there has not been a permissionless blockchain equipped with fullstack RWA infrastructure to deploy any asset class compliantly,\" the company explained in a statement shared with CoinDesk. \"The robust DeFi ecosystem on Plume enables users to do everything with RWAs – from earning yield, borrowing/lending, trading and speculating with leverage.\"\n",
        "Plume\u0027s underlying technology is based on Arbitrum Nitro – a framework for building layer-2 \"rollup\" chains that write transactions to Ethereum quickly and with low fees. The tech should make it simple for the chain to interoperate and swap assets across other chains in the Arbitrum Orbit ecosystem – a constellation of other rollups built using the same framework.\n",
        "\"When we started talking to protocols, everyone said the same thing: \u0027It takes us anywhere between six months, a year, a year and a half, two years to actually get this asset on-chain before we can even write a single line of code for our protocol,\u0027\" Plume co-founder Chris Yin said in an interview with CoinDesk. \"That\u0027s just a ridiculous way to do things – it\u0027s just duplicative work across every single protocol. We say, let\u0027s standardize that.\"\n",
        "On Plume, \"you have a very comprehensive set of features to actually tokenize an asset – meaning setting up your entity, filing the stuff, taking custody of the assets, doing wallets, automatic set-up, cap table management, on/off-ramping, [know-your-customer] – all of those things are baked in,\" said Yin. \"We just take these products, we integrate them and put a nice UI on it and make sure that it\u0027s nicely modular.\"\n",
        "According to Yin, Plume currently has more than 80 projects deploying real-world assets onto its private test network. \"Everything from collectibles, private credit, real estate – all these things are deploying on Plume,\" he said.\n",
        "Yin says Plume plans to open up its testnet to the public within \"a month or so,\" with a full release to follow later on.\n"
      ]
    },
    "publishedDate": "2024-05-23T00:00:00"
  },
  {
    "id": 961215211,
    "title": "How Blockchain is Reshaping Supply Chains Beyond Finance",
    "sourceUrl": "https://www.coindesk.com/opinion/2024/05/22/how-blockchain-is-reshaping-supply-chains-beyond-finance/",
    "author": "Julie Lamb",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/hp2FlxDNfBq-P821eFHk0lVSbjM\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/TMGV5H2BRVC6BBKAJFCX45V6QU.jpg",
          "description": ""
        },
        "Have you ever wondered about the true potential of blockchain technology beyond its association with ﬁnance? Blockchain offers transparency, security, and eﬃciency, revolutionizing processes and unlocking new opportunities for businesses worldwide. Hence, the expected growth trajectories in the coming years.\n\nBelow we look at how these benefits can provide advantages to companies adopting blockchain tech beyond pure financial applications.\n",
        "You\u0027re reading Crypto Long \u0026 Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.\n",
        {
          "url": "https://www.coindesk.com/resizer/6BVQdTO38xm2qt3_9MI0gu6rCf0\u003d/560x279/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/4BXUQZJRIFEJJLXJFTCKU5MTY4.png",
          "description": ""
        },
        "Transparency: There’s a common misconception that blockchain technology lacks transparency. In reality, it is inherently transparent, thanks to a decentralized ledger system. Each transaction is recorded on a public ledger, enabling quick and easy identiﬁcation of affected products. This transparency enhances accountability and trust in supply chains, ensuring consumer safety and product integrity.\n",
        "Simplicity: While blockchain technology may seem complex at ﬁrst glance, businesses can beneﬁt from simpliﬁed explanations and practical applications. By focusing on real-world case studies and actionable insights, organizations that are using data science like GE, IBM, PayPal, AWS, Uber, John Deere, NASA and others have grasped data-driven insights across various sectors and its potential to streamline operations, enhance security, and drive innovation.\n",
        "Global Adoption: Blockchain is revolutionizing industry applications ranging from supply chain management and healthcare to voting systems and digital identity veriﬁcation. For example, AWS introduced Track and Trace with Amazon Managed Blockchain, a fully-managed service that automatically scales to meet the demands of thousands of applications running millions of transactions. Added benefits to leveraging supply chains with blockchain include scalability, cost reduction, transparency and ease of process automation.\n",
        {
          "url": "https://www.coindesk.com/resizer/5M2hyT2JlaA1VVq_2ZQ3BPwHiQk\u003d/560x201/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/VB2LHXLEJJF35IQXEPB32HZ6MQ.png",
          "description": ""
        },
        "Sustainability: Some major companies are leveraging blockchains for sustainability and fair treatment of workers purposes. In recent news, Mondelēz International, the parent to brands like Oreo, Ritz, Clif Bar, Cadbury, and Toblerone, announced that it’s joining the Hedera Council, the entity that governs the Hedera Network, “a sustainable public ledger for the decentralized economy.” By tapping Web3 tech, the Council expects Mondelēz to increase business efficiency and sustainability and innovate across customer engagement.\n",
        "Conclusion: It\u0027s not too late to explore the vast opportunities in the blockchain space. As the industry continues to evolve and mature, early adopters stand to beneﬁt from investment opportunities, technological advancements, and market growth. Blockchain tech holds immense potential beyond ﬁnance, offering transparency, security, and eﬃciency across various industries. By dispelling myths, embracing opportunities, and staying informed, businesses can harness the power of blockchain to drive innovation, foster trust, and achieve sustainable growth.\n",
        "Note: The views expressed in this column are those of the author and do not necessarily reflect those of CoinDesk, Inc. or its owners and affiliates.\n"
      ]
    },
    "publishedDate": "2024-05-22T00:00:00"
  },
  {
    "id": -1571364743,
    "title": "What to Expect at Consensus 2024: Spotlight on Blockchain Tech",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/05/20/what-to-expect-at-consensus-2024-spotlight-on-blockchain-tech/",
    "author": "Bradley Keoun",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/PkKSrRWHEDJAZr3F8FDxrNpbdYY\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/B4L3WKETQJHN3DQPVPTONOWM3A.jpeg",
          "description": ""
        },
        "Bitcoin layer 2s. Ethereum restaking. Interoperability. AI. DePIN. Next-generation cryptography.\n",
        "These are just a handful of the cutting-edge blockchain tech topics on the agenda at CoinDesk\u0027s Consensus 2024 conference, which runs Wednesday, May 29, through Friday, May 31, in Austin, Texas.\n",
        "For blockchain developers, it\u0027s red meat. For others, it may sound unfamiliar. For everyone, including those somewhere in between, the three days are packed with opportunities to learn about the hottest crypto tech on Bitcoin, Ethereum, Solana, Cosmos and XRP Ledger – from the world\u0027s top experts.\n",
        "We took a spin through the agenda to identify stages and sessions likely to interest blockchain developers and people interested in the technology.\n",
        "In general there are six broad categories of relevant programming:\n",
        "The overall Consensus agenda is pretty sprawling. In terms of the blockchain tech highlights, the following would represent our picks.\n",
        "Wednesday:\n",
        "1:45 p.m. (Mainstage): Joe Lubin of Consensys discusses Ethereum with Consensus Chair Michael Casey.\n",
        "2:45 p.m. (Mainstage): Emin Gün Sirer, CEO, Ava Labs, the primary developer of Avalanche, joins a panel on what blockchain can do for AI, and what AI can do for crypto.\n",
        "3 p.m. (Town Square): Bryan Bishop, early Bitcoin coder (and now a Bitcoin Improvement Proposal editor), discusses the early days on a panel with other crypto OGs.\n",
        "Thursday:\n",
        "12:45 p.m. (Mainstage): David Marcus, former head of the Facebook/Meta Diem/Libra, talks about Lightspark, his digital-payments startup based on Bitcoin\u0027s Lightning Network.\n",
        "1:15 p.m. (Mainstage): Sergey Nazarov, co-founder of Chainlink, talks about his project\u0027s work with the global banking-payments network Swift, in a panel moderated by CoinDesk\u0027s Sam Kessler.\n",
        "4:15 p.m. (Town Square): John Adler, co-founder and chief research officer of Celestia Labs, and Austin Federa, head of strategy for Solana Foundation, discuss whether modular or monolithic blockchains are the better way to scale.\n",
        "Friday:\n",
        "10 a.m. (Money Reimagined Stage): MakerDAO co-founder Rune Christensen discusses where DeFi is headed.\n",
        "10:40 a.m. (Mainstage): Raj Gokal, co-founder and president of Solana Labs, discusses the network\u0027s future and the upcoming release of the Firedancer software designed to improve performance.\n",
        "11 a.m. (Money Reimagined Stage): Helium CEO Abhay Kumar speaks on a panel about the future of \"decentralized physical infrastructure networks,\" or DePIN (formerly referred to as Internet of Things, or IoT).\n",
        "11:30 a.m. (Mainstage): Casey Rodarmor, the developer who almost single-handedly created the two most impactful protocols launched atop Bitcoin in the past two years – Ordinals and Runes – talks about what comes next and his vision for the oldest and largest blockchain.\n",
        "11:45 a.m. (Money Reimagined Stage): CoinDesk\u0027s Margaux Nijkerk leads a discussion on liquid staking and restaking.\n",
        "12 p.m. (Town Square): AMA with Casey Rodarmor\n",
        "12:15 p.m. (Startup Village): Injective co-founder Eric Chen discusses his vision for the future of finance.\n",
        "3 p.m. (Money Reimagined Stage): Gauntlet co-founder Tarun Chitra speaks on a panel about \"de-risking DeFi,\" from preventing smart-contract bugs and rug pulls to dealing with treasury management strategies and audits.\n",
        "For blockchain developers and VC investors, this is probably where you\u0027ll end up spending a lot of time.\n",
        "Wednesday\n",
        "10:30 a.m. XRP Ledger\n",
        "11 a.m. Avalanche\n",
        "12:30 p.m. Chainlink\n",
        "1:30 p.m. Solana\n",
        "2:45 p.m. NEAR\n",
        "3:45 p.m. Stellar\n",
        "Thursday\n",
        "10:30 a.m. Ethereum/L2s half day.\n",
        "1:30 p.m. Bitcoin half day.\n",
        "Friday\n",
        "10 a.m. Panel session on appchain stacks.\n",
        "11:30 a.m. Panel session on zero-knowledge proofs.\n",
        "12:30 p.m. Coinbase security with Jeff Lunglhofer, CISO\n",
        "1 p.m. Sei\n",
        "1:30 p.m. Cosmos (on \"Bitcoinization)\n",
        "2 p.m. Microsoft\n",
        "Wednesday\n",
        "11:30 a.m. Alchemy Engineering Lead Rohan Thomare talks about \"building the next killer dapp\" and \"how to simplify Web3 user experience with account abstraction.\"\n",
        "1:30 p.m. Marcin Kazmierczak, co-founder of RedStone Oracles, gives a crash course on \"Pull vs. Push Oracle.\"\n",
        "3:30 p.m. Blockdaemon CEO and founder Konstantin Richter talks about how institutions can navigate the evolving landscape of restaking.\n",
        "4:30 p.m. Akash Network founder Greg Osuri explains how \"decentralization is saving AI.\"\n",
        "Friday\n",
        "1:30 p.m. Solana head of developer relations Jacob Creech explains \"how to build consumer apps on a blockchain.\"\n",
        "AI Summit - 10:10 a.m to 3:30 p.m. on Friday, Gen C Stage. A day of sessions devoted to the intersection of crypto and AI, with speakers including Tezos co-founder Arthur Breitman and Morpheus contributor Erik Vorhees.\n",
        "On Thursday and Friday, Startup Village is where the PitchFest semifinals and finals are taking place. The winner will be announced at 1:20 p.m. on Friday.\n",
        "On Wednesday and in between the PitchFest, there are sessions scheduled on crypto VCs; securing funding; how to win pitch competitions; Web3 and decentralized identities; and Web3 gaming.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-05-20T00:00:00"
  },
  {
    "id": 1735216770,
    "title": "Hex Trust Issues First Native Stablecoin on Layer-1 Blockchain Flare",
    "sourceUrl": "https://www.coindesk.com/business/2024/05/21/hex-trust-issues-first-native-stablecoin-on-layer-1-blockchain-flare/",
    "author": "Oliver Knight",
    "content": {
      "elements": [
        "Hong Kong-based crypto custodian Hex Trust Group has issued USDX, a new stablecoin on layer-1 blockchain Flare, according to a press release.\n",
        "USDX becomes the first native stablecoin on Flare as the blockchain gears up for a boost in decentralized finance (DeFi) activity. It will be available to use across lending protocols and exchanges and will also feature staking mechanism to a dedicated T-Pool, which is created by decentralized credit marketplace Clearpool.\n",
        "Those staking USDX will receive cUSDX in return, which can be used as collateral across DeFi protocols on Flare.\n",
        "Backing for the stablecoin is maintained at a 1:1 ratio against the U.S. dollar or equivalently valued assets, the press release added.\n",
        "\"The collaboration between USDX and Clearpool on Flare delivers a 1:1 backed stable asset with immediate access to real-world yield,\" Flare\u0027s co-founder Hugo Philion said. \"This will be particularly useful for FAsset agents, putting their stable collateral to work even while it\u0027s locked in the system.”\n",
        "Hex Trust’s CEO Alessio Quaglini added that the launch of USDX will \"reduce cryptocurrency market volatility\" and \"streamline transactions.\"\n",
        "Flare raised $35 million in a private round in February from the likes of Kenetic and Aves Lair. The blockchain currently has $8 million in total value locked (TVL), according to DefiLlama.\n",
        "Flare’s native token (FLR) rose by 2.4% in a two-hour period following the announcement.\n",
        "UPDATE (May 21, 11:52 UTC): Adds FLR price reaction.\n"
      ]
    },
    "publishedDate": "2024-05-21T00:00:00"
  },
  {
    "id": -1956797117,
    "title": "Ether Market Cap Adds Close to an Entire Solana Blockchain in a Single Day",
    "sourceUrl": "https://www.coindesk.com/markets/2024/05/22/ether-market-cap-adds-close-to-an-entire-solana-blockchain-in-a-single-day/",
    "author": "Omkar Godbole",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/8GWAGMkTFL4y1AWFvS6iipf_3cA\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/RQQPMSIGNVBGLORAW4OISA52OE.jpg",
          "description": ""
        },
        "The market capitalization of programmable blockchain Solana\u0027s sol (SOL) token could exceed that of rival Ethereum\u0027s ether (ETH) during the next bullish cycle, one crypto observer said in December.\n",
        "This week, the market has shown how Herculean the task would be: The ether price surged more than 19% on Monday, adding $70 billion to its market cap for a total of $439 billion, according to data source TradingView. That\u0027s a gain equivalent to almost 90% of SOL\u0027s market value in just one day.\n",
        "The surge followed renewed hopes that a spot ether exchange-traded fund (ETF) will be approved in the U.S. Analysts say the gap between ether and its rivals like SOL will widen in the coming months as a potential spot ETF launch open the token to mainstream institutional adoption. So far, only bitcoin has had that privilege.\n",
        "At press time, ether was the world\u0027s second-largest digital asset, boasting a market cap of $453 billion, exceeded only by bitcoin\u0027s (BTC) $1.38 trillion. Sol, meanwhile, ranked fifth with a market value of $82 billion.\n",
        "\"Near-term ETH outlook is incredibly bullish. Let\u0027s not overcomplicate it,\" Ilan Solot, co-head of digital assets at Marex Solutions, said in an email. \"The ETF announcement is a near black swan even to (most) investors, markets dramatically short-to-underweight ETH, much of ETH liquidity is locked in staking, and the macro backdrop is favourable,\"\n",
        "Since its inception in 2015, Ethereum has been the world\u0027s leading smart contract blockchain, powering over 4,000 decentralized applications. It\u0027s home to some of the most critical decentralized finance protocols like Uniswap, AAVE and tokenization initiatives like BlackRock\u0027s BUIDL. Moreover, Ethereum has never experienced a Solana-like outage.\n",
        "Still, there have been instances, particularly during bull runs, when traders shifted to Solana to bypass Ethereum\u0027s network congestion and higher transactions costs. For instance, Solana\u0027s share in global trading volume on decentralized exchanges rose early this year thanks to the meme coin frenzy. That spurred talks of SOL eventually overtaking ETH.\n",
        "If the ETH ETF speculation and recent price action is anything to go by, such talks appear premature.\n"
      ]
    },
    "publishedDate": "2024-05-22T00:00:00"
  },
  {
    "id": 820603227,
    "title": "‘Innovation Continues to Occur in Siloes’: DTCC Digital Head Nadine Chakar on Responsible Blockchain Building",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/05/23/innovation-continues-to-occur-in-siloes-dtcc-digital-head-nadine-chakar-on-responsible-blockchain-building/",
    "author": "Daniel Kuhn",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/1FgZVpUfNxPHrXpUnd-MaWKAu7k\u003d/975x558/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/EFC5MSVY7BB7FCSVMO44XCJ3DY.png",
          "description": ""
        },
        "Nadine Chakar is often called one the most powerful women in finance. As global head of the digital asset wing at DTCC, which settles an astronomical amount of transactions annually (in the quadrillions), she has a front row seat to how technology is reinventing finance before our very eyes. Which might be why she’s become such a staunch advocate for blockchain-based innovations.\n\nNadine Chakar is a speaker at this year’s Consensus festival, in Austin, Texas, May 29-31.\n",
        "“With tokenization, firms could be more capital-efficient, create new business models and more easily expand product offerings and distribution channels. Firms could unlock new efficiencies and uncover ways to streamline existing processes while finding new markets and ways of unlocking liquidity – and they can likely do it cheaper and faster,” Chakar wrote in a CoinDesk op-ed.\n",
        "Chakar, who has over 30 years of experience of global wealth and asset management experience, has essentially charted her own path through the world of finance. Before DTCC (which acquired her compliance-focused tokenization firm Securrency in 2023), Chakar served as an executive vice president at State Street, where she essentially built out the State Street Digital unit after a stint as executive vice president of the firm’s global markets division.\n",
        "“This blend of experience between the traditional and the startup worlds has helped me, as a leader, to better understand how to strike the right balance between agile and responsible innovation,” Chakar said in an interview.\n",
        "See also: What Consensus Speakers Are Looking Forward to This Year\n",
        "CoinDesk caught up with Chakar to discuss her career history, how she views digital transformation and what responsible regulation for crypto would look like.\n",
        "To what extent did your career at places like State Street Digital and BNY Mellon prepare you to lead the digital asset business at DTCC?\n",
        "I have a history of working at heavily-regulated financial institutions, which has given me expertise leading teams that can innovate in a responsible, transparent way that meets the highest regulatory standards. However, given my time as CEO of Securrency, I’ve witnessed the power of a fintech that can innovate quickly. This blend of experience between the traditional and the startup worlds has helped me, as a leader, to better understand how to strike the right balance between agile and responsible innovation.\n",
        "Now that Securrency has become DTCC Digital Assets, I believe we’re leveraging the best of both worlds. We combine DTCC’s legacy of trust and experience as the infrastructure for the world’s largest capital markets with Securrency best-in-class technology capabilities.\n",
        "Are you observing digital assets impacting traditional financial markets?\n",
        "I believe digital assets are largely operating in a different universe from traditional markets. However, I think we’re at a turning point where the two are starting to converge. A major challenge is that innovation continues to occur in siloes, where financial institutions will team up with a fintech [company] to launch a pilot, only to culminate with a press release and then fizzle out afterward.\n",
        "We’re calling for a change in approach: we should focus on large-scale pilots with many participants and have experiments build upon each other incrementally to begin building a larger, interoperable digital asset ecosystem that can power digital markets.\n",
        "It\u0027s often said that market structure for digital assets needs reform: Do you have ideas of what this should look like?\n",
        "We require an ecosystem for digital assets that’s worthy of the one we have for traditional assets today. First and foremost, we need infrastructure that can connect traditional systems with the digital ecosystem and that provides the same level of soundness and safety of existing offerings. Second, we must ensure we’re facilitating how assets and processes can move across multiple blockchains.\n",
        "Third, we must have a clear legal and regulatory framework to establish controls and standards. This is essential, and it should include standards for data, including its use and collection, methods to protect private data and establishing exactly what data is allowed on-chain.\n",
        "See also: A Crypto Developer\u0027s Guide to Consensus 2024\n",
        "Of course, DTCC has been bringing this sort of expertise to the markets for over 50 years. We have the established ecosystem for traditional securities, which will serve as the foundation for creating the digital infrastructure of the future. We are also here to help guide the evolution of the regulatory framework over time to support digital assets.\n",
        "We can’t do it alone. This is why we’ve partnered with other financial market infrastructures, Euroclear and Clearstream, to issue a new paper that lays out the path forward for developing this ecosystem in a measured and collaborative way. We’re excited to announce the paper at Consensus.\n",
        "What are you most looking forward to at Consensus?\n",
        "Networking and connecting with colleagues. It’s worth repeating: the path to creating the digital asset ecosystem starts with collaboration. While there will always be room for firms to compete with their own bright ideas and compelling use cases, we won’t make meaningful progress on tokenization without working together. I’m excited for the industry to collaborate to bring a robust, interoperable digital asset ecosystem to life.\n"
      ]
    },
    "publishedDate": "2024-05-23T00:00:00"
  },
  {
    "id": -1997637767,
    "title": "Farcaster, Blockchain-Based Social Media Startup, Raises $150M, Led by Paradigm",
    "sourceUrl": "https://www.coindesk.com/tech/2024/05/21/farcaster-blockchain-based-social-media-startup-raises-150m-led-by-paradigm/",
    "author": "Bradley Keoun",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/A9_Gc3Ia1Jw6T3Wto8UdzNJRM9g\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/DBIYQT5U7REHNK4GDPUDQO7PAA.jpg",
          "description": ""
        },
        "Farcaster, a blockchain-based social-media project, has secured $150 million in a fundraising round led by Paradigm, with participation from a16z, Haun, USV, Variant and Standard Crypto, according to a post by founder Dan Romero.\n",
        "\"This will support our work on Farcaster for many years to come,\" Romero wrote Tuesday in an update. He added that the project was hiring staff-level engineers.\n",
        "Farcaster is built atop the Ethereum blockchain as well as OP Mainnet in the Optimism layer-2 ecosystem, according to the project\u0027s documentation.\n",
        "The project went \"permissionless\" in October and has since seen \"350,000 paid sign-ups and a 50x increase in network activity,\" Romero wrote in Tuesday\u0027s post. \"There are hundreds of developers building on the protocol and a growing number of apps and frames for people to use.\"\n",
        "Ethereum co-founder Vitalik Buterin is signed up as a user of Farcaster\u0027s Warpcast app, and has made regular posts.\n",
        "Romero famously was the former college roommate at Duke University of Coinbase co-founder Fred Ehrsam.\n",
        "Farcaster turned heads with the Jan. 26 release of a new \"Frames\" feature, which allows apps to run within posts, so users don\u0027t have to click off to another site.\n"
      ]
    },
    "publishedDate": "2024-05-21T00:00:00"
  },
  {
    "id": 469413994,
    "title": "Crypto Sleuth Ogle Proposes Security-Centric \u0027Glue\u0027 Blockchain",
    "sourceUrl": "https://www.coindesk.com/business/2024/05/21/crypto-sleuth-ogle-proposes-security-centric-glue-blockchain/",
    "author": "Danny Nelson",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/Fa93XZvhgXBOGF6XlUvIfh4bYb4\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/SSFSG5DW4NETHMJGN6WAA5JWXY.jpg",
          "description": ""
        },
        "Pseudonymous crypto sleuth Ogle has witnessed plenty of failures while investigating DeFi hacks. He\u0027s part of a cottage industry of security experts who clean up the mess from attackers targeting crypto-finance projects almost daily. His specialty: tracking them down and getting the projects\u0027 money back.\n",
        "Stopping these heists depends on good smart contract code and savvy security. In an interview with CoinDesk, Ogle said it\u0027s also a game of incentives. If an attacker believes the personal cost of their exploit may be too high, they might decide against mounting it at all.\n",
        "That ethos is one of the pillars behind Ogle\u0027s upcoming blockchain, called Glue. It plans to fund a security blanket that raises the stakes for black hats and – hopefully – prompts them to take their heisting elsewhere.\n",
        "Glue has largely flown under the radar this year despite raising at a $1.4 billion valuation in a public token sale. It\u0027s another newcomer layer 1 blockchain at a time when oodles of competitors are vying for the attention of crypto traders and developers.\n",
        "Ogle\u0027s entrant doesn\u0027t have the name-brand appeal of buzzy platforms like Monad and Berachain, two other yet-to-launch blockchain platforms. Instead, it deployed guerilla marketing tactics (like handing out Spy-style manilla envelopes at industry conferences) to stoke intrigue.\n",
        "In interviews with CoinDesk Ogle and co-founder SnapShot outlined Glue\u0027s philosophy, security and design. They believe it can appeal to \"regular people who don\u0027t do crypto all day long\" as well as traditional financial professionals \"who can\u0027t come onto a platform where they think they\u0027re going to be rugged.\"\n",
        "\"We want to build something that actually has a chance of competing with the banks,\" said Glue co-founder Snapshot.\n",
        "Glue will be built around an activity \"hub\" that aggregates DeFi services for chain users. That level of curation makes Glue markedly different from the construction of most other blockchains. Usually, their users must find what they\u0027re looking for themselves.\n",
        "\"\u0027Centralization\u0027 is a dirty word in crypto for a good reason but from a UX perspective I think we can have a much more central interface,\" SnapShot said. Ogle said Glue Hub will make on-chain onboarding smooth – \"almost like Coinbase.\"\n",
        "The approach targets the 90% of crypto users who SnapShot said stick to centralized exchanges, rather than the \"one million – basically no one\" that he said operate on-chain.\n",
        "Glue Hub won\u0027t be the only place where users can trade. The chain is permissionless, meaning anyone can build and launch anything for anyone to use. These creations could be integrated with Glue Hub if they pass security checks like audits commissioned by Glue.\n",
        "Audits have emerged in crypto as a kind of marketing tool in their own right. Projects commission reports from chain-checking specialists who scour their smart contracts to squash money-losing bugs. These checks aren\u0027t definitive – plenty of audited projects still get exploited – but projects tout their clean bills of health as stamps of approval.\n",
        "That practice has gone too far, according to Ogle, who said he used to run an auditing firm. Many projects are only willing to be transparent about good-looking reports, and opt to bury the bad, he said.\n",
        "\"That\u0027s not good for security, for the cryptosphere itself,\" he said.\n",
        "In place of this Ogle said high-caliber projects on Glue could be subjected to audits funded by the chain via the Glue Security Fund. This fund will get its money from a tiny tax applied to every transaction, the founders said. It will pay for various efforts to promote security across the entire chain.\n",
        "Audits don\u0027t always work. Lending protocol Euler lost $200 million to a hack that slipped past 10 audits in two years. Ogle participated in Euler\u0027s recovery as part of the war room that tracked down the hacker and negotiated the return of that money. Ogle claims he has a 65% success rate in getting money back for the 40-odd exploited projects he\u0027s assisted.\n",
        "\"We have actual funds set aside for me and a group of people to go and chase down anyone who does bad things on\" Glue, Ogle said. He later added that any security service (be they vigilante detectives, auditors or analytics compliance tools) will be able to apply for grants from the GSF. Holders of Glue\u0027s token will determine what\u0027s funded, he said.\n",
        "The idea with GSF is to disincentivize hackers from trying to attack Glue projects in the first place. They won\u0027t be able to catch everybody, Ogle said. But if would-be hackers are comparison-shopping targets, they might think twice about hitting the mark that has a war chest ready to pay for chasing them down.\n",
        "Transactions on Glue will be multi-sig, meaning any attempt to move money from wallets will require multiple approvals from the user. Ogle said this default setup opens the door for third-party services to build tools that increase user security by, say, flagging any money movement that looks out of the ordinary.\n",
        "This could save people from losing money to otherwise innocent-looking wallet interactions.\n"
      ]
    },
    "publishedDate": "2024-05-21T00:00:00"
  },
  {
    "id": -951439914,
    "title": "Demystifying AI’s Black Box: Ariana Spring and Andrew Stanco on How Blockchain Tech Can Shine a Light on Hidden Inputs",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/05/23/demystifying-ais-black-box-ariana-spring-and-andrew-stanco-on-how-blockchain-tech-can-shine-a-light-on-hidden-inputs/",
    "author": "Jeff Wilser",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/96QRL7k38Mkw1213b5QYjYhPCHw\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/6ZD4ZOI4FJF5BKX4JPDJNC5EPE.jpg",
          "description": ""
        },
        "Part of the magic of Generative AI is that most people have no idea how it works. At a certain level, it’s even fair to say that no one is entirely sure how it works, as the inner-workings of ChatGPT can leave the brightest scientists stumped. It’s a black box. We’re not entirely sure how it’s trained, which data produces which outcomes, and what IP is being trampled in the process. This is both part of the magic and part of what’s terrifying.\n\nAriana Spring is a speaker at this year’s Consensus festival, in Austin, Texas, May 29-31.\n",
        "What if there was a way to peer inside the black box, allowing a clear visualization of how AI is governed and trained and produced? This is the goal — or one of the goals — of EQTY Lab, which conducts research and creates tools to make AI models more transparent and collaborative. EQTY Lab’s Lineage Explorer, for example, gives a real-time view of how the model is built.\n",
        "All of these tools are meant as a check against opacity and centralization. “If you don’t understand why an AI is making the decisions it\u0027s making or who\u0027s responsible, it\u0027s really hard to interrogate why harmful things are being spewed,” says Ariana Spring, Head of Research at EQTY Lab. “So I think centralization — and keeping those secrets in black boxes — is really dangerous.”\n",
        "Joined by her colleague Andrew Stanco (head of finance), Spring shares how crypto can create more transparent AI, how these tools are already being deployed in service of climate change science, and why these open-sourced models can be more inclusive and representative of humanity at large.\n",
        "Interview has been condensed and lightly edited for clarity.\n",
        "What’s the vision and goal of EQTY Lab?\n",
        "Ariana Spring: We\u0027re pioneering new solutions to build trust and innovation in AI. And generative AI is kind of the hot topic right now, and that\u0027s the most emergent property, so that\u0027s something that we\u0027re focused on.\n",
        "But also we look at all different kinds of AI and data management. And really trust and innovation are where we lean into. We do that by using advanced cryptography to make models more transparent, but also collaborative. We see transparency and collaboration as two sides of the same coin of creating smarter and safer AI.\n",
        {
          "url": "https://www.coindesk.com/resizer/D3SkpTa41k3rCG2sBgj83VTIzyM\u003d/560x560/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/F2MIU7A5DJG6XKY3M2RJE3KERM.jpeg",
          "description": ""
        },
        "Can you talk a little more about how crypto fits into this? Because you see many people saying that “Crypto and AI are a great fit,” but often the rationale stops at a very high level.\n",
        "Andrew Stanco: I think the intersection of AI and crypto is one that\u0027s an open question, right? One thing we’ve found is that the hidden secret about AI is that it’s collaborative; it has a multitude of stakeholders. No one data scientist could make an AI model. They can train it, they can fine-tune it, but cryptography becomes a way of doing something and then having a tamper-proof way of verifying that it happened.\n",
        "So, in a process as complex as AI training, having those tamper-proof and verifiable attestations — both during the training and afterwards — really helps. It creates trust and visibility.\n",
        "Ariana Spring: What we do is that at each step of the AI life cycle and training process, there’s a notarization — or a stamp — of what happened. This is the decentralized ID, or identifier, that’s associated with the agent or human or machine that’s taking that action. You have the timestamp. And with our Lineage Explorer, you can see that everything we do is registered automatically using cryptography.\n",
        "And then we use smart contracts in our governance products. So if X parameter is met or not met, a certain action can proceed or not proceed. One of the tools that we have is a Governance Studio, and that basically programs how you can train an AI or how you can manage your AI life-cycle, and that is then reflected downstream.\n",
        "Can you clarify a bit what type of tools you’re building? For example, are you building tools and doing research that’s meant to help other startups build training models, or are you building training models yourselves? In other words, what exactly is the role of EQTY Labs in this environment?\n",
        "Andrew Stanco: It’s a mix, in a way, because our focus is on the enterprise, since that’s going to be one of the first big places where you need to get AI correct from a training and governance standpoint. If you dig into that, then we need to have an area where a developer—or someone in that organization— can annotate the code and say, “Okay, this is what happened,” and then create a record. It’s enterprise-focused, with an emphasis on working with developers and the people building and deploying the models.\n",
        "Ariana Spring: And we’ve worked on training the model as well through the Endowment for Climate Intelligence. We helped train a model called ClimateGPT, which is a climate-specific large language model. That isn’t our bread and butter, but we’ve gone through the process and used our suite of technologies to visualize that process. So we understand what it’s like.\n",
        "What excites you the most about AI, and what terrifies you the most about AI?\n",
        "Andrew Stanco: I mean, for excitement, that first moment when you interact with generative AI felt like you uncorked the lightning in the model. The first time you create a prompt in MidJourney, or that you asked ChatGPT a question, no one had to convince you that maybe that it’s powerful. And I didn\u0027t think there were many new things anymore, right?\n",
        "And as for terror?\n",
        "Andrew Stanco: I think this is a concern that maybe is the subtext for a lot of what\u0027s going to be at Consensus, just from peeking at the agenda. The concern is that these tools are letting the existing winners dig deeper modes. That this is not necessarily a disruptive technology, but an entrenching one.\n",
        "And Ariana, your main AI excitement and terror?\n",
        "Ariana Spring: I’ll start with my fear because I was going to say something similar. I\u0027d say centralization. We’ve seen the harms of centralization when paired with a lack of transparency around how something works. We\u0027ve seen this over the past 10, 15 years with social media, for example. And if you don’t understand why an AI is making the decisions it\u0027s making or who\u0027s responsible, it\u0027s really hard to interrogate why harmful things are being spewed. So I think centralization — and keeping those secrets in black boxes — is really dangerous.\n",
        "How about excitement?\n",
        "What I\u0027m most excited about is bringing more folks in. We\u0027ve had the chance to work with several different kinds of stakeholder groups as we were training ClimateGPT, such as indigenous elder groups or low income, urban, Black and brown youth, or students in the Middle East. We’re working with all these climate activists and academics to kind of say, “Hey, do you want to help make this model better?”\n",
        "People are really excited, but maybe they didn\u0027t understand how it worked. Once we taught them how it worked and how they could help, you could see them say, “Oh, this is good.” They gain confidence. Then they want to contribute more. So I\u0027m really excited, especially through the work that we\u0027re doing at EQTY Research, to begin publishing some of those frameworks, so we don’t have to rely on systems that maybe aren’t that representative.\n",
        "Beautifully said. See you in Austin at Consensus’ AI Summit.\n"
      ]
    },
    "publishedDate": "2024-05-23T00:00:00"
  },
  {
    "id": 1228452237,
    "title": "Indian Crypto Exchange CoinDCX’s DeFi Arm Okto to Launch Blockchain and OKTO Token",
    "sourceUrl": "https://www.coindesk.com/policy/2024/05/14/indian-crypto-exchange-coindcxs-defi-arm-okto-to-launch-blockchain-and-okto-token/",
    "author": "Amitoj Singh",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/2ZAkHRq0v0V2RTIOwadx9iAWCdY\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/U56UERXZAJHK5BFDRXH6QUEJJA.jpeg",
          "description": ""
        },
        "Indian crypto exchange CoinDCX has expanded what started as the Okto wallet into an Okto ecosystem, which will include launching a blockchain, a token, and a points program starting Tuesday.\n",
        "The aim is to give global users a single-click mobile experience while traversing the Web3 space, its co-founders Neeraj Khandelwal and Sumit Gupta told CoinDesk in an interview.\n",
        "The objective of Okto’s points program is to bootstrap the launch of the Okto blockchain, which will happen later in 2024. That’s also when the launch of the OKTO token to power that chain will occur. The points program will reward users for their on-chain transactions, and those trading elsewhere can earn bonus points by moving assets to the Okto Wallet. As much as 7% of the OKTO token will be air-dropped to early users.\n",
        "CoinDCX launched Okto in August 2022 as a DeFi mobile app with an inbuilt wallet aimed at easing the transition of crypto consumers to DeFi. Since then, it has spent nearly two years testing ways to solve the problem of a broken user experience to engage the next billion Web3 users.\n",
        "“Self-custody wallet experience was completely broken and required users to go through several hurdles of the Web3 space like blockchain, self-custody, security and trust, signing transactions or gas fees,\" said Khandelwal. “Okto is the first such system which provides a Web 2-like single click mobile experience in the Web3.\"\n",
        "The idea of creating a native experience was made possible in phases by first, working on a solution internally to streamline the process of using DeFi\u0027s various elements.\n",
        "In phase two, the solution was packaged into a software development kit (SDK), which is a bundle of software development tools, and made available to external entities in a centralized scenario. This allowed developers to build applications without needing to understand the intricacies of each blockchain.\n",
        "“Post experiencing the challenges of building a full chain abstracted Okto wallet, in Phase 2, we introduced the Okto Web3 SDK, an industry-first embedded wallet enabling any app or internet company to fully harness the potential of Web3,\" Khandelwal said. ”We are now in the process of building an entire Okto Ecosystem.\"\n",
        "\"We believed all CeFi platforms would eventually have a DeFi arm,\" said Sumit Gupta, co-founder of CoinDCX. “The Okto Chain will power thousands of applications being built in the Web3 space.\"\n",
        "More than 20 apps are being built through the SDK, 50+ chains and protocols have been integrated, and over a million wallets have been created on what they call the \"Okto Orchestration Layer.”\n",
        "“We are not just targeting one partner or ecosystem but hope to land several partnerships to help us make this globally ubiquitous,” Khandelwal said without naming any specific entity.\n",
        "Read More: What’s at Stake for Crypto in India as the World’s Largest Democracy Is in the Midst of Its National Election?\n",
        "\n"
      ]
    },
    "publishedDate": "2024-05-14T00:00:00"
  },
  {
    "id": -2007905178,
    "title": "Irthu Suresh: Using Blockchain Tech to Reduce Water Shortages",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/05/14/irthu-suresh-using-blockchain-tech-to-reduce-water-shortages/",
    "author": "Jeff Wilser",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/FggBu6yPg9LBDan6taM7UAk1f88\u003d/975x975/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/H3MR4UDOL5DFJB2NBKPACG5P3M.jpeg",
          "description": ""
        },
        "Much of the world takes water for granted. And much of the world has so little water that it’s a matter of life and death.\n",
        "So how can we send water from areas of surplus to areas of need? This is the mission of Atlantis, a project devoted to solving issues stemming from climate change, focusing primarily on water. And they’re trying to crack this problem by using blockchain.\n\nIrthu Suresh is a speaker at this year’s Consensus festival in Austin, Texas, May 29-31.\n",
        "Atlantis is not just theoretical. Across 50 villages in the region of Chikmagalur, India, Atlantis deployed a Web3 solution that incentivized people to effectively transfer water from the Haves to the Have Nots. A clever system of “bounties” encouraged villagers to perform tasks that enabled this new distribution. And the pilot program worked. “We’ve exchanged more than 21,000 kiloliters of water,” says Irthu Suresh, CEO of Atlantis.\n",
        "Giving a sneak preview of what he’ll share in Austin at Consensus, Suresh explains why Atlantis adopted blockchain, the challenges they had to overcome for onboarding, and why he wants the world to know that Web3 is not just for trading but that “we can use this to fight water problems, to fight poverty.”\n",
        "Interview has been condensed and lightly edited for clarity.\n",
        "Atlantis didn’t start out as a blockchain organization, but eventually you incorporated the tech. What led you to this?\n",
        "Irthu Suresh: We were trying to build solutions for climate change — primarily through water — as a Web2 company, but a private entity trying to build for the commons was not really striking a chord. And we ran into all kinds of challenges with existing power structures, everything from regulations to unregulated mafia in India. It’s very easy to bring down an idea if it’s built by a private entity. All you need is a bunch of lawyers.\n",
        "And that led us to think, “How can me and my co-founder become insignificant over time as this system scales?\" And that led us to look at decentralized distributed systems. We figured that if this works, no one should be able to bring it down.\n",
        "Then we realized that there were people who were willing to harvest additional water and then supply it into the network. This was creating additional pools of surplus resources. And we were like, “What if we could build this entire system on blockchain?”\n",
        "So what does that look like exactly?\n",
        "In most parts of the world, things like water are heavily regulated. And you have these centralized grids. But as cities and spaces expand, often these centralized grids struggle to catch up.\n",
        "But India is a great example of being built, historically, on decentralized communities. You have small pockets of villages taking care of their needs. It\u0027s hyper-local. So for us, it was a no-brainer to bring some kind of concept that solves for resource allocation problems.\n",
        "There are some parts where water is abundant, and nobody cares about it. And there are other places where access to water is life and death. So for the pilot, when we partnered with Mercy Corps Ventures, we chose a specific location in India where on one side of this hill there’s an abundance of water, and on the other side of the hill there’s a drought. And how could people in this region exchange this excess water? How could we create the infrastructure locally itself? So for our pilot program in Chikmagalur — a rural region with 50 villages — we started with people in different water stress zone.\n",
        "Interesting. What did your system do?\n",
        "First we had people locally volunteer to spread awareness, then we had local people sign up to become water harvesters. Once we had these harvesters and there was a rain that was captured, there was an opportunity for it to be exchanged.\n",
        "How does blockchain fit into this?\n",
        "We built the product on a mobile native app. On this app, everybody could create a profile, sign up, and first mention what their skill is. And based on the skill, we start giving you tasks. And these tasks are pretty much to build up this peer-to-peer water network.\n",
        "You could take part in surveying, you could take part in water sample testing, you could sign up as someone who wants to spread awareness through workshops, or you could become a harvester. All of these tasks are gamified; we call them bounties. People sign up and then they do the required steps that are required, and then they get incentivized. We knew this first required a distributed ledger that is tamper-proof, and we knew that blockchain is useful for that.\n",
        "Amazing. Can you quantify the impact so far?\n",
        "Yeah. We’ve exchanged more than 21,000 kiloliters of water. The network has over 3,000 people and it\u0027s covering 50 villages. Out of the 3,000, predominantly most are consumers who are coming into the network to access water. But we have almost 150 harvesters in the network. And then we have a bunch of surveyors and validators.\n",
        "What’s a validator in this context?\n",
        "Let’s say you plug into the network and say, \"Hey, I\u0027m a harvester.\" Then we put out a bounty for someone in the locality to become a validator, who goes to your place and just validates that, \"Hey, these guys have the infrastructure for it.\" So what happens, in essence, is we’re creating a bunch of these local green jobs. And all of these different tasks are gamified using our bounty system.\n",
        "What problems did you run into?\n",
        "One was off-ramping. Especially in India, it\u0027s tough to off-ramp, because the regulations are still in a gray area.\n",
        "And then starting from the first MVP we designed, at the very onset of onboarding, whenever we asked people to connect to a wallet, that didn\u0027t work. Because people were like, \"What\u0027s a wallet?\" And I got an absolute schooling on UI and UX. We had to really figure out when is the right place to introduce blockchain or the Web3 terminologies.\n",
        "And we had to take extra steps to educate people about it. Because people are like, ”Oh, it\u0027s crypto. That means it\u0027s a scam.” And we’re like, “No, no, hold on!” Right? Like, there\u0027s so much more to it!\n",
        "What tokens are you using to drive the mechanics?\n",
        "We do have an internal token, which we\u0027ll someday launch. During the pilot we actively used it. But seeing how the Web3 market works, we are strong believers that unless we hit a strong product-market fit, launching a token doesn\u0027t make sense for us.\n",
        "So we’ve integrated a mechanism in which different tokens can be brought into the platform. If someone wants to fund a water project in Africa using Solana they can, whereas if somebody wants to do a water project in Vietnam using Optimism, they\u0027re able to do that. We really worked on the interoperability aspect of it because climate change does not care which chain you are on.\n",
        "Well said. Last question: What are you most looking forward to at Consensus?\n",
        "So, one of the biggest lifelines for our project has been Bitcoin. And I know that Consensus is a great place to go and meet people who have pioneered some of these technologies we are using today.\n",
        "I\u0027m hoping that we\u0027re able to come and talk about the things that we’ve been doing with blockchain, which is not necessarily just DeFi trading. We really want people to know that, “Hey, we can use this to fight water problems, to fight poverty.\" The idea of distributed ledgers is super powerful. More people need to know that there\u0027s actual examples of this being played out.\n",
        "Great sentiment. Congrats on what you’ve built and see you in Austin.\n"
      ]
    },
    "publishedDate": "2024-05-14T00:00:00"
  },
  {
    "id": -1758909434,
    "title": "\u0027Liquid Vesting\u0027 Is Oxymoronic Blockchain Feature That Lets Early Investors Sell Without Waiting",
    "sourceUrl": "https://www.coindesk.com/tech/2024/05/14/liquid-vesting-is-oxymoronic-blockchain-feature-that-lets-early-investors-sell-without-waiting/",
    "author": "Margaux Nijkerk",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/Z6x0Lr0SzQqSgYGxUS0uc8efwe0\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/KMLZCX4JHFGJ3CVFK3V2QNXRW4.jpeg",
          "description": ""
        },
        "Even in anything-goes crypto trading, there are conventions designed to protect the little guy. One of those is the vesting period – a window of time following a digital-token sale or airdrop where early investors, such as founders, project contributors and venture-capital backers, are locked up from dumping their allocations.\n",
        "Projects typically do this so that the price of that token doesn’t crash immediately after a listing, say if big stakeholders were to sell right away. Another goal is to make sure insiders and early backers keep skin in the game, an assurance of good faith, as it were.\n",
        "Now comes a new feature from Colony Lab, a developer and project incubator in the Avalanche blockchain ecosystem, called \"liquid vesting.\"\n",
        "If it sounds like a workaround, that\u0027s because it basically is. Have your bags and keep them too. Take liquidity now, without having to wait for the end of the vesting period.\n",
        "“Liquid vesting allows early investors to trade their tokens before they invest without impacting the projects, without impacts in the secondary market, \" said Wessal Erradi, co-founder of Colony Labs.\n",
        "The positive spin? “It also allows new buyers to establish long-term positions,” Erradi said.\n",
        "Colony announced the liquid vesting feature Tuesday in conjunction with the launch of its decentralized fundraising platform, which has the stated aim of \"democratizing access to seed sales investments in early-stage projects, previously limited to a select group, including VCs and high-net-worth individuals,” the team wrote in a press release.\n",
        "The rollout comes after Colony shared in November that it invested $10 million in the Avalanche blockchain ecosystem, by buying more than 500,000 AVAX tokens, which went towards a validators program for AVAX holders.\n",
        "Elie Le Rest, another co-founder, said there is some precedent for this in traditional markets, but \"in crypto, not that much.”\n",
        "“We had the infrastructure to be able to build something like this,” Le Rest said in an interview with CoinDesk.\n",
        "How does it work?\n",
        "According to Le Rest, \"we kind of tokenized again, the vesting contracts.\"\n",
        "\"So we issue a new token, one-to-one, that matches the ones that are locked, and then we distribute that to the users,\" Le Rest said. \"And then they can basically trade that on our decentralized exchange that we built.\"\n",
        "As often is the case in crypto, the solution to a token problem is another token.\n",
        "Read more: AVAX Ecosystem to Get $10M Boost from Avalanche Accelerator Colony Lab\n"
      ]
    },
    "publishedDate": "2024-05-14T00:00:00"
  },
  {
    "id": -1519172543,
    "title": "Paradigm Unveils \u0027Block Trading\u0027 Facility for MATIC, SOL, XRP Options",
    "sourceUrl": "https://www.coindesk.com/markets/2024/05/14/paradigm-unveils-block-trading-facility-for-matic-sol-xrp-options/",
    "author": "Omkar Godbole",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/UY0cvwEYTwEg2Ndw97wcnNAnRcw\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/BNVAFKAL7RFKNNYLGTAVSBOCOY.jpg",
          "description": ""
        },
        "Crypto over-the-counter liquidity network Paradigm announced on Monday a block trading facility on leading derivatives exchange Deribit for options tied to prominent alternative cryptocurrencies (altcoins), MATIC, SOL, and XRP.\n",
        "“Clients can now execute block trades in Polygon (MATIC), Solana (SOL), and Ripple (XRP),” Paradigm said on X, adding that the linear options will offer payouts that \"directly correlate with the price movements of the underlying asset.”\n",
        "Options are derivative contracts that give the buyer the right, but not the obligation, to buy or sell the underlying asset by a specific date (expiration date) at a predetermined price. A call option gives the right to buy, and a put option offers the right to sell.\n",
        "Block trades are privately negotiated futures, options, or combination trades exceeding certain volume thresholds. Participants typically use communication technologies like Paradigm to request quotes bilaterally and agree on the price, following which the trade is submitted to an exchange, in this case, Deribit, for execution and clearing.\n",
        "Block trades reduce slippage or costs associated with executing transactions and ensure a minimal impact on the going market price.\n",
        "Since its inception in 2016, Paradigm’s OTC network has been a preferred venue for institutional investors to take block trades. The platform has registered nearly $400 billion in volume to date and, as of May, accounts for 17% of the cumulative bitcoin and ether options activity on Deribit.\n",
        "Paradigm’s new offering has already found takers. On Monday, the platform announced the successful completion of an inaugural trade involving 500,000 units of MATIC call spreads between Singapore-based QCP Capital and Galaxy Digital.\n",
        "The trade involved MATIC call options at strikes 80 cents and 95 cents, expiring on May 31. Paradigm facilitated the trade, which was printed on Deribit. MATIC is the native cryptocurrency of the Polygon Network, used for staking and to pay gas fees.\n",
        "\"We are thrilled to see Paradigm expand its block trading services to include linear altcoin options, starting with the pioneering transaction in MATIC options on our platform. This expansion not only broadens our mutual offering but also sets the stage for upcoming inaugural blocks in SOL and XRP,\" Luuk Strijers, chief executive officer at Deribit, said.\n"
      ]
    },
    "publishedDate": "2024-05-14T00:00:00"
  },
  {
    "id": 1314306636,
    "title": "It\u0027s Not a Token Offering, It\u0027s a \u0027Node Sale\u0027: Sophon Blockchain Raises $60M",
    "sourceUrl": "https://www.coindesk.com/tech/2024/05/08/its-not-a-token-offering-its-a-node-sale-sophon-blockchain-raises-60m/",
    "author": "Bradley Keoun",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/iM4ns0KVdEb-1MEdbidJXcpaRfQ\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/Y4QOXRPXZBFGTKLNKNBODI7BFU.jpg",
          "description": ""
        },
        "It\u0027s the blockchain industry\u0027s latest innovation – not in technology, but in rounding up cash from investors.\n",
        "Sophon, an entertainment-focused blockchain ecosystem, has attracted more than $60 million in a node sale – a novel form of project fundraising that is catching on in crypto circles as token sales come under greater scrutiny from securities regulators.\n",
        "The Sophon project, built as a rollup network atop the Ethereum blockchain using technology from the zkSync project, sold about 121,000 network nodes, netting some 20,391 ETH ($62.7 million), according to a data dashboard on the blockchain-analytics website Dune. A total of 200,000 nodes were offered in the sale.\n",
        "Many of the nodes were likely purchased by venture capital firms, a person with knowledge of the matter told CoinDesk.\n",
        "Technically, buyers purchased Ethereum-based ERC-721 tokens, or NFTs, allowing them to operate nodes. That in turn qualifies them to collectively earn 20% of the project\u0027s eventually-to-be-released SOPH tokens over the first 36 months after the network\u0027s main launch, expected in the third quarter of this year.\n",
        "Underscoring the explicitly financial aspects of running a node on Sophon, project officials acknowledged in the press release that the network doesn\u0027t even need the full 200,000 nodes. Users don\u0027t have to actively operate the nodes themselves.\n",
        "\"They can simply delegate and reap the rewards for it,\" according to the press release. \"Furthermore, the node licenses that are unsold and unused when the sale ends won\u0027t come into circulation and will be burned.\"\n",
        "Sophon previously had raised $10 million in a traditional funding round led by the investors Paper Ventures and Maven 11, with participation from Spartan, SevenX and OKX Ventures.\n",
        "The fundraising track record looks especially impressive given that the project\u0027s principals aren\u0027t publicly named. According to a press release, the project is co-founded by \"several well-known semi-anonymous builders, including Sebastien (\u0027Seb\u0027), previously head of DeFi at zkSync; as well as Pentoshi, the legendary Crypto Twitter persona and trader and team member at Merit Circle.\"\n",
        "In a May 3 post on X, Seb wrote that it had come to his attention that \"a lot of folks were weary of the node sale and questioning the technical legitimacy of what we were doing, and thus of the overall project.\"\n",
        "\"We will use this money to build cool shit, innovate, fund projects and make strategic partnerships – always with the goal of delivering value to our core community,\" Seb wrote. \"As a crypto-native user myself, I know exactly what it means to risk funds on a new project and the value of transparency from the founder.\"\n",
        "Data services will come from plugging into another blockchain project, Celestia, according to an investor slide deck for the project.\n",
        "Node sales, still a relatively new phenomenon in fast-moving crypto, are becoming more common, many of them with help from the DeFi protocol Impossible Finance, which itself raised $7 million from institutional and angel investors in a 2021 seed funding round.\n",
        "Amounts raised from these node sales aren\u0027t tiny: Aethir, a decentralized GPU cloud infrastructure provider, disclosed last week that it had distributed more than 73,000 node licenses valued at over 41,000 ETH ($126 million). Other blockchain projects raising funds via node sales include CARV, XAI Games and Powerloom.\n",
        "The marketing pitch is that the node sales help to decentralize the fledgling networks right off the bat, while still giving investors the ability to earn token rewards on top of their nodes – a form of yield.\n",
        "The goal is to \"decentralize network participation, educate more users in their community about their tech, involve more participants than equity and involve retail users at larger skin-in-the-games than public,\" said Calvin Chu, a former Binance researcher who helped start Impossible Finance. Chu goes by the title of \"Core BUIDLer,\" he said.\n",
        "Certain mechanics of node sales appear designed to drive the fear of missing out, such as a system of tiering, where the price goes higher as more nodes are sold, and the use of exclusive whitelists that reserve early spots for certain users.\n",
        "In Sophon\u0027s deal, for example, a Tier 1 node license cost 0.0813 ETH, roughly tripling to 0.2524 by Tier 11. And according to the Dune Dashboard, about three-fourths of nodes were sold to whitelisted buyers.\n",
        "There\u0027s also the teaser that node operators may qualify for future token airdrops from related projects. Crypto traders have speculated that zkSync, one of the biggest Ethereum layer-2 networks, might at some point announce plans for a new token.\n",
        "\"I cannot comment on \u0027wen zks token,\u0027\" Sophon\u0027s Seb wrote in the May 3 tweet.\n",
        "Buyers of the Sophon nodes are subject to a 12-month restriction on transferring them, a stipulation designed to keep participants from simply cashing out and moving on, as sometimes happens after big token distributions.\n",
        "Often, however, venture capital firms that receive token allocations are locked up from selling them anyway. So the opportunity cost of owning a node may not look like too much of an additional burden – especially if the investments are accruing awards in the meantime.\n",
        "\"Buyers hope to get high quality projects,\" Impossible Finance\u0027s Chu said in an interview with CoinDesk over Telegram. \"This doesn\u0027t work well with low quality projects, because there is a lockup effectively. Because the nodes don\u0027t give instant tokens.\"\n"
      ]
    },
    "publishedDate": "2024-05-08T00:00:00"
  },
  {
    "id": 761806150,
    "title": "Australian Court Hands Win to Market Regulator in Case Against Qoin Blockchain, But There is a Catch",
    "sourceUrl": "https://www.coindesk.com/policy/2024/05/06/australian-court-hands-win-to-market-regulator-in-case-against-qoin-blockchain-but-there-is-a-catch/",
    "author": "Amitoj Singh",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/2XiIuGfeikTior86U-YwCsJCJVI\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/PPS33DLRVZFQNPMQVQVYZM4L7M.jpg",
          "description": ""
        },
        "An Australian Federal Court mostly ruled in favor of Australia’s markets regulator in its case against BPS Financial Pty Ltd (BPS) over its Qoin scheme, on Friday, court documents and the regulator’s announcement show.\n",
        "Judge J Downes ruled that the Australian Securities and Investments Commission (ASIC) “succeeded on its Unlicensed Conduct Case, other than in relation to the period during which BPS was an authorized representative of PNI Financial Services Pty Ltd,” who hold a non-cash payments license. That period was 10 months long, ASIC said.\n",
        "In 2022, ASIC sued BPS, asking the court to rule that the entire Qoin project, the token, blockchain, and wallet, was a financial product that required a license.\n",
        "In Australia, ASIC has seen both victories and losses as it ramps up regulatory oversight through legal processes.\n",
        "Part of this case was ASIC\u0027s allegation that the Qoin Blockchain and the Qoin Wallets constituted one single scheme, but the court disagreed.\n",
        "\"Contrary to ASIC’s submissions, the Qoin Blockchain, a means of acquiring Qoin and a means whereby business operators who hold Qoin Wallets can register as Qoin Merchants are not components of, and are not themselves, the mechanism which allows the user to make the non-cash payment,\" the order said.\n",
        "Read More: Australian Court Dismisses Lawsuit by Market Regulator Against Finder in \u0027Landmark\u0027 Ruling for Crypto Industry\n",
        "Experts said the court made an important rejection of ASIC’s attempts to have an entire blockchain found to be part of a \"financial product\" under Australian law.\n",
        "“This is an important judicial recognition of blockchains as foundational technology where the use of the technology if it breaches the law, can (and should) be prosecuted, but the technology itself stands separate,\" said Blockchain Australia Chair and Digital Assets Lawyer Michael Bacina.\n",
        "The order asked ASIC and BPS to confer and agree on a form of an order that would resolve the remaining questions, including penalties for later this month.\n",
        "Read More: Australian Court Dismisses Lawsuit by Market Regulator Against Finder in \u0027Landmark\u0027 Ruling for Crypto Industry\n",
        "\n",
        "\n",
        "\n"
      ]
    },
    "publishedDate": "2024-05-06T00:00:00"
  },
  {
    "id": -1258685582,
    "title": "Exiled Russian Opposition Leader Launches Blockchain-Based Referendum on Vladimir Putin’s Election Win",
    "sourceUrl": "https://www.coindesk.com/policy/2024/05/10/exiled-russian-opposition-leader-launches-blockchain-based-referendum-on-vladimir-putins-election-win/",
    "author": "Amitoj Singh",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/m9VFSxYOukIpwpanyt59fqPoWxg\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/LUFPBMBULZGDJNSFJJMUP4HF6Y.jpg",
          "description": ""
        },
        "Vladimir Putin just won his fifth term as Russian president, though the 87% landslide election victory has been labeled preordained, stage-managed and a farce.\n",
        "Now, exiled opposition leader Mark Feygin is leading an effort to give Russians an anonymous, blockchain-powered way to register a \"protest vote\" against Putin.\n",
        "The results of this effort would, of course, have no legal weight in Russia and would not end Putin\u0027s presidency per se, but the referendum could, in theory, give a public relations boost to efforts to oust him. And it gives Russians a way to voice criticism in a nation where the consequences of dissent can be high; opposition leader Alexei Navalny recently died while jailed in an Arctic penal colony.\n",
        "The vote will be conducted on an app called Russia2024, built using Rarimo’s Freedom Tool, which will use the Arbitrum blockchain and zero-knowledge cryptography, making voters\u0027 identities untraceable.\n",
        "“Dissent in Russia is growing more risky and public opinion harder to track,” Feygin said in a statement. He was exiled from Russia years ago, termed a foreign agent in 2022 and remains a wanted person in Russia. He is a former lawyer for the founders of the protest collective Pussy Riot. “It is critical that we provide reliable, surveillance-proof avenues for protest and polling. Russia2024 and its underlying technology has enabled that,” he added.\n",
        "Only holders of Russian passports will be able to cast their vote. Around 34.6 million Russians have a valid passport.\n",
        "Users will need to download the Russia2024 app and prove their citizenship by scanning their passports with their phones. The passports have a biometric chip that the tool uses to confirm the voter\u0027s identity and facilitate an anonymous vote. If a person doesn’t own a smartphone, a single phone can be used as a shared voting machine.\n",
        "Voting will be allowed for about two weeks, and the backers behind the tool are “sure” it is a secure way to vote and that voters don\u0027t need to fear repercussions.\n",
        "“Even after Navalny’s death, people came out and protested so they will vote as a countermeasure to the result,” said Freedom Tool co-founder Lasha Antadze, who has previously collaborated with the Ukrainian government to digitize the privatization of state properties. “Decentralized voting and the Freedom Tool is designed such that there is no single entity to attack, block or get rid of. You can’t hack it just like you can’t hack bitcoin.”\n",
        "Antadze also holds passports from Ukraine and Georgia. Putin’s victory is expected to give him the means to continue his war against Ukraine.\n",
        "“We are handing out the open-source technology to everyone. It’s not only Ukrainians or Georgians building,” Antadze said when asked about the possible perception that this is backed by Ukrainian interests. “We got a lot of contributions through anonymous letters from cryptography professors within Russia. It’s a kind of wartime defense technology.”\n",
        "Antadze, who spoke to CoinDesk from London, said the Russia2024 app was removed from the Apple app store initially, but they expect it to be back online this Friday. The app is available on Google\u0027s app store.\n",
        "Referendums have been used for different reasons across the world: for signaling dissent in Canada, to pass specific policy in Switzerland and to choose whether a region wants to stay united with a nation or not in the U.K.\n",
        "The main global “real world use case” is that it “can guarantee that authenticity,” it can “cut the cost” of any election-related voting exercise by “10 times” and the technology can be used by other nations, too, Antadze said.\n"
      ]
    },
    "publishedDate": "2024-05-10T00:00:00"
  },
  {
    "id": -976001514,
    "title": "Telegram-Based Notcoin Debuts at $1B FDV on Ton Blockchain",
    "sourceUrl": "https://www.coindesk.com/business/2024/05/16/telegram-based-notcoin-debuts-at-1b-fdv-on-ton-blockchain/",
    "author": "Oliver Knight",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/HBG-luYq3g65GuyGnOeqpqG15Qw\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/CJNHQBCWKVEODBKJF6DOVZIKRE.jpg",
          "description": ""
        },
        "Notcoin (NOT), a gaming token with more than 35 million users, has begun trading at a fully diluted value (FDV) of $1 billion after being distributed via an airdrop and on several exchanges.\n",
        "The token racked up $294 million in trading volume within the first hour of trading, according to CoinMarketCap.\n",
        "Early adopters of the game, which can be accessed via the Telegram app, accumulated notcoin from January to April by clicking on a virtual coin and completing challenges within the game. In-game balances have been converted on a 1000:1 ratio, according to a press release.\n",
        "Notcoin\u0027s maximum supply is 102 billion, with 3% allocated to Binance Launchpool users and a further 1.5% set aside for OKX Jumpstart users.\n",
        "The project has also introduced a staking mechanism to incentivize airdrop farmers to hold their tokens. Staking will be required to \"earn extra rewards\" and gain access to more lucrative staking pools based on the player’s level in the game.\n",
        "“It’s been an amazing few months,” said Sasha Plotvinov, founder of notcoin developers Open Builders. “We’re extremely proud that Notcoin’s viral growth has introduced millions to crypto and TON’s ecosystem.\"\n"
      ]
    },
    "publishedDate": "2024-05-16T00:00:00"
  },
  {
    "id": 563480233,
    "title": "Ahead of EU Elections, Crypto Industry Pushes Blockchain Merits as Policy Focus Shifts to AI",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/30/ahead-of-eu-elections-crypto-industry-pushes-blockchain-merits-as-policy-focus-shifts-to-ai/",
    "author": "Sandali Handagama",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/_8MHQP7cve1Y83sMzvn9M6JMt3I\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/V4MMOD5Y4NEMDH7AJLPVLNKMUU.jpg",
          "description": ""
        },
        "The European Union’s more than 370 million eligible voters are set to elect 720 parliamentarians this June – and while tech policy focus has shifted to artificial intelligence (AI), blockchain industry bodies are vying to prove the technology is vital to the bloc’s digitization efforts.\n",
        "The EU has already established the world’s first comprehensive crypto rules alongside strict anti-money laundering measures for the sector. But with revisions to the landmark Markets in Crypto Assets (MiCA) regulation likely in the works and the legislation\u0027s two key architects’ political futures up in the air, Europe’s crypto industry is bracing itself for change.\n",
        "Change could mean a number of things, including the industry potentially losing the handful of lawmakers who really know crypto or a slackening of new policymaking. More challenging still is getting ahead of shaping the sector’s new role in a discourse centered on artificial intelligence (AI) – something the EU has already started legislating.\n",
        "Earlier this year, four leading EU industry groups joined forces to pen a manifesto pledging to promote the use of blockchain tech in the bloc to avoid falling behind “in the global race” towards a digital economy.\n",
        "The groups say the timing for the manifesto is “crucial considering the upcoming elections and political changes Europe will undergo” this year and makes a case for continuing work on blockchain.\n",
        "“While we recognize the intrinsic value of technologies like artificial intelligence, virtual reality and robotics, we believe that blockchain will serve as the trust layer for the convergence of all these technologies, allowing them to build upon each other and form the framework of the future digital economy,” the manifesto said.\n",
        "The associations’ hope is that a new and hopefully younger parliament will be easier to approach than the last – at least where digitization is concerned.\n",
        "For crypto and blockchain policy in particular, political parties may matter less than lawmakers’ age, according to Robert Kopitsch, secretary general of Blockchain for Europe, one of the four industry associations that collaborated on the manifesto.\n",
        "“If you have a wallet full of crypto, you\u0027re much more open to the idea that this will be part of the future economy, right? Because you have it, you know how it works, you understand it,” Kopitsch said during an interview with CoinDesk.\n",
        "Marina Markezic, co-founder of the European Crypto Initiative (EUCI), which also collaborated on the manifesto, says younger politicians are likely to be more tech-savvy as well.\n",
        "“So it would be, like, kind of also easier to explain, to talk to them” about blockchain technology, Markezic said.\n",
        "But first, things overall might potentially slow down, according to Benedikt Faupel at German digital industry association Bitkom, “just because we don\u0027t know how the elections play out.”\n",
        "Crypto policy in the European Parliament (EP) didn’t have a lot of support to begin with and was spearheaded by “mostly three or four people,” Markezic said.\n",
        "Kopitsch and Markezic agree that Greek politician and former EP Vice President Eva Kaili was crypto’s driving force in government. Kaili’s dismissal from Parliament over a high-profile corruption scandal was seen as a blow to policy efforts, but thanks to German lawmaker Stefan Berger, MiCA made it through to the end of the line.\n",
        "Berger, who was the rapporteur for the package and in charge of handling the framework through negotiations, helped stamp an effort by the EP’s Green politicians to limit the use of the energy-intensive proof-of-work consensus mechanism that would have effectively banned Bitcoin in the union.\n",
        "“He did so much,” said Markezic, referring to Berger’s work on MiCA.\n",
        "Berger is currently rapporteur for the EU’s legislative proposals for a digital euro but is also up for re-election this June. According to Jonas Gross, head of the Digital Euro Association, the outcomes of an election of this scale are tough to predict, and it’s “infeasible to discuss specific officials who might not be back this year.”\n",
        "“We do see that the European Parliament is currently – under the guidance of Stefan Berger – following a very innovative and open-minded approach when it comes to crypto assets, stablecoins and the digital euro,” Gross added. “It would be desirable to get a Parliament in place that has a similar innovative focus to bring these digital money-related topics further forward so that it benefits the EU.”\n",
        "Another architect of MiCA whose future is up in the air is Mairead McGuinness, who serves as the commissioner for financial stability. MiCA was proposed by the European Commission under McGuinness’ purview. She has said she won’t be contesting in the 2024 parliamentary elections but is open to staying on another term as Commissioner – though that decision ultimately rests with the EU\u0027s overarching government.\n",
        "With MiCA mostly out of the way, another key framework for some crypto watchers is the EU’s push for a central bank digital currency, which is stoking controversy – and even conspiracy theories – with some politicians raising concerns that a digital euro could give the EU governments too much power and access to private information.\n",
        "According to Anne-Sophie Gógl, executive board member of the Digital Euro Association, some right-wing political parties are using plans for a digital euro to “create a mood against the European Union.”\n",
        "“They are using words such as control and surveillance. They also accuse the digital euro of excluding marginalized groups,” Gógl said in a written statement. “We fear that this trend will also have an impact in Europe after the elections: a larger proportion of right-wing populist representatives in the EP and therefore the risk that the topic of the digital euro will be misused for misinformation.”\n",
        "Polls are projecting rising support for the far right, but likely not enough to tip the scales in favor of anti-EU sentiment this election.\n",
        "If these parties do snag a nice chunk of new seats though, it could “massively slow down the policymaking process” for a digital euro, Gógl said.\n",
        "The EU’s tech policy priorities have shifted away from crypto to focus on AI, and the crypto industry is pushing for the application of blockchain technology in conjunction with AI, according to Anja Blaj, policy expert at EUCI.\n",
        "“What we are arguing most of the time is that AI alone raises a lot of fears as well, and how those fears can be quite often addressed is through blockchain technology,” Blaj said, referring to arguments that blockchain could be used to help preserve the integrity of data fed to AI systems and decentralize them.\n",
        "This won’t be the first time industry bodies pushed for the acceptance of blockchain technology over the adoption of speculative assets. During the last bear market, which saw several crypto giants fall, the industry quickly pivoted to promoting blockchain applications in traditional finance and other areas at events such as the World Economic Forum.\n",
        "“What people are actually moving away from is the financial connotation of the blockchain industry. So quite often, we actually push for the narrative of focusing on the ReFi of regenerative finance… supply chains or how, for example, data can be handled,” Blaj said during an interview with CoinDesk.\n",
        "Regenerative Finance (ReFi) sees cryptocurrency projects investing in sustainability in an effort to fix some of the problems markets create.\n",
        "Setting up blockchain as something vital to the digitization of Europe may prove critical to the industry’s survival in the region.\n",
        "When the current government was formed, “there was a lot of hype around blockchain,” and Europe was the first to get moving on policy and initiatives, Markezic said.\n",
        "“Now it is more on AI and… why would you use your political power in order to talk about something that might not be that present anymore?” Markezic said of the risk of fading political interest in blockchain.\n",
        "The elections will take place from June 6 to 9.\n"
      ]
    },
    "publishedDate": "2024-04-30T00:00:00"
  },
  {
    "id": -706298985,
    "title": "U.S. Blocks China-Tied Crypto Miners as \u0027National Security Risk\u0027 Near Nuke Base",
    "sourceUrl": "https://www.coindesk.com/policy/2024/05/13/us-blocks-china-tied-crypto-miners-as-national-security-risk-near-nuke-base/",
    "author": "Jesse Hamilton",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/ry6I_G-lAheOIrKhrHkYkz5zJgI\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/22YHMRLBZVFOHIR5GG6P6Q6EQM.jpg",
          "description": ""
        },
        "President Joe Biden ordered a cryptocurrency mining facility near Warren Air Force Base in Wyoming to halt operations on Monday, calling it a threat to national security.\n",
        "The White House order said the British Virgin Islands company behind MineOne, which is majority owned by Chinese nationals, must remove all the improvements and mining equipment on the property located within a mile of the military facility in Cheyenne – a base that houses Minuteman III nuclear missiles.\n",
        "The company, which bought the property in 2022, was accused of acquiring the land and starting work there without filing with the Committee on Foreign Investment in the United States (CFIUS), and a tip started an investigation into that acquisition, according to the White House.\n",
        "The order, which also authorized the U.S. attorney general to \"take any steps necessary\" to enforce it, cited the \"presence of specialized equipment on the property used to conduct cryptocurrency mining operations, some of which is foreign-sourced and presents significant national security concerns,\" according to a related statement from the Department of the Treasury.\n",
        "The move \"highlights the critical gatekeeper role that CFIUS serves to ensure that foreign investment does not undermine our national security, particularly as it relates to transactions that present risk to sensitive U.S. military installations as well as those involving specialized equipment and technologies,” Secretary of the Treasury Janet Yellen said in a statement.\n",
        "MineOne didn\u0027t immediately respond to a request for comment sent through the company\u0027s website.\n",
        "Read More: Crypto Miner MineOne Raises Over $20M in First Funding Round\n"
      ]
    },
    "publishedDate": "2024-05-13T00:00:00"
  },
  {
    "id": 39230577,
    "title": "Blockchain Sleuth Elliptic Explores AI and Anti-Money Laundering Using 200M Bitcoin Transactions",
    "sourceUrl": "https://www.coindesk.com/tech/2024/05/01/blockchain-sleuth-elliptic-explores-ai-and-anti-money-laundering-using-200m-bitcoin-transactions/",
    "author": "Ian Allison",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/-ND8I88Z-IGX00WqexCdGP5hq_I\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/ZT5Z4HXV2RFZ3C52XF2TBH5NFY.jpg",
          "description": ""
        },
        "Blockchain analytics firm Elliptic said it detected potential money laundering patterns on the Bitcoin blockchain after training an artificial intelligence (AI) model using a record 200 million transactions.\n",
        "The work is an extension of a program carried out back in 2019 that used a dataset of only 200,000 transactions. The much larger \"Elliptic2\" dataset made use of 122,000 labeled \"subgraphs,\" groups of connected nodes and chains of transactions known to have links to illicit activity.\n",
        "AI becomes more insightful the larger the dataset available to train the machine-learning algorithms, and cryptocurrencies like bitcoin offer a plentiful supply of transparent transaction data on the blockchain. Elliptic used the transactions for learning the set of \"shapes\" that money laundering exhibits in cryptocurrency and accurately classifying new criminal activity, Elliptic said in a paper co-authored with researchers from the MIT-IBM Watson AI Lab.\n",
        "\"The money laundering techniques identified by the model have been identified because they are prevalent in bitcoin,\" Elliptic co-founder Tom Robinson said in an email. \"Crypto laundering practices will evolve over time as they cease being effective, but an advantage of an AI/deep learning approach is that new money laundering patterns are identified automatically as they emerge.\"\n",
        "Many of the suspicious subgraphs were found to contain what are known as \"peeling chains,\" where a user sends or \"peels\" cryptocurrency to a destination address, while the remainder is sent to another address under the user\u0027s control. This happens repeatedly to form a peeling chain.\n",
        "\"In traditional finance this is known as \u0027smurfing,\u0027 where large amounts of cash are structured into multiple small transactions, to keep them under regulatory reporting limits and avoid detection,\" Elliptic said in the paper.\n",
        "Another commonly occurring technique was the use of so-called \"nested services,\" businesses that move funds through accounts at larger cryptocurrency exchanges, sometimes without the awareness or approval of the exchange. A nested service might receive a deposit from one of their customers into a cryptocurrency address, and then forward the funds to their deposit address at an exchange.\n",
        "\"Nested services are known to frequently have less stringent customer due diligence checks than the cryptocurrency exchanges they utilize, or sometimes have no such anti-money laundering checks at all, resulting in their misuse for cryptocurrency laundering - potentially causing them to feature in subgraphs deemed by the model as suspicious,\" said Elliptic.\n"
      ]
    },
    "publishedDate": "2024-05-01T00:00:00"
  },
  {
    "id": -1503594442,
    "title": "Tokenization Growth Depends on Developing Blockchain-Powered Secondary Markets: Moody\u0027s",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/18/tokenization-growth-depends-on-developing-blockchain-powered-secondary-markets-moodys/",
    "author": "Sandali Handagama",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/UGfJLomPKM9act0eq45bHwMDD1E\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/IPHRLGSNFBENFP7A27OCS2POGE",
          "description": ""
        },
        "Blockchain-powered secondary markets can help expand the reach of tokenized assets, analysts at Moody\u0027s Investors Service said in a report published Thursday.\n",
        "Tokenization is the representation of real-world assets on a blockchain, and financial institutions worldwide are exploring how it can improve the efficiency, cost and reach of financial markets. For example, tokenization allows large assets such as private equity or real estate to be broken down and represented by multiple tokens, opening the market to a wider range of investors, a previous report from the ratings company said.\n",
        "While financial institutions and governments have started dabbling in the issuance of tokenized assets – such as Hong Kong\u0027s $100 million green bond last year – there is a lack of secondary markets where they can be traded after the primary offering, the Moody\u0027s analysts note.\n",
        "This limits the adoption of tokenization, the new report said, adding that there is a noticeable growth in blockchain-powered secondary markets.\n",
        "Blockchain and tokenization bring \"significant innovations to secondary market structures,\" and developing secondary markets for blockchain-based securities could improve liquidity management, enhance market data accessibility and facilitate instantaneous settlements, the report said.\n",
        "\"These blockchain-powered secondary markets address several perceived drawbacks of traditional secondary markets, including limited accessibility of certain asset classes, inefficiencies in settlement processes, and high operational costs,\" the report said.\n",
        "Though these blockchain markets promise innovation, the report warns that there are also technological and regulatory hurdles.\n",
        "\"The technology underpinning these markets, primarily smart contracts, is susceptible to risks such as bugs, rug pulls, price manipulations, and oracle failures. These vulnerabilities not only pose financial risks to participants but also hinder the broader acceptance and integration of [decentralized finance],\" the report said.\n"
      ]
    },
    "publishedDate": "2024-04-18T00:00:00"
  },
  {
    "id": -183776990,
    "title": "Shiba Inu Fetches $12M Investment in a Token Sale to Build Privacy-Focused Blockchain",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/22/shiba-inu-fetches-12m-investment-in-a-token-sale-to-build-privacy-focused-blockchain/",
    "author": "Krisztian Sandor",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/Xpx3e4UhuVPCJF4WvKwaiLZQ37g\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/O2OVYINJHNCDJIATE4PXZBS26M.jpg",
          "description": ""
        },
        "Shiba Inu, the Ethereum-based ecosystem represented by the second-largest canine-themed token SHIB, raised $12 million in a token sale round for building its privacy-focused blockchain, according to a Monday press release.\n",
        "The list of investors participating in the round are Comma 3 Ventures, Big Brain Holdings, Cypher Capital, Shima Capital, Hercules Ventures, Animoca Brands, Morningstar Ventures, Woodstock Fund, DWF Ventures, Polygon Ventures, Stake Capital, Illuminati Digital Capital, Primal Capital, Mechanism Capital and Spirit Dao, who all purchased the new network\u0027s upcoming utility and governance token TREAT.\n",
        "The deal was completed by Shiba Inu Mint S.A., an ecosystem development firm incorporated in Panama, the press release added.\n",
        "The fundraising came after CoinDesk reported in February that Shiba Inu developers are working with cryptography company Zama on a privacy-focused new network on top of Shibarium, the ecosystem\u0027s Ethereum-based layer-2 blockchain. The network will be powered by Fully Homomorphic Encryption (FHE), a privacy tool that lets developers use data on untrusted domains without needing to decrypt it.\n",
        "Read more: Shiba Inu Adopts Tech to Bring More Privacy to SHIB Token Holders\n",
        "SHIB gained 2.2% over the past 24 hours, in line with the broad-market CoinDesk 20 Index\u0027s advance. It\u0027s the 12th-largest cryptocurrency with a nearly $16 billion market capitalization.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-22T00:00:00"
  },
  {
    "id": 839301105,
    "title": "Jack Dorsey’s Block Is Building a Bitcoin Mining System",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/24/jack-dorseys-block-is-building-a-bitcoin-mining-system/",
    "author": "Helene Braun",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/TdBK6K009l_zB3SKgU0ESwMqMzI\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/6F3KI6QD45FANMOE6J45VLBAAA.jpg",
          "description": ""
        },
        "Block, the payments company founded by former Twitter CEO Jack Dorsey, is building its own bitcoin (BTC) mining system as it deepens its footing in the challenging crypto mining space, the firm said on Tuesday.\n",
        "The firm, formerly known as Square, said in a blog post that it completed the development of its three-nanometer mining chip, which it had been working on since April 2023. The full design is in process with a leading global semiconductor foundry, according to the post.\n",
        "In addition to that, Block said that after speaking to community members about the pain points in the industry, it decided to also develop a full bitcoin mining system, which will include system design.\n",
        "“We’ve spent a significant amount of time talking to a wide variety of bitcoin miners to identify the challenges faced by mining operators,” it said in the post. “Building on these insights and pursuant to our goal of supporting mining decentralization, we plan to offer both a standalone mining chip as well as a full mining system of our own design.\n",
        "The bitcoin mining industry is dominated by only a few players, with Beijing-based miner Bitmain controlling roughly 60% of the market, according to estimates by CoinShares.\n",
        "“There are few serious competitors, which indicates significant potential for disruption,” said James Butterfill, head of research at CoinShares.\n",
        "Block announced the completion of a five-nanometer bitcoin mining chip prototype in May 2023, which is the same technology that Bitmain’s S21 mining machine uses. “This leads us to believe that 3nm chips could achieve even greater efficiencies,” he said.\n",
        "Although chip efficiency has rapidly improved in recent years as demand for bitcoin has picked up, the latest halving event on April 20, which cut the issuance of new bitcoin by 50%, adds even more importance for faster mining speed, as well as lower costs and enhances reliability, Butterfill said.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-24T00:00:00"
  },
  {
    "id": 1584372373,
    "title": "Thailand to Block Access to \u0027Unauthorized\u0027 Crypto Platforms",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/22/thailand-to-block-access-to-unauthorized-crypto-platforms/",
    "author": "Amitoj Singh",
    "content": {
      "elements": [
        "Authorities in Thailand have decided to block “unauthorized” crypto platforms to increase the efficiency of law enforcement in solving the problem of online crime, according to an announcement on Friday.\n",
        "After a meeting of the Technology Crime Prevention and Suppression Committee, Thailand’s Securities and Exchange Commission or SEC was ordered to submit information on unauthorized digital asset service providers to the Ministry of Digital Economy and Society to block access to the platforms.\n",
        "The SEC has considered the impact on users, and will give them time to manage their accounts before being unable to use the service, the announcement said.\n",
        "“Therefore, the SEC requests users of the said platform to quickly withdraw their assets from the platform,” the announcement said. The Thai SEC also cited earlier decisions by nations like India and the Philippines in blocking unauthorized platforms.\n",
        "Thailand’s regulators have been attempting to find the balance between supporting the crypto ecosystem and preventing fraud. On the one hand, it has allowed institutional investors and very high-net-worth individuals to invest in crypto exchange-traded funds (ETFs) and allowed retail investors to invest without limits in digital tokens backed by real estate or infrastructure, but on the other hand, it has said custodians need to have a contingency plan if something goes wrong.\n",
        "Read More: Thailand’s SEC Breaks New Ground in 2024 With Crypto-Friendly Rules\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-22T00:00:00"
  },
  {
    "id": -478724803,
    "title": "Crypto for Advisors: Governance in a Blockchain World",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/04/crypto-for-advisors-governance-in-a-blockchain-world/",
    "author": "Sarah Morton",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/ioF_Nsaiu81IaN8snfFUc9tbcZc\u003d/975x849/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/FWTBBSTWGVAETPPFUYF6CASH2M.jpg",
          "description": ""
        },
        "Transparency is considered one of the key value propositions public blockchains can offer in financial services. In today\u0027s main article, Scott Sunshine of Blue Dot Advisors shares his thoughts on financial governance in a blockchain world.\n",
        "In Ask an Expert, Cato Felán III from La Hoja Capital Partners explains how bitcoin is used as collateral in structured credit portfolios.\n",
        "Happy reading.\n",
        "You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.\n",
        "In today\u0027s rapidly evolving financial landscape, the adoption of blockchain technology is revolutionizing traditional corporate governance practices. This innovative technology offers a transparent, immutable and decentralized platform that can significantly benefit financial advisors’ clients. By leveraging blockchain-based governance, financial advisors can enhance trust, improve accountability, streamline operations and unlock new investment opportunities for their clients. Here\u0027s how:\n",
        "Transparency as the New Gold Standard\n",
        "One of the most compelling advantages of blockchain technology is its ability to provide unparalleled transparency. Blockchain creates an interference-proof ledger that records all corporate actions and transactions, making it easier for financial advisors to verify information and trust the companies they invest in. This increased transparency can lead to greater confidence in investment decisions, reduce the risk of fraud or mismanagement and ultimately strengthen the relationship between financial advisors and their clients.\n",
        "Corporate Accountability and Performance in a New Digital Era\n",
        "Blockchain\u0027s immutable nature ensures that once a transaction is recorded, it cannot be altered or deleted without consensus from the network. This feature promotes accountability among executives and board members, as all actions and decisions are permanently recorded and traceable. Companies that prioritize good governance practices, facilitated by blockchain technology, are more likely to perform well over the long term. This performance can translate into higher returns and reduced investment risk for clients, making it a win-win situation for both financial advisors and their clients.\n",
        "Democratized Decision-Making and Shareholder Engagement\n",
        "Blockchain platforms can facilitate direct participation in voting and governance activities, allowing clients to have a more active role in the companies they invest in. This democratization of decision-making can lead to better-aligned corporate strategies, more responsive management practices, and ultimately, a more robust and resilient investment portfolio for clients leading to better investment outcomes.\n",
        "Streamlined Operations and Cost Efficiency\n",
        "Blockchain technology can automate and streamline various governance processes, reducing administrative costs and improving operational efficiency. Smart contracts, which are self-executing contracts with terms directly written into code, can automate routine tasks such as compliance monitoring, dividend distribution, and proxy voting. By eliminating manual intervention and reducing administrative overhead, financial advisors can pass on these cost savings to their clients through lower fees, better investment opportunities or higher returns on investment.\n",
        "Enhanced Security and Data Protection\n",
        "Security is a top priority in the financial industry, and blockchain technology offers robust solutions to protect sensitive client data and investment information. Blockchain\u0027s cryptographic algorithms and decentralized architecture make it highly secure against tampering and unauthorized access. By storing data on a blockchain, financial advisors can enhance data protection, reduce the risk of data breaches and identity theft, and comply with stringent data privacy regulations, providing clients with peace of mind.\n",
        "Regulatory Compliance and Risk Mitigation\n",
        "Navigating complex regulatory landscapes can be challenging for financial advisors. Blockchain technology can help by providing real-time transparency, traceability, and auditability, making it easier to demonstrate compliance with laws and regulations. This enhanced compliance monitoring can mitigate regulatory risks, facilitate smoother interactions with regulatory authorities, and ensure that clients\u0027 investments comply with legal requirements, protecting both financial advisors and their clients from potential legal pitfalls.\n",
        "In conclusion, corporate governance practices in a blockchain world offer significant benefits to financial advisors’ clients. From enhanced transparency and trust to improved accountability, streamlined operations, enhanced security, and regulatory compliance, blockchain technology is revolutionizing the way financial advisors and their clients interact and collaborate. By embracing blockchain-based governance solutions, financial advisors can better serve their clients\u0027 interests, help them achieve their financial goals, and build stronger, more resilient investment portfolios for a prosperous and sustainable future.\n",
        "- Scott Sunshine, managing partner, Blue Dot Advisors\n",
        "Question: How do managers use bitcoin collateral in their real estate lending portfolios?\n",
        "Bitcoin is used in a hybrid collateral model where loans are underwritten based on the value of the real estate asset and a portion of bitcoin to be purchased with loan proceeds, thus creating two collateralized assets to secure the loan.\n",
        "Question: Why would a borrower want to do that?\n",
        "These hybrid loans are designed for borrowers who already participate in bitcoin and are comfortable with the asset. The bitcoin is held in a joint partnership between lender and borrower, with both parties benefiting from the asset’s long-term appreciation.\n",
        "Question: How does this affect portfolio risk?\n",
        "This is a new model, the risk of which is still being assessed. Managers who engage this strategy rely on the macro trend of bitcoin price appreciation despite historical periods of short-term volatility. Managers analyze bitcoin’s cyclical price performance to guide portfolio management and increase returns as bitcoin price reaches certain thresholds. There is some decrease in traditional credit risk as bitcoin’s growth potential allows managers to abstain from using traditional levers to increase return, mainly the use of leverage and adding riskier, higher-interest loans to the portfolio.\n",
        "- Cato Felán III, managing partner, La Hoja Capital Partners\n",
        "BlackRock’s tokenized USD Institutional fund (BUIDL) has registered over $240 million in deposits since its recent debut.\n",
        "CryptoQuant CEO says bitcoin miners are selling before the halving to acquire more equipment.\n",
        "FTX ex-CEO Sam Bankman-Fried was handed a 25-year sentence in US Federal Court last week.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-04T00:00:00"
  },
  {
    "id": -789181239,
    "title": "UK Lawmakers Call for Govt to Develop Crypto, Blockchain Skills Pipeline",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/17/uk-lawmakers-call-for-govt-to-develop-crypto-blockchain-skills-pipeline/",
    "author": "Camomile Shumba",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/M9rBbx6BZPIBGeDfWkM09K9muJU\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/JS5Y72KSRNEJ7IUTDHQ6VQHQAM.jpg",
          "description": ""
        },
        "Members of the U.K. Parliament have made a unanimous call for the government to invest in building skills to match the demand for employment from crypto, blockchain and artificial intelligence (AI) sectors.\n",
        "Member of Parliament Lisa Cameron, who chaired a Tuesday debate on the topic, urged the government to ensure that digital skills are taught from the early stages of education and even in the workplace.\n",
        "\"Although the U.K. is well placed to harness the opportunities presented by the growth of the digital economy, considerable preparation and investment in education, training and skills will be needed to make the most of these opportunities and to ensure that the U.K. has the necessary talent pipeline to help it realize its goal of becoming a tech superpower,\" Cameron said in a press statement shared with CoinDesk.\n",
        "The U.K. government has said it wants to make the country a hub for crypto. So far, it has put through legislation that recognized crypto as a regulated activity, with secondary legislation for stablecoins and other crypto activities on the way.\n",
        "However, for Cameron, more still needs to be done. One of the issues that\u0027s come to the forefront when speaking to employers in the digital sector is that they \"can\u0027t find the talent that they need,\" she said.\n",
        "Cameron also asked for there to be greater partnerships with blockchain companies such as Ripple, which launched a blockchain research initiative for universities in 2018; stablecoin issuer Circle, which partnered with academic institutions; and Tether, which launched an education initiative this year.\n",
        "\"We know that there are digital skills gaps to address. That gap is estimated to cost the U.K. economy £63 billion ($79 billion) a year,\" the U.K. Minister for Skills, Luke Hall, said in response.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-17T00:00:00"
  },
  {
    "id": 814830763,
    "title": "Jack Dorsey\u0027s Block Adding More Bitcoin to Balance Sheet, Presents Road Map for Others",
    "sourceUrl": "https://www.coindesk.com/business/2024/05/02/jack-dorseys-block-adding-more-bitcoin-to-balance-sheet-presents-road-map-for-others/",
    "author": "Stephen Alpher",
    "content": {
      "elements": [
        "Payments firm Block (SQ) has begun a dollar cost averaging (DCA) program to add to its already sizable bitcoin (BTC) stack.\n",
        "Led by CEO Jack Dorsey, the company in April began using 10% of its monthly bitcoin-related gross profit to buy additional bitcoin, with plans to do this each month for the remainder of 2024.\n",
        "For perspective, Block had $80 million in bitcoin gross profit in the first quarter, according to its earnings results. Were that level of profit to continue through the rest of the year, the company under this program would add another $24 million worth of bitcoin to its balance sheet.\n",
        "Block already has substantial bitcoin holdings, having purchased 4,709 bitcoins in October 2020 and another 3,318 tokens in early 2021. At today\u0027s price of about $59,000, that bitcoin is now worth roughly $4.7 billion.\n",
        "Alongside that news, the company also released its Bitcoin Blueprint For Corporate Balance Sheets, in which it describes the process through which it is able to acquire large amounts of the crypto without unduly moving the market, and how it custodies, insures and accounts for the holdings.\n",
        "\n"
      ]
    },
    "publishedDate": "2024-05-02T00:00:00"
  },
  {
    "id": 1951778930,
    "title": "Blockchain Developer Monad Labs Raises $225M Led by Paradigm",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/09/blockchain-developer-monad-labs-raises-225m-led-by-paradigm/",
    "author": "Sheldon Reback",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/F5Er4rFW3u9zftse4UUMDRXNsJM\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/V3Y36QFOLRCWXK2YTVTVWZHPPQ.jpg",
          "description": ""
        },
        "Monad Labs, which is looking to develop a faster version of the Ethereum blockchain, said it raised $225 million in a funding round led by Paradigm that will allow it to add staff and spend on bringing the test version of its blockchain into production.\n",
        "The layer-1 blockchain is compatible with the Ethereum Virtual Machine (EVM) that executes the rules of Ethereum and makes sure submitted transactions and smart contracts follow the rules. More than 96% of the capital invested in decentralized finance (DeFi) is processed by the EVM, Monad said in a post on Substack.\n",
        "However, while Ethereum processes fewer than 20 transactions per second, according to etherscan.io, Monad says its testnet, which went live in March, can handle some 10,000 TPS.\n",
        "Ethereum\u0027s speed, or lack of it, has spurred many efforts to provide a faster DeFi environment, including alternative layer-1 blockchains such as Solana and Cardano and layer-2 chains that bundle, or roll up, transactions and process them at a faster pace before sending them back to Ethereum for validation.\n",
        "Monad said it rewrote the blockchain code, introducing techniques such as parallel execution to optimize performance at all levels of the protocol, to improve throughput.\n",
        "Other investors in the round included Electric Capital, Castle Island Ventures, Animoca Ventures, Coinbase Ventures and CoinFund.\n",
        "Read more: Crypto Startup Monad Labs Aims to Create Next ‘Ethereum Killer’ After Raising $19M\n"
      ]
    },
    "publishedDate": "2024-04-09T00:00:00"
  },
  {
    "id": 515299963,
    "title": "EU Watchdog Says Reordering Blockchain Transactions Might Be Market Abuse. Industry Says It\u0027s Not",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/05/eu-watchdog-says-reordering-blockchain-transactions-might-be-market-abuse-industry-says-its-not/",
    "author": "Sandali Handagama",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/gAbSAETlh8rjkGMARo_MhSsrHeI\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/4TBWKA54O5G7VFQACBUWDJ5MNU.jpg",
          "description": ""
        },
        "The European Union markets regulator flagged maximum extractable value (MEV), whereby blockchain operators reorder user transactions to maximize their own profits, as a potential form of market abuse, a stance that is worrying some industry watchers who say the case is not clear-cut.\n",
        "In regulatory proposals published last week by the European Securities and Markets Authority (ESMA) under the digital assets law known as MiCA, the watchdog referred to MEV as potentially suspicious. MEV is broadly defined, but generally encompasses trading strategies where blockchain operators – the companies and individuals that add blocks to the chain – preview the network\u0027s transaction queue to extract extra profits for themselves.\n",
        "Frequently, such tactics involve reordering user transactions – shifting how they\u0027re ordered into blocks, or frontrunning them with new transactions – just before the trades are written to the chain\u0027s ledger.\n",
        "MEV is often called an \"invisible tax\" on users, since certain methods for extracting it, like sandwich attacks and frontrunning, can eat directly into end-user profits. While MEV is a controversial topic even within the industry, some industry advocates argue that MEV plays a positive role in general since it can help to improve blockchain network efficiency.\n",
        "Read more: What is MEV?\n",
        "“MEV by itself should not at all be considered as a market abuse and should not have a negative connotation,\" Anja Blaj, a policy expert at the European Crypto Initiative (EUCI), said in an interview over WhatsApp. \"There are very limited scenarios and tactics that have similar effects to those of market abuse. This should be emphasized over and over again as MEV\u0027s purpose in the first place is to compensate the good actors for the validation work they do.”\n",
        "Some crypto policy watchers have argued that MEV is not even within MiCA’s scope, and EUCI has warned that applying MiCA to MEV could lead to overregulation. While it\u0027s true the MiCA text does not mention MEV, ESMA\u0027s consultation on proposals to tackle market abuse notes that the legislation extends the EU’s existing market abuse rules to include reporting suspicious activity resulting not just from transactions but also “the functioning of the distributed ledger technology such as the consensus mechanism.”\n",
        "“MiCA is clear when indicating that orders, transactions, and other aspects of the distributed ledger technology may suggest the existence of market abuse e.g., the well-known maximum extractable value,\" it said.\n",
        "ESMA also noted that MiCA doesn’t require crypto service providers to report activity such as “scams, payments fraud or account takeover.”\n",
        "Peter Kerstens, an adviser to the European Commission on financial sector digitalization and cybersecurity, said MEV is neither good nor bad but may lead to questions about market integrity.\n",
        "Investors have a legitimate expectation that transactions on the blockchain will be validated in the order they were submitted, and MEV reordering can lead to frontrunning, where the \"validators\" that operate blockchains can move their own transactions ahead of others to ink an extra profit, according to Kerstens.\n",
        "“So MEV may lead to questions about the integrity of the market and it may trigger market abuse/frontrunning, but it does not have to in every instance,” Kerstens, who was instrumental in the creation of MiCA, said in a statement to CoinDesk.\n",
        "The legislation, whose full name is Markets in Crypto Assets, was finalized last year and made the EU the first major jurisdiction to comprehensively regulate the burgeoning digital assets sector.\n",
        "ESMA and the European Banking Authority (EBA) have been consulting on measures and guidance they’re required to issue under MiCA, with industry watchers engaging with the watchdogs to improve clarity on the rules – particularly for various service providers.\n",
        "EUCI is seeking more clarity from ESMA, ensuring that the regulator is clear on what scenarios involving MEV constitute market abuse.\n",
        "“When, if, a malicious MEV tactic is detected, it should further be elaborated who\u0027s responsible for it,\" Blaj said. \"We cannot talk about effective enforcement without clarity around the \u0027who\u0027 and \u0027what for.\u0027”\n",
        "Kerstens noted his thoughts on MEV are his personal views, but added that ESMA’s consultation seeking public feedback is in response to the European Commission – which proposed the MiCA framework – asking the regulator to provide advice on “if and when MEV is/leads to/can lead to market abuse.”\n",
        "“So an official/institutional view on this may be forthcoming,” Kerstens said.\n",
        "ESMA’s latest consultation is open for comments until June 25.\n"
      ]
    },
    "publishedDate": "2024-04-05T00:00:00"
  },
  {
    "id": -445256893,
    "title": "Australian Court Hands Over $41 Million of Crypto Held by Blockchain Mining Group at Regulator\u0027s Request",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/12/australian-court-hands-over-41-million-of-crypto-held-by-blockchain-mining-group-at-regulators-request/",
    "author": "Amitoj Singh",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/NLYXjhQgB-TqLOzmJpBb6wvF8hg\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/ZMU3Z3EX75DUXP7F5Y5RJ4262A.jpg",
          "description": ""
        },
        "An Australian Federal Court agreed to a petition from the nation\u0027s market regulator to hand over approximately US$41 million in digital assets invested by over 450 Australians with the NGS group of blockchain mining companies to three specialists from McGrathNicol, an independent advisory and restructuring company.\n",
        "The Australian Securities and Investment Commission (ASIC) said on Friday that it had commenced civil proceedings against NGS Crypto, NGS Digital and NGS Group and the sole directors of the companies: Brett Mendham, Ryan Brown and Mark Ten Caten, respectively. Mendham is also restrained from traveling outside of Australia.\n",
        "The court order came after ASIC alleged the companies breached Australian law and provided financial services without an Australian financial services license.\n",
        "\"ASIC alleges that the NGS Companies target Australian investors to invest in blockchain mining packages with fixed-rate returns, encouraging them to use funds transferred from regulated super funds to self-managed super funds (SMSFs) and then converted into cryptocurrency,\" the regulator said.\n",
        "The involvement of a restructuring company does not necessarily suggest the companies have collapsed. ASIC said it was concerned the funds were at risk of dissipation and appointing a receiver was the best way to protect the assets.\n",
        "While it continues to investigate, ASIC has not sought an outright ban on the companies but only interim and final injunctions preventing them from operating without a license.\n",
        "The NGS companies did not immediately respond to a CoinDesk request for comment.\n",
        "Read More: Australian Judge Hands Split Decision in Market’s Regulator vs Block Earner\n",
        "\n"
      ]
    },
    "publishedDate": "2024-04-12T00:00:00"
  },
  {
    "id": 1746250152,
    "title": "Avail, Blockchain Data Availability Project, Sketches Out Eligibility for Token Airdrop",
    "sourceUrl": "https://www.coindesk.com/tech/2024/04/12/avail-blockchain-data-availability-project-sketches-out-eligibility-for-token-airdrop/",
    "author": "Margaux Nijkerk",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/Dna_h6abMyjo-kaBZp5Gw2OwNyA\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/TJLAZNLCXJBZPOQY7RC5OJHBRE.jpeg",
          "description": ""
        },
        "Avail, a closely watched blockchain data-availability project currently running on a test network, is sketching out the eligibility criteria for a token airdrop – a move that would follow in the footsteps of the rival data project Celestia, whose own token has gained a market capitalization of more than $1 billion.\n",
        "A screenshot of a document describing the eligibility criteria for the airdrop was posted on the social-media platform X by the user @Bitcoineo, and Avail’s public-relations team flagged the tweet to CoinDesk, describing it as a \"leak.\"\n",
        "A project spokesperson said that the Avail team was not available to make a statement on Friday.\n",
        "The screenshot of the eligibility requirements suggests that users of layer-2 rollups, like Arbitrum, Optimism, Polygon, zkSync and Starknet, as well as ecosystem developers and Polygon PoS stakers, could receive the AVAIL token.\n",
        "Sandeep Nailwal, the co-founder of Polygon, also expressed excitement about the airdrop for the Polygon community, in his own post on X.\n",
        "Avail used to be part of Polygon, but was spun out in March 2023. Anurag Arjun, the founder of Avail, was a co-founder of Polygon.\n",
        "Avail’s airdrop comes as its competitors in the data availability space are gaining momentum – part of the trend of \"modular\" blockchains, where functionality previously was only available on \"monolithic\" blockchains like Ethereum are now being broken out as separate plug-in modules.\n",
        "Celestia, another data availability (DA) solution, had its TIA airdrop in November 2023, and the token already has a circulating market capitalization of $1.8 billion.EigenLayer, with its own in-house DA solution EigenDA, went live earlier this week with the project on the Ethereum blockchain, though officials have not confirmed plans for a token.\n",
        "Read more: Avail, an Ethereum Data Network to Rival Celestia, Raises $27M In Seed Round\n"
      ]
    },
    "publishedDate": "2024-04-12T00:00:00"
  },
  {
    "id": -939941938,
    "title": "Diamonds Arrive on a Blockchain With New Tokenized Fund on Avalanche Network",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/27/diamonds-arrive-on-a-blockchain-with-new-tokenized-fund-on-avalanche-network/",
    "author": "Krisztian Sandor",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/lVob2OXca83mS8Z7bKsOKYSEWGo\u003d/975x547/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/WUSTXCWTENDXBM4FNADMEMJ33U.jpg",
          "description": ""
        },
        "Diamonds are the latest conventional asset to get the cryptocurrency industry\u0027s red-hot tokenization treatment, as the precious stones will now be accessible on blockchain rails for investors.\n",
        "Crypto securities trading platform Oasis Pro created a token on the Avalanche C-Chain that represents a stake in the Diamond Standard Fund, a product sponsored by Diamond Standard Commodities and Horizon Kinetics, the companies announced in a Wednesday press release.\n",
        "\"For the first time in history, Diamond Standard and Oasis Pro are making an approximately $1.2 trillion natural resource accessible to investors via a more convenient, tradable fund,\" said Cormac Kinney, founder and CEO of Diamond Standard.\n",
        "The new offering arrived as real-world asset (RWA) tokenization – placing traditional assets such as gold, credit and bonds on blockchains in the form of a token – has become more popular over the past year. Global traditional finance giants like Franklin Templeton and HSBC have participated in tokenization-related pilot projects or started offering services. Most recently, BlackRock introduced a tokenized fund backed by U.S. Treasuries and repurchase agreements on the Ethereum blockchain.\n",
        "The Diamond Standard Fund, which is benchmarked to Bloomberg\u0027s Diamond Standard Index (DIAMINDX), is structured in a way that makes it accessible to pension funds and endowments, while also being eligible for U.S. retirement accounts known as IRAs.\n",
        "The token adopted the ERC-3643 token standard, an open-source suite of smart contracts that allows the issuance, management and transfer of permissioned tokens tailored for tokenized assets.\n",
        "\"Tokenizing diamonds and offering exposure through a fund structure on Avalanche is a great example of how blockchain can bring transparency and efficiency to an asset class that was previously opaque and inaccessible for institutions,\" said John Wu, president of Ava Labs, the ecosystem development organization behind Avalanche.\n"
      ]
    },
    "publishedDate": "2024-03-27T00:00:00"
  },
  {
    "id": 1768273720,
    "title": "Coinbase to Benefit From Long-Term Adoption of Blockchain Technology: Oppenheimer",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/04/coinbase-to-benefit-from-long-term-adoption-of-blockchain-technology-oppenheimer/",
    "author": "Will Canny",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/mxc3uith-mNYFNHpt4j30ntgKik\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/CUUIMP4BQBGGLEUYV3WIL6HAEU.jpg",
          "description": ""
        },
        "Coinbase (COIN) is well positioned to benefit from the long-term adoption of blockchain technology, broker Oppenheimer said in a research report on Wednesday raising its earning estimates for the crypto exchange.\n",
        "“We estimate that COIN’s 1Q24 trading volume would be up 95% quarter-on-quarter and 107% year-on-year to $300B,” analysts Owen Lau and Guru Sidaarth wrote, noting that the “adoption of digital assets continued after the approval of spot bitcoin (BTC) exchange-traded funds (ETFs) in January.”\n",
        "“More importantly, liquidity in this space has continued to increase, with the average market cap of USD Coin (USDC) increasing 12% quarter-on-quarter to $28b (or $31B at 1Q24-end),” the authors wrote. USDC Is a stablecoin issued by Circle, which is itself backed by Coinbase. The exchange earns gross interest income on USDC outstanding balances.\n",
        "Given the company’s improving outlook, the broker raised its price target for the stock to $276 from $200. Coinbase shares were trading 2.5% higher at $258 at publication time.\n",
        "Oppenheimer notes that since January the stock is up over 100% versus a measly 6% rise for the S\u0026P 500 index. “At this level of trading, we are cautious about the near-term volatility, but remain positive on the long-term adoption of blockchain technology.”\n",
        "Still, there are some potential headwinds. While the stock may have strong momentum behind it, there are risks that investors need to be aware of, the report said. The broker had previously expected approval of a spot ether (ETH) ETF in May, but now says there is a low probability of this happening.\n",
        "The ongoing lawsuit with the Securities and Exchange Commission (SEC) is also an overhang on the stock. “We currently believe that this case will be a long legal battle and will likely go to the Supreme Court to get the final decision,” the report added.\n\nRead more: Coinbase Offers Unique Exposure to the Long-Term Growth of Crypto: KBW\n"
      ]
    },
    "publishedDate": "2024-04-04T00:00:00"
  },
  {
    "id": -886270856,
    "title": "Wasabi Wallet-Developer Blocks U.S. Citizens and Residents After Samourai Wallet Arrests",
    "sourceUrl": "https://www.coindesk.com/policy/2024/04/29/wasabi-wallet-developer-blocks-us-citizens-and-residents-after-samourai-wallet-arrests/",
    "author": "Sam Reynolds",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/DcEgmd7ALRvMsg8_1_JU5tz7OSs\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/L3SDG4EELZH4RFPXF4D7TFOORQ.jpg",
          "description": ""
        },
        "The developer of privacy-focused Wasabi Wallet, zkSNACKs, has banned U.S. citizens and residents from using the platform.\n",
        "“In light of recent announcements by U.S. authorities, zkSNACKs is now strictly prohibiting U.S. users from using its services. An IP address blocking for U.S. residents is effective on wasabiwallet.io, api.wasabiwallet.io and zksnacks.com,” the team wrote in a blog update.\n",
        "The incident the post is referring to is the arrest of the founders of Samourai Wallet, who have been charged with money laundering.\n",
        "This all follows the arrest of Tornado Cash co-founder Roman Storm, who faces allegations of money laundering and sanctions violations, as the Department of Justice accuses Storm and his co-developer Roman Semenov of facilitating more than $1 billion in money laundering via their mixing protocol, including, allegedly, for North Korea’s Lazarus Group.\n"
      ]
    },
    "publishedDate": "2024-04-29T00:00:00"
  },
  {
    "id": 2059272067,
    "title": "French Energy Giant EDF Subsidiary Becomes Chiliz Blockchain Validator",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/21/french-energy-giant-edf-subsidiary-becomes-chiliz-blockchain-validator/",
    "author": "Jamie Crawley",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/8zvS_Q2Xy0BiYwi_68gz5c-RlDE\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/5CMCZIEKO5HQNFBUMGZWUQ6GME.jpg",
          "description": ""
        },
        "Exaion, a subsidiary of France\u0027s state-owned energy company EDF, became a network validator for the Chiliz Chain, joining one of the country\u0027s leading soccer teams in securing the network that hosts fan token trading for Socios.com as it looks to expand its blockchain efforts into sports and entertainment.\n",
        "Chiliz is seeking to leverage Exaion\u0027s expertise in the energy and tech sectors, according to an emailed statement. Exaion helps industries with digital transformation related to cloud and blockchain with a focus on addressing energy efficiency of data centers.\n",
        "Exaion co-founder Fatih Balyeli described the move as \"a pivotal strategy that resonates with our goal of shaping the future of digital engagement.\"\n",
        "Socios.com has developed fan tokens for some of the world\u0027s biggest soccer teams including FC Barcelona, Manchester City, Juventus and Paris St-Germain. PSG recently became a validator on the Chiliz Chain, the first club to do so.\n",
        "Validators manage blockchain nodes in order to secure the network by verifying transactions and authorizing smart contracts. In return, they generate revenue from running a node.\n",
        "Read More: Ethereum Validator Entry Queue Signals Renewed Interest in Staking\n",
        "\n",
        "\n",
        "\n",
        "\n"
      ]
    },
    "publishedDate": "2024-03-21T00:00:00"
  },
  {
    "id": 1417840705,
    "title": "Layer-1 Blockchain Peaq Raises $15M to Expand Its DePIN Ecosystem",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/27/layer-1-blockchain-peaq-raises-15m-to-expand-its-depin-ecosystem/",
    "author": "Jamie Crawley",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/T0b_Dzsr5M4S3WJSOIG8iN4QMog\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/Y5FCSH6JAZD2BIXH5TPQE4QRIY",
          "description": ""
        },
        "Layer-1 blockchain Peaq said it raised $15 million in funding to expand its ecosystem of decentralized physical infrastructure (DePIN) networks.\n",
        "The funding round, led by Generative Ventures and Borderless Capital and featuring participation from Spartan Group, CMCC Global and Animoca Brands, comes ahead of the blockchain\u0027s mainnet launch and listing of the PEAQ token.\n",
        "DePIN refers to using blockchain technology and token incentives to build physical infrastructure networks so other projects don\u0027t need to buy and run their own equipment. In other words, DePIN is a decentralized version of Amazon Web Services (AWS) or Google Cloud.\n",
        "Peaq currently hosts more than 20 DePIN networks, according to a Wednesday email statement.\n",
        "Crypto market data provider Messari estimates that DePIN could have a market value of $3.5 trillion by 2028.\n",
        "Read More: AIOZ Network Partners With Alibaba Cloud to Boost AI, Storage and Streaming Services\n",
        "CORRECTION (March 27, 14:28 UTC): Corrects spelling of Borderless Capital in second paragraph.\n"
      ]
    },
    "publishedDate": "2024-03-27T00:00:00"
  },
  {
    "id": 2049507751,
    "title": "Bitcoin Rally Holds Around $63,700 Following 4th Block Reward Halving",
    "sourceUrl": "https://www.coindesk.com/markets/2024/04/20/bitcoin-rally-holds-around-63700-following-4th-block-reward-halving/",
    "author": "Oliver Knight",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/Bq5GLMpexee4Xl-wjhvOG7e-68I\u003d/975x658/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/YN6DK7QXXJAFLJQCUC77GIREIA.png",
          "description": ""
        },
        "Bitcoin (BTC) held steady around $63,700 in the aftermath of the cryptocurrency\u0027s fourth halving, an event that upends the economics for the miners who power the Bitcoin ecosystem.\n",
        "BTC recently barely moved from its level right before the 840,000th Bitcoin block was mined just as Saturday began in UTC time. Bitcoin had slumped as low as $59,685 on Friday before rebounding above $65,000.\n",
        "Read more: The Bitcoin Halving Is Here, and With It a Giant Surge in Transaction Fees\n",
        "The halving has historically been a precursor to a rally in the price of bitcoin, with the last one, in May 2020, giving way to a run up from $9,500 to $65,000 during the subsequent year.\n",
        "But this time, bitcoin has already embarked on a momentous rally to record highs, rising from $15,500 in late 2022 to $73,680, helped by optimism around the approval of spot bitcoin ETFs in the U.S. and then then the ensuing enthusiasm after they began trading in January.\n",
        "On Thursday, JPMorgan said that it expected bitcoin to drop following the halving as it remained in \"overbought conditions\" based on the high level of open interest in bitcoin futures. Goldman Sachs added that in order for bitcoin to emulate the success of previous cycles following halving events, macro conditions need to be supportive of risk-taking.\n",
        "Read more: Complete coverage of the fourth Bitcoin halving\n",
        "Bitcoin has traded between $59,600 and $73,860 since Feb. 28 with the upside of the range being protected this week alongside the backdrop of rising conflict in Israel, which has had a knock-on effect across all capital markets.\n",
        "A sell-off on April 12 from $71,000 to $60,000 wiped out $4 billion in open interest from the bitcoin market, according to Coinalyze. The figure across all exchanges excluding CME is $16.1 billion.\n"
      ]
    },
    "publishedDate": "2024-04-20T00:00:00"
  },
  {
    "id": -627456970,
    "title": "Sygnum Tokenizes $50M of Fidelity International Fund as Matter Labs Moves Reserves to Blockchain",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/19/sygnum-tokenizes-50m-of-fidelity-international-fund-as-matter-labs-moves-reserves-to-blockchain/",
    "author": "Krisztian Sandor",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/7VUFnJe_C45_5sS5xcI2C5jHbgw\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/5FQYFKMVQNERLH5KD3JHBRCLLI.jpg",
          "description": ""
        },
        "Sygnum Bank tokenized $50 million of assets in a Fidelity International\u0027s money-market fund on zkSync for Matter Labs, the developer behind the Ethereum scaling network, according to a Tuesday press release.\n",
        "The security tokens represent Matter Labs\u0027 holdings in Fidelity International\u0027s Institutional Liquidity Fund, which has $6.9 billion of assets under management. This was the first instance of using Sygnum\u0027s multichain tokenization offering of traditional investments, the Switzerland-based bank said.\n",
        "The move was part of Matter Labs\u0027 long-term goal to move its reserves into a blockchain environment.\n",
        "Creating blockchain-based tokens of traditional investments such as bonds and funds – known as tokenization of real-world assets (RWA) – is an increasingly popular use case for blockchain technology as digital assets and traditional finance (TradFi) become more intertwined. Tokenized U.S. Treasuries, for example, have grown to a $730 million asset class from $100 million in early 2023 as crypto firms seek to earn a steady yield by parking their on-chain funds.\n",
        "Tokenization can increase transaction settlement speed and transparency while reducing the administrative burden, and global institutions such as Citi, JPMorgan and Franklin Templeton are testing the technology.\n",
        "\"Working with Fidelity (International) and utilizing zkSync, Sygnum leverages both the power of the blockchain and the experience of a global tier 1 investment manager,\" Fatmire Bekiri, Sygnum\u0027s head of tokenization said in a statement. \"It\u0027s a prime illustration of our mission to connect crypto and TradFi and build future finance on-chain.\"\n"
      ]
    },
    "publishedDate": "2024-03-19T00:00:00"
  },
  {
    "id": -613608511,
    "title": "Base Blockchain Transactions Jump on Meme Coin Led Frenzy",
    "sourceUrl": "https://www.coindesk.com/markets/2024/03/26/base-blockchain-transactions-jump-on-meme-coin-led-frenzy/",
    "author": "Shaurya Malwa",
    "content": {
      "elements": [
        "Crypto traders are seeking profit opportunities on the Base blockchain amid a meme coin-led frenzy for tokens issued on the network, several metrics show.\n",
        "Base, built by crypto exchange Coinbase on OP Stack, went live for developers in August and initially saw muted growth. However, that has changed in the past few weeks, with funds locked on the network rising to nearly $1 billion on Tuesday from $450 million at the start of this month.\n",
        {
          "url": "https://www.coindesk.com/resizer/iTYuLAXkUmjxs1V5i5fGcVUpaik\u003d/560x217/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/QD3QNVVEXJHKJBJGHZ2FKQRRMA.png",
          "description": ""
        },
        "Blockchain scanners show that transactional activity is up threefold to over 1.5 million a day from an average of under 500,000 a day in the past few months. The number of unique addresses has doubled to 65,000 wallets.\n",
        "Some market observers say direct access to Base from Coinbase’s exchange and wallet applications could make it the first network that retail users use, instead of the several other options – fueling a frenzy.\n",
        "Prices of tokens such as cat-themed toshi (TOSHI), thank you base god (TYBG), normie (NORMIE) and brett (BRETT) have risen as much as 1,300% over the past week, data shows, crossing over $1 billion in cumulative trading volumes.\n",
        "Tokens of technical projects such as decentralized exchange Aerodrome’s AERO and Seamless’ SEAM rose as much as 90% in the past week, CoinGecko data shows.\n",
        "That has generated the network $1.8 million in fees over the past 24 hours. Social sentiment on X has bumped in tandem, with scores of traders calling for a rotation of capital to the relatively new network.\n",
        "Meanwhile, the immense popularity of meme coins on Base has resulted in high gas fees, which exceeded the fees paid by users before the Dencun upgrade, Optimism developer Michael Silberling pointed out on X.\n",
        "Most of the transactions came from meme coin trading and trading bots designed to buy tokens in the first few minutes after issuance, contributing to network congestion and stuck transactions last week.\n"
      ]
    },
    "publishedDate": "2024-03-26T00:00:00"
  },
  {
    "id": -1638268363,
    "title": "Layer-1 Blockchain WAX Signs Deal With Amazon Web Services",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/26/layer-1-blockchain-wax-signs-deal-with-amazon-web-services/",
    "author": "Oliver Knight",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/33oimZ7ff8tukGZPhTsvF9ZMIS8\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/MS24UHZCS5ENXH26CCGJKZTWWA.jpg",
          "description": ""
        },
        "Gaming-focused layer-1 blockchain Worldwide Asset Exchange (WAX), the 10th-largest blockchain by activity, signed a deal to use Amazon Web Services (AWS) and integrate its network into the Amazon Managed Blockchain (AMB) service.\n",
        "The AMB service is designed to assist developers in building decentralized apps (dapps) on both private and public blockchains.\n",
        "By integrating into AMB, WAX developers will be able to deploy nodes through the AWS console and use those nodes to build on the WAX blockchain.\n",
        "The blockchain\u0027s native token {{WAX}} has risen by more than 20% over the course of the day, according to CoinDesk data. The CoinDesk 20 Index, a broad measure of the crypto market, has gained 1.6%.\n",
        "WAX rose by a further 5.6% following the announcement before receding back to $0.111.\n",
        "“The new partnership between WAX and Amazon Web Services is a major next step on our journey to the mass adoption of Web3,\" WAX CTO Lukas Sliwka said in a statement.\n",
        "Over the past 30 days WAX has facilitated 141 million transactions with 666,000 unique active wallets, data from Dappradar shows. The network hosts 160 Web3 games on its platform, including Brawlers, a trading card game that became a part of the Amazon Prime Gaming service alongside the likes of Apex Legends and Call of Duty.\n",
        "UPDATE (March 26, 2024, 16:09 UTC): Adds WAX price movement.\n"
      ]
    },
    "publishedDate": "2024-03-26T00:00:00"
  },
  {
    "id": -712263991,
    "title": "Cosmos-Based Canto Blockchain Reverses Course on Polygon Layer-2 Plans, Unveils New Roadmap",
    "sourceUrl": "https://www.coindesk.com/tech/2024/03/15/cosmos-based-canto-blockchain-unveils-cyclone-stack-in-runup-to-polygon-move/",
    "author": "Margaux Nijkerk",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/zlnqCOO9KbMuhFglCFala6lj324\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/RERWSSWWYFFEDKVKJB5UOKKQDM.jpg",
          "description": ""
        },
        "Cosmos-based layer-1 blockchain Canto unveiled its \"Cyclone Stack,\" aimed at scaling and improving performance. It is also reversing course on its previously announced plan to shift to an Ethereum layer-2 network.\n",
        "Canto, a blockchain designed for decentralized finance (DeFi) applications, first announced in September that it would become an Ethereum layer-2 network using Polygon’s Chain Development Kit (CDK). The team clarified on Friday, however, that it will continue to function as a Cosmos-based layer-1 network. It will run Polygon\u0027s type-1 prover, plugging into their aggregation layer (AggLayer) designed to unify blockchain liquidity.\n",
        "\"Over the past few months we’ve been working closely with the polygon team doing research on the integration, and came to conclusion that we’ll be using their Type-1 prover to stay an L1 instead of becoming an L2,\" a representative for Canto told CoinDesk in an email. \"Consensus for this decision was made amongst all of the major contributors of Canto\" and the project will tap into Polygon\u0027s AggLayer after Canto has finished some other upgrades, the representative added.\n",
        "Canto announced Friday that it is pushing ahead with its new Cyclone Stack update, which will consist of three key upgrades called the Callisto Upgrade, the Kallichore Upgrade and the Elara Upgrade. According to a Canto statement reviewed by CoinDesk, the upgrade is designed to speed up block times, increase storage access speeds and set new standards for execution.\n",
        "Canto says its Cyclone stack will also be fully compatible with all EVM tooling and applications. (EVM stands for the Ethereum Virtual Machine and is the software that executes smart contracts, and helps blockchains like Canto support applications built for compatibility with Ethereum and similar chains).\n",
        "“This comprehensive upgrade suite signifies a big step towards achieving high performance and scalability for Canto,” according to the press release. “Through these innovations, Canto is enhancing its platform for both developers and users alike.”\n",
        "Read more: The Plight of Hyped-Blockchain Canto Demonstrates Dreary DeFi Outlook\n",
        "CORRECTION (March 15, 16:18 UTC): Following this story\u0027s publication, a Canto representative clarified that the team has reversed course on its plan to transition to an Ethereum layer-2 network powered by Polygon\u0027s CDK. Canto will remain a layer 1 blockchain and run Polygon\u0027s type-1 prover. The team did not disclose this change publicly or to CoinDesk before publication.\n",
        "\n",
        "\n"
      ]
    },
    "publishedDate": "2024-03-15T00:00:00"
  },
  {
    "id": -991435376,
    "title": "Ethereum Hit by \u0027Blobscriptions\u0027 in First Stress Test of Blockchain\u0027s New Data System",
    "sourceUrl": "https://www.coindesk.com/tech/2024/03/28/ethereum-hit-by-blobscriptions-in-first-stress-test-of-blockchains-new-data-system/",
    "author": "Margaux Nijkerk",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/nMXseaOp1xu2kY1565TilMCKk7o\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/OVYRLMBALVEFXMY2FDLUNBQO5M.jpeg",
          "description": ""
        },
        "The Ethereum blockchain just a couple weeks ago completed a landmark upgrade to create a dedicated space for storing data – known as \"blobs,\" under a plan to reduce fees while also relieving congestion.\n",
        "But already, a new project has come along to jam up the so-called blob space, sending fees soaring and providing the nascent blob market with its first big stress test.\n",
        "Ethereum gas fees for blobs spiked Wednesday after a project called Ethscriptions created a new way of inscribing data, or minting inscriptions, on the data blobs, called “blobscriptions.”\n",
        "According to the Dune Analytics dashboard, the blob base fee soared to at least 582 gwei ($266) on Wednesday. As of writing on Thursday, the blob base fee had subsided to around 18 gwei ($8.69).\n",
        "“As widely predicted, it looks like March 27, 2024, will be remembered as the day that the ‘blobs are free EIP-4844 launch discount’ party came to a close – courtesy of Blob Inscriptions,” Matt Cutler, the CEO of Blocknative, wrote on X.\n",
        "EIP-4844 is the name of the proposal that ushered in the new blob market, incorporated as part of Ethereum\u0027s landmark Dencun upgrade completed on March 13.\n",
        "The blob space is especially crucial for the myriad layer-2 networks like Arbitrum, Optimism, Polygon and Coinbase\u0027s Base that have been built atop Ethereum to process transactions more quickly and cheaply than is possible on the main chain. As part of the process, the layer 2s need to park reams of data on Ethereum, accounting for a huge portion of their overall costs.\n",
        "In a blog post on Thursday, Ethereum co-founder Vitalik Buterin acknowledged that the Blobscriptions episode had pushed the new blob-fee market into \"price discovery mode,\" but he added that the data fees still remained far cheaper than they would have been under the old system of parking data as \"calldata\" in a regular Ethereum transaction.\n",
        "\"Blobs are not free, but they remain much cheaper than calldata,\" Buterin wrote. “From here, important scaling work, both in increasing blob count and in improving rollups\u0027 ability to make the best use of each blob, will continue to take place, but it will be more incremental.”\n",
        {
          "url": "https://www.coindesk.com/resizer/rf1WIDqJhYCRcB-hjOKyb-pKbBg\u003d/560x290/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/7CFOHANVLBFVLJ7DVRW2VGZJ4Y.png",
          "description": ""
        },
        "Read more: Ethereum Finalizes \u0027Dencun\u0027 Upgrade, in Landmark Move to Reduce Data Fees\n"
      ]
    },
    "publishedDate": "2024-03-28T00:00:00"
  },
  {
    "id": 1785046593,
    "title": "Pompliano, Ex-Journo Melinek Spin Up \u0027Token Relations\u0027 Startup for Blockchain Firms",
    "sourceUrl": "https://www.coindesk.com/business/2024/04/09/pompliano-ex-journo-melinek-spin-up-token-relations-startup-for-blockchain-firms/",
    "author": "Danny Nelson",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/8zPV9dhM-RBv2TrT1kkLKGlRSbo\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/P2SWRYSSAVDPBOZDU3DRWEUMGQ.jpg",
          "description": ""
        },
        "Crypto entrepreneur Anthony Pompliano and former TechCrunch reporter Jacquelyn Melinek are behind a new crypto communications startup, Token Relations.\n",
        "Not quite a media brand or a PR shop, Token Relations instead will give clients a direct path to talking to their \"community\" about metrics, milestones, product launches – the kinds of things that don\u0027t always fit neatly into a marketing plan, the two told CoinDesk in a recent interview.\n",
        "Token Relations will seek to partly displace X, formerly Twitter, the chaotic catch-all for nearly every piece of content currently released by crypto companies. Crypto Twitter\u0027s \"one-to-many\" distribution model prevents companies from getting their message to their core audiences, Pompliano said.\n",
        "\"We\u0027re stepping in as a dedicated effort to communicate to your existing stakeholders,\" the podcast host and investor said. He called Token Relations a \"third bucket\" separate from \"marketing intended to get new users,\" and \"PR, intended to talk to the press.\"\n",
        "Token Relations enters an industry whose loudest voices are perhaps well-attuned to debating media theory and the value (or lack thereof) of talking through the press. Last week the widely followed entrepreneur Balaji Srinivasan railed against PR companies as a \"sleeper cell\" for what he described as tech-hating journalists, advocating instead for founders to go \"direct.\"\n",
        "Pompliano and Melinek aren\u0027t quite creating a PR shop for their clients, who include entities associated with blockchain projects Avalanche, Optimism and Aptos. The startup is instead betting on direct channels, be it video interview content or newsletters disseminated to crypto buffs who want to be most in-the-know.\n",
        "The startup seeks to solve a decidedly crypto problem. No other industry has quite the same mashup of stakeholders whose interests can be financialized (token holders), career-focused (developers) and even cultural. They want to know what\u0027s going on, direct from the source and unfiltered through media, according to Token Relations\u0027 founders.\n",
        "Crypto\u0027s comms landscape is also unruly: There\u0027s no regulator in crypto pushing token-issuing startups toward making streamlined portals for disseminating critical information to their stakeholders, as with publicly traded companies and their investor relations websites.\n",
        "Instead, there\u0027s the black box of social media algorithms that Pompliano said suppress and lose information.\n",
        "On Token Relations \"there\u0027s no algorithm that will govern whether a communication is important,\" he said.\n"
      ]
    },
    "publishedDate": "2024-04-09T00:00:00"
  },
  {
    "id": -1642213363,
    "title": "Ethereum Blockchain Counts Down to \u0027Dencun\u0027 Upgrade, Set to Reduce Fees",
    "sourceUrl": "https://www.coindesk.com/tech/2024/03/12/ethereum-blockchain-counts-down-to-dencun-upgrade-set-to-reduce-fees/",
    "author": "Margaux Nijkerk",
    "content": {
      "elements": [
        "Ethereum developers are preparing for Wednesday\u0027s much anticipated Dencun upgrade, set to bring the biggest code change to the blockchain in over a year.\n",
        "Dencun – a portmanteau for the project names Deneb + Cancun – consists of two upgrades happening simultaneously on Ethereum’s consensus and execution layers\n",
        "Latest News: Ethereum Finalizes \u0027Dencun\u0027 Upgrade, in Landmark Move to Reduce Data Fees\n",
        "Technically known as a \"hard fork\" in blockchain terminology, it\u0027s expected to initiate around 13:55 UTC (9:55 a.m. ET). The upgrade is designed to usher in a new era of cheaper fees for the growing array of auxiliary networks that operate on top of Ethereum, called layer-2 (L2) \"rollups.\" Those changes will come with the activation of a new Ethereum Improvement Proposal (EIP) called “proto-danksharding,” or EIP-4844, which is designed to improve the chain\u0027s ability to handle data from L2 networks.\n",
        "Elements of the Dencun upgrade have been planned for several years, but developers delayed it from an original target of late 2023 due to some engineering concerns. Since then, developers have tested the package on three separate test networks (testnets), and most of those tests ran smoothly. (The first test on Goerli did not finalize for a few hours, but once a bug was patched, things began running smoothly again.)\n",
        "Some Ethereum fans are marking the occasion of Dencun\u0027s official launch by joining watch parties, with the EthStaker developer community and Nethermind, a leading Ethereum infrastructure team, each hosting livestreams.\n",
        "“We are making sure all our client and bootnodes are fully updated, and ready for fork,” said Barnabas Busa, a DevOps engineer at the Ethereum Foundation. “Our monitoring infrastructure is scaled up to ensure we don’t miss anything important.”\n",
        "Dencun will be Ethereum\u0027s biggest update since April 2023\u0027s Shapella upgrade, which enabled withdrawals of staked ether (ETH).\n",
        "Dencun includes a number of code changes, but the biggest one comes with “proto-danksharding,” which introduces a new method for storing transaction data onto Ethereum, called \"blobs.\"\n",
        "Layer-2 networks like Arbitrum, Optimism and Polygon will benefit the most from Dencun. The networks help to scale Ethereum by bundling up transactions from users and then passing them to Ethereum where they\u0027re settled in big batches. Over the past year, they\u0027ve become the primary venues for transacting on top of Ethereum, amassing billions of dollars in deposits and consistently boasting higher transaction volumes than the main Ethereum chain.\n",
        "After Dencun, L2s will be able to post data to Ethereum within the dedicated blobspace, rather than be forced to pay a higher cost for squeezing the data into conventional transactions. In theory, this could help L2s settle more data, more efficiently – thereby reducing fees for end-users.\n",
        "Proto-danksharding is Ethereum\u0027s first swing at \"sharding,\" which is a set of techniques to break up the blockchain into mini-shards (or mini-chains), to process more transactions for cheap.. A fully-formed version of sharding is still years away, but proto-danksharding could help solve some of Ethereum’s high gas fees in the short term by reducing fees for L2 networks.\n",
        "Proto-danksharding will also benefit a new class of blockchains that have entered the Ethereum fray called data availability (DA) layers. DA layers like Celestia, EigenDA and Avail help networks store large amounts of data; L2s frequently use them to store transaction data. Proto-danksharding could make the costs of downloading DA data cheaper.\n",
        "Polygon co-founder Jordi Baylina told CoinDesk in an interview previously that “prices should go down mainly because it\u0027s a matter of supply and demand. Your supply is bigger, the data availability on Ethereum is going to be bigger, so the price should go lower.\"\n",
        "“By how much? We don\u0027t know, it\u0027s difficult to predict,” Baylina added.\n",
        "After Dencun, Ethereum developers will start to tackle what will go into the next upgrade, now called Electra + Prague (Petra.) As of right now, developers have not decided what will make it into that package, but a strong contender is an upgrade called “Verkle Trees,” which is a new type of data category that should help nodes store large amounts of data.\n",
        "“Scalability is the fundamental unlock that enables permissionless collaboration between developers across projects and teams,\" said Karl Floersch, CEO of OP Labs, the primary developer firm behind the Optimism network. \"With EIP-4844 and Dencun, devs across the Ethereum ecosystem can more seamlessly build together.”\n",
        "The upgrade \"will enable a group of loosely coordinated devs to actually build systems that provide overall experiences that will rival the user experiences we’re used to from top-down, centrally planned platforms,” he said.\n",
        "Read more: Ethereum Fees Set to Drop for Arbitrum, Polygon, Starknet, Base. But How Much?\n",
        "Currently, the average transactions per second (TPS) figure over the past seven days across layer-2 networks is 93.18, compared to Ethereum\u0027s average of 14.42. These figures generate a scaling factor of 8.37x, according to L2Beat data.\n",
        "A Fidelity report on the upgrade states that layer-2s account for roughly 10% of the total layer-1 fees. That portion is expected to \"drop significantly\" after the upgrade, the money management firm said.\n",
        "Data from L2fees shows that the average cost of sending ETH on Arbitrum is $0.24 and it costs $0.67 to swap tokens. Optimism\u0027s fees are $0.47 and $0.92 respectively whilst Polygon\u0027s are $0.78 and $2.85. These figures are expected to fall following the upgrade.\n",
        "Representatives of the Starknet Foundation, an organization that supports the Starknet chain, issued a press release Tuesday claiming that its users would \"get the highest savings of any layer 2,\" because a \"higher proportion of Starknet fees go on DA than of any other layer-2 fees.\"\n",
        "The foundation said planned innovations would bring further savings, and that it planned to charge fees \"at future rates, covering the difference until the improvements are in place.\"\n"
      ]
    },
    "publishedDate": "2024-03-12T00:00:00"
  },
  {
    "id": -847543913,
    "title": "Goldman Sachs, BNY Mellon and Others Test Enterprise Blockchain for Tokenized Assets",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/12/goldman-sachs-bny-mellon-and-others-test-enterprise-blockchain-for-tokenized-assets/",
    "author": "Ian Allison",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/-U2huuJ_h42Jb4XN19Urkzlrmwk\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/N7OFEH5FZNGO5FJA2EOETLTVUM.jpg",
          "description": ""
        },
        "Bluechip financial blockchain provider Digital Asset has completed a test of its so-called Canton Network, with the participation of financial heavyweights like Goldman Sachs, BNY Mellon, DRW, Oliver Wyman, and Paxos.\n",
        "The Canton pilot, which involved 15 asset managers, 13 banks, four custodians and three exchanges, allowed the firms to seamlessly transact and settle tokenized assets and deal with fund registry, digital cash, repo, securities lending, and margin management transactions, according to a press release on Tuesday.\n",
        "\"The successful execution of over 350 simulated transactions proved how a network of interoperable applications can seamlessly connect to enable secure, atomic transactions across multiple parts of the capital markets value chain,\" the firm said. \"It also demonstrated the potential benefits of using such a network to reduce counterparty and settlement risk, optimize capital, and enable intraday margin cycles,\" the statement added.\n",
        "The interest in the world of enterprise blockchain, where large firms look for efficiencies to be gained from using private or permissioned versions of the technology underlying public networks like Bitcoin and Ethereum, is being driven by a renewed focus on tokenization: the realization of existing financial assets as blockchain-based tokens.\n",
        "“Canton allows previously siloed financial systems to connect and synchronize in previously impossible ways while abiding by the current regulatory guardrails,” said Digital Asset CEO Yuval Rooz in the statement.\n",
        "Additional pilot participants included: abrdn, Baymarkets, BNP Paribas, BOK Financial, Cboe Global Markets, Commerzbank, DTCC, Fiùtur, Generali Investments, Harvest Fund Management, IEX, Nomura, Northern Trust, Pirum, Standard Chartered, State Street, Visa, and Wellington Management with Deloitte acting as an observer, and Microsoft as a supporting partner.\n",
        "Read more: What Is an Enterprise Blockchain?\n"
      ]
    },
    "publishedDate": "2024-03-12T00:00:00"
  },
  {
    "id": -1162264759,
    "title": "With Mastercard, MetaMask Tests First Blockchain-Powered Payment Card",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/11/with-mastercard-metamask-tests-first-blockchain-powered-payment-card/",
    "author": "Ian Allison",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/odKU6Ui6NoRwthSgXNUkR8Dm76U\u003d/975x549/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/3YTHDDEURFHJLJTGPU7YIQLEXU.png",
          "description": ""
        },
        "MetaMask, the popular cryptocurrency wallet for the Ethereum blockchain, is testing an entirely on-chain payment card running on Mastercard\u0027s giant network and issued by Baanx, according to promotional materials and a testing platform seen by CoinDesk.\n",
        "Such a product would unite two giants of their respective fields. MetaMask is the biggest self-custody wallet with more than 30 million monthly active users, while Mastercard provides key plumbing in the conventional financial system through its credit- and debit-card network spanning the globe.\n",
        "The MetaMask/Mastercard payment card would be \"the first ever truly decentralized web3 payment solution,\" allowing users to spend their crypto \"on everyday purchases, everywhere cards are accepted,\" according to the marketing materials.\n",
        "Mastercard and its rival Visa have been quietly courting public blockchain developer communities and self-custody wallet providers of late. Mastercard has been working with hardware wallet firm Ledger as well as MetaMask, CoinDesk reported in October of last year.\n",
        "Visa, meanwhile, has been working with the USDC stablecoin and the Solana blockchain on cross-border payments and smoothing out wrinkles like paying Ethereum gas fees.\n",
        "MetaMask developer Consensys did not respond to a request for a comment.\n",
        "When contacted by CoinDesk, a Mastercard representative pointed to the firm\u0027s statement from October: \"Mastercard is bringing its trusted and transparent approach to the digital assets space through a range of innovative products and solutions – including the Mastercard Multi-Token Network, Crypto Credential, CBDC Partner Program, and new card programs that connect Web2 and Web3.\"\n",
        "UPDATE (March 11, 2024, 21:33 UTC): Adds that Baanx will issue the card.\n"
      ]
    },
    "publishedDate": "2024-03-11T00:00:00"
  },
  {
    "id": 606204958,
    "title": "Why Blockchain Payments Are Misunderstood",
    "sourceUrl": "https://www.coindesk.com/consensus-magazine/2024/03/05/why-blockchain-payments-are-misunderstood/",
    "author": "Paul Brody",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/mrXr7Pcp3kLC6LG7C4ZWykTzXMw\u003d/975x650/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/7KX4QWBYHJDW7LLOH53VFK4EGI.jpg",
          "description": ""
        },
        "Payments are one of the most promising areas for blockchain technology. But I believe they are not always well understood, and the discussion sometimes gets confused and overly ambitious.\n",
        "Blockchains could face an uphill battle to replace traditional payment systems even though they look relatively competitive at the moment. On the other hand, I think many people are ignoring the biggest opportunity areas because they are not looking at the true transaction costs.\n",
        "Paul Brody is EY\u0027s global blockchain leader and a CoinDesk columnist.\n",
        "One enduring myth is that old technologies, like mainframes, are driving up the cost of payments. In fact, centralized payment systems are extremely efficient. Indeed, it seems unlikely that decentralized systems will ever be more efficient as they involve lots of copying of data and verification. Decentralized systems are getting more efficient at this, but they are chasing a moving target.\n",
        "Centralized systems are not sitting still, but they typically offer somewhat limited functionality. It is usually about transferring money and often involves little in the way of complex business logic support. Centralized systems work very well when the payment is one directional. Point-of-sale systems, person-to-person payments and repeated long-term payments, like payroll or mortgages, work very well in these contexts.\n",
        "The real drivers of high costs in traditional payments are often either complex regulatory requirements or a lack of competition. This can lead people to confuse cost and price or to make what is, in effect, not really an apples-to-apples comparison.\n",
        "Comparing a highly regulated system to one that sits in a gray area can be misleading. Many crypto-based remittance applications do little or no know-your-customer and anti-money laundering checks, which are costly and difficult to run. This is a cost advantage that is unlikely to last.\n",
        "Low levels of competition are another big driver in high payment costs. This is true both for business-to-business and consumer-to-consumer payments. There are only a few big global payment networks, though competition in this space is rising. On the consumer side, the big driver of costs are retail networks.\n",
        "Payments between consumers who already have smartphones and bank accounts are relatively low cost, but the costliest payments are ones that take place between people who do not have bank accounts. These depend on physical retail networks that accept cash, and only a few companies have built those.\n",
        "Low levels of competition represent a big opportunity for crypto payment firms to enter markets with higher functionality and lower prices. I personally believe that the consumer side is the toughest because the highest prices are well defended by retail networks that took many years to build. However, on the more competitive side, specialized networks like Lightning for bitcoin can level the field. They might not be as fully decentralized as the main network, but they represent very low costs and speed. Similar layer 2s that specialize in low-cost transactions are taking shape in the Ethereum ecosystem as well.\n",
        "On the business side, blockchains can drive costs down and build sustainable advantage through differentiated technology. While it is true that main-net transaction costs in Ethereum are higher, the addition of smart contract functionality changes the equation entirely.\n",
        "Enterprises issue payments to each other usually as part of a complex agreement. This usually means not only verifying receipt of goods or services, but also compliance with the agreed upon terms. The American Productivity and Quality Center (APQC) estimates that it costs about $100 on average for a large company to run this process. That cost is mostly human labor.\n",
        "In this context, the actual payment cost is \u003c10% of the total and the other 90% is addressable using smart contracts.\n",
        "Smart contracts automate the process of checking with compliance terms and conditions and the result is faster execution at a fraction of the cost. While the actual payment, being executed on-chain, may be technically be somewhat higher, the total cost of running the business process is much lower. Real world experience at EY shows a 40% cost reduction, and we expect that to go even deeper as our skills in this space improve.\n",
        "The biggest obstacles to making this process work on-chain has been the lack of built-in privacy and data integration from enterprise systems. Smart contracts and payments without privacy disclose too much sensitive data for most enterprises to be interested. Now that these issues are addressable using Zero Knowledge proofs (ZKPs) and circuits, the path is clearer. It will still require companies to link the enterprise systems to on-chain smart contracts, but this is a more straight-forward requirement to implement in most cases.\n",
        "Right now, the kind of fully digital end-to-end systems that smart contracts enable are the province of the world’s biggest companies. With scale and deep pockets, big companies have built integrated systems without blockchains. However, because they are highly customized and built on private systems, they are too costly and complex for most smaller firms to manage. As blockchain access spreads through the business world, we will see more than just efficiency, we will see a more level playing field between small firms and large enterprises.\n"
      ]
    },
    "publishedDate": "2024-03-05T00:00:00"
  },
  {
    "id": 483388703,
    "title": "Blockchain Builder Eclipse Labs Raises $50M Ahead of Layer-2’s Mainnet Debut",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/11/blockchain-builder-eclipse-labs-raises-50m-ahead-of-layer-2s-mainnet-debut/",
    "author": "Danny Nelson",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/E-CqHrvexlFBd-tjI9PtB-wGE64\u003d/975x640/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/ZBFGWVYGPZBZPEHUPYNOWKHJXU.jpg",
          "description": ""
        },
        "Eclipse Labs, the company building a blockchain to scale Ethereum using parts from Solana, raised $50 million ahead of its mainnet debut, which should come within weeks.\n",
        "In an interview, CEO Neel Somani declined to share his two-year-old company’s current valuation. Eclipse last raised cash at a nine-figure valuation in September 2022.\n",
        "The fresh funding round gives Eclipse Labs capital to fill top slots in growth, HR and research as it prepares to open its novel mainnet to developers. One developer building an app that will run on Eclipse told CoinDesk that launch is weeks away.\n",
        "Eclipse seeks to use a mix of technology from Solana, Celestia, Ethereum and RISC Zero for its proposed scaling solution – basically, speed like Solana with security provided by Ethereum. Apps built for Solana will be able to run on Eclipse with minimal changes, with SOL being the token of the realm.\n",
        "The result will be a “net additive for both ecosystems,” Somani said. “From an ETH perspective, this is an important way for Ethereum to scale. For Solana, we’re bringing more people into the Solana Virtual Machine,” or SVM.\n",
        "The SVM – Solana’s execution environment – is the software that allows Solana-based DeFi protocols to run. Blockchains in Ethereum’s orbit commonly use EVM to make it easy for Ethereum-based protocols such as Uniswap to port themselves over to their thing. So, too, will be the case for Eclipse. Somani said “major Solana protocols,” including the lending platform Solend, have agreed to set up operations on Eclipse when it launches.\n",
        "“It’s a good bet, in my opinion,” said Rooter, the pseudonymous developer behind Solend.\n",
        "Somani said the mainnet launch will only target developers. That means Eclipse won’t initially set up a user-friendly bridge through which traders and other would-be users could easily move money into the ecosystem.\n",
        "Of course, such details haven’t dissuaded eager users before. Last July, Coinbase’s Base blockchain attracted millions of dollars of inflows before its public debut. Traders seemed too keen to speculate on the Ethereum layer 2’s meme coins to wait.\n",
        "Somani said Eclipse is committed to decentralizing its governance over time and putting stakeholders in charge of big decisions. When asked if this meant Eclipse would airdrop a token, he declined to say. However, he acknowledged that tokens have become an accepted part of decentralizing governance in crypto projects.\n"
      ]
    },
    "publishedDate": "2024-03-11T00:00:00"
  },
  {
    "id": 1239473559,
    "title": "BOB, a \u0027Hybrid\u0027 Layer-2 Blockchain Mixing Bitcoin and Ethereum, Raises $10M",
    "sourceUrl": "https://www.coindesk.com/business/2024/03/27/hybrid-layer-2-bob-raises-10m-to-support-evm-compatible-bitcoin-layer-2/",
    "author": "Jamie Crawley",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/lu_DFGdxkTyKUu6tOLC0v62UDuw\u003d/975x548/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/3LKRTU5WZFAZ5LANVMVUZGONKI.jpg",
          "description": ""
        },
        "BOB, a hybrid layer-2 network – connected to the Bitcoin blockchain, but with Ethereum compatibility – has raised $10 million in seed funding.\n",
        "The round was led by Castle Island Ventures and included participation from Mechanism Ventures, Bankless Ventures, CMS Ventures, UTXO Management, along with angel investors Dan Held and Domo, creator of the BRC-20 token standard.\n",
        "BOB\u0027s aim is to roll out the first Bitcoin layer 2 with Ethereum Virtual Machine (EVM) compatibility. EVM is Ethereum’s native processing system that allows developers to create smart contracts. The name BOB is an acronym for \"Build on Bitcoin.\"\n",
        "Bringing Ethereum-style contracts to Bitcoin is seen as something of a sticky wicket due to concerns that the computations would place a strain on the network and degrade performance for other users.\n",
        "However, the spirit of developing atop Bitcoin received some fresh impetus last year through the BitVM proposal, as laid out in a whitepaper in October. Under BitVM, computations would be performed off-chain and then verified on-chain, similar to the mechanics of optimistic rollups on Ethereum, meaning there would be no risk of clogging up the network at other users\u0027 expense.\n",
        "Read More: Satoshi-Era Bitcoin Function \u0027OP_CAT\u0027 Dusted Off as Development Fervor Grows\n",
        "\n",
        "\n",
        "\n"
      ]
    },
    "publishedDate": "2024-03-27T00:00:00"
  },
  {
    "id": -582655041,
    "title": "MyShell, Blockchain Platform For Building \u0027AI Girlfriends\u0027 and Productivity Apps, Raises $11M",
    "sourceUrl": "https://www.coindesk.com/tech/2024/03/27/myshell-blockchain-platform-for-building-ai-girlfriends-and-productivity-apps-raises-11m/",
    "author": "Sam Kessler",
    "content": {
      "elements": [
        {
          "url": "https://www.coindesk.com/resizer/bg9mKjy6wszS_leywMNiayZJZ-c\u003d/975x654/filters:quality(80):format(jpg)/cloudfront-us-east-1.images.arcpublishing.com/coindesk/XAH5GDSVAJHFPE6HBSZMPLKJ7E.jpg",
          "description": ""
        },
        "MyShell, a Tokyo-based decentralized AI platform used to create \"AI girlfriends,\" has raised $11 million in pre-series A funding for its AI app-building ecosystem.\n",
        "The investment, which brings MyShell\u0027s total funding to $16.6 million, was led by Dragonfly, with additional participation from Delphi Ventures, Bankless Ventures, Maven11 Capital, Nascent, Nomad Capital and OKX Ventures. The round also attracted support from individual investors such as crypto investor and thought leader Balaji Srinivasan, NEAR\u0027s Illia Polosukhin and Paradigm\u0027s Casey K. Caruso.\n",
        "MyShell pitches itself as an ecosystem for AI creators to develop and deploy applications. The new funds will be used to further the development of its open-source foundational model and to support its community \"of over 1 million registered users and 50,000 creators,\" according to a statement.\n",
        "MyShell aims to distinguish itself from other AI platforms with its focus on decentralization: The company has open-sourced key parts of its codebase and leans on blockchain tools to assist with model training and creator royalties.\n",
        "Crypto will \"uniquely enable\" MyShell to \"help creators and AI model researchers to monetize their work,\" and blockchains will serve as the foundation for \"a dedicated platform to trade, and own AI assets,\" MyShell CEO Ethan Sun told CoinDesk in an email.\n",
        "The company\u0027s main products include “Workshop,” where users can build AI agents through prompts, and “Makerspace,” a no-code app development tool for creators. The tools have mainly gained steam in the realm of AI companions, with people utilizing the platform to create Her-like chatbots designed to resemble specific characters, both real and imagined.\n",
        "\"These AI applications and models have the capability to \u0027generate\u0027 revenue, making them AI assets that could be tokenized, traded and owned to share \u0027revenue stream,\u0027\" said Sun.\n",
        "MyShell provides a space for users to showcase their creations in its Discord discussion community, and most of the agents shared there tend to be AI girlfriends designed to look like cutesy anime characters – many of which gate access behind \"not safe for work\" content warnings. Some have taken the tool in a different direction, however, using MyShell to create AI bots mimicking figures like Elon Musk, the tech mogul; and Saul Goodman, the quick-witted lawyer-criminal from Breaking Bad.\n",
        "According to Sun, \"about 40% of content created by the community is AI girlfriend/companion,\" but \"the main goal of MyShell is to empower creators to build customized AI applications in a diversified range rather than just focusing on AI companions.\"\n",
        "\"Given the ability of third-party API integrations and comprehensive AI models to process information, it’s now possible to build applications and productivity tools without coding,\" said the MyShell CEO.\n",
        "In its statement on Tuesday, MyShell noted that in addition to building out its companion-creator community, the company\u0027s tech has served as the foundation for MeloTTS, \"a pioneering open-source text-to-speech solution that closely mimics the human voice\" and Allice, an \"open-source foundation model for an AI-App development workflow.\"\n"
      ]
    },
    "publishedDate": "2024-03-27T00:00:00"
  }
]