[{"id":-13565968,"title":"Crypto Education Gains Traction During Financial Capability Month","sourceUrl":"https://cryptonews.com/news/crypto-education-gains-traction-during-financial-capability-month.htm","author":"Rachel Wolfson","content":{"elements":["Crypto Education Gains Traction During Financial Capability MonthApril is recognized as National Financial Capability Month in the U.S. to highlight financial education across the country. And while initiatives have been taking place to educate Americans about the traditional finance sector, opportunities around crypto education are also being presented this month.Crypto Education Becomes Important In The U.S.A recent study from Security.org found that the rate of crypto ownership in the U.S. grew by 10% last year. According to the study, 93 million people hold one or more cryptocurrencies.The upcoming Bitcoin Halving event has also sparked increasing interest in Bitcoin (BTC).Given the rising popularity of digital assets in the U.S., industry experts believe that education about cryptocurrency has become increasingly necessary.Bitcoin Educational Initiatives In The U.S.Kendra Cole, Co-founder and CEO of Sparrow Finance, told Cryptonews that the recent approval of Spot Bitcoin ETFs in the U.S. has pushed digital assets to the mainstream.Cole believes that individuals—particularly women and children—must be presented with better educational opportunities regarding Bitcoin adoption.“The impetus for women to get involved in Bitcoin now is to build stronger bonds through shared experiences and interests,” said Cole. “We know that women are oftentimes the chief financial officers of the home, making the majority of the financial and gifting decisions. Sparrow Finance aims to provide the tools to do this through Bitcoin education.”During Financial Capability Month, Cole shared that Sparrow Finance participated in Chicago’s Ultimate Baby Shower. This was a community-wide event for parents to discuss financial education.“During this gathering, we met with new parents to provide information about how women can get involved with digital assets,” she said. “We also discussed ways for women to leverage Bitcoin to build connections with loved ones.”Cryptocurrency exchange Coinbase is also focused on crypto education this month. A Coinbase spokesperson told Cryptonews that 87% of Americans want to update the financial system.“The top drivers of this discontent are frustration over fees and speed,” the spokesperson noted. “The current system costs regular Americans too much, takes too long, and gets you less for your money over time.”In order to shed light on this, Coinbase released a commercial this week explaining the Bitcoin halving event to the masses.“The spot will air on major U.S. channels, including TNT, ESPN, and ABC during the NBA Playoff games,” the spokesperson said. “The commercial will run from April 17 through April 22.”Food for thought: What if money was designed to get you more over time, not less?#Bitcoin pic.twitter.com/z8eHF8JltQ— Coinbase 🛡️ (@coinbase) April 15, 2024Coinbase believes that this advertisement sends viewers an important educational message.“This April, the rate of new Bitcoins created will be cut in half—just like it has been every four years or so since it was created in 2009,” the spokesperson explained. “This halving ensures its supply remains finite over time (similar to gold).”Coinbase added that the company’s marketing philosophy seeks to meet audiences where they are “in a tech-forward way.” “All of our campaigns have both online and offline components, and we invite the audience to participate,” the spokesperson said.BlackRock, the San Francisco-based asset management giant with over $10.5 trillion in assets under management, also recently released an educational series covering Bitcoin.A series of four short videos focused on different Bitcoin topics are available on Blackrock’s official website. Bitcoin ETFs, the halving event, security, and Bitcoin adoption are all discussed in easy-to-understand language.For example, Blackrock’s educational video on the Bitcoin halving notes, “To ensure no more than 21 million coins enter circulation, every four years there is what is known as a halving event, where the amount of bitcoin issued to miners for completing each block is cut in half.”Crypto Education Increases Across The WorldWhile crypto education is becoming increasingly important in the U.S., a number of initiatives are being launched throughout the world as well.For example, cryptocurrency exchange Bitget recently announced that it will allocate up to $10 million to the corporate social responsibility Blockchain4Youth project.Gracy Chen, Managing Director of Bitget, told Cryptonews that the purpose of this undertaking is to support young talent while establishing a blockchain-friendly educational environment.“Since the launch of Blockchain4Youth in May 2023, the program has been hosting campus roadshows around the world to educate global youth about blockchain knowledge,” said Chen. “This month, Bitget hosted a Blockchain4Youth event at Ton Duc Thang University in Ho Chi Minh City as part of the HUB FORUM 2024 event, gathering over 1,000 students from various universities in Ho Chi Minh City.”Chen pointed out that hosting events like Blockchain4Youth has become a necessity, noting that a recent Bitget study found that Millennials and GenZ’s are likely to become the main drivers of crypto adoption.Chen added that Bitget has other educational crypto events planned in the Philippines and Japan later this month as well.“Cryptocurrencies have the potential to provide financial access to people who are underserved or excluded by traditional banking systems,” she said. “Education can help bridge the gap by teaching people how to use cryptocurrencies and access financial services in a decentralized manner.”Stablecoin issuer Tether also recently established an educational initiative in the Middle East.The USDT issuer partnered with digital asset infrastructure provider Fuze to create digital asset awareness for businesses and individuals across Turkey, the Middle East, and North Africa.Tether and Fuze Forge Strategic Collaboration to Elevate Digital Asset Education in Turkey and the Middle Easthttps://t.co/QafmslCcke— Tether (@Tether_to) April 15, 2024Tether and Fuze will develop programs and workshops to enhance awareness and understanding of cryptocurrency and blockchain technology among local financial institutions.Crypto Education Remains ChallengingWhile it’s notable that crypto education is becoming prioritized, challenges associated with digital assets may create barriers.For instance, Cole believes that the biggest challenge involved with digital asset education is overcoming the knowledge and confidence gap.“This gap disproportionately affects women, who juggle multifaceted responsibilities —like their career, family, and finances —all while navigating the complexities of digital assets,” she said. “Amidst all of this, finding time to delve into digital asset education can seem daunting.”To overcome these obstacles, Cole views the power of community and in-person events as ways to help women and families understand cryptocurrency.While this may be the case, Chen believes the crypto industry’s fast-paced nature is problematic for most individuals.“The cryptocurrency industry may see new innovations emerge every month, week, or even daily,” she said. “Only learners with a high level of curiosity and initiative are able to keep up with the crypto industry’s pace effectively.”Given this, Chen noted that individuals wanting to learn about digital assets shouldn’t rely solely on articles, videos, books, or the internet to grasp the industry fully."]},"publishedDate":"2024-04-19T22:43:47"},{"id":1749422058,"title":"Anti-Bitcoin SEC Commissioner Caroline Crenshaw May Soon Lose Her Seat","sourceUrl":"https://cryptonews.com/news/bitcoin-sec-commissioner.htm","author":"Andrew Throuvalas","content":{"elements":["Anti-Bitcoin SEC Commissioner Caroline Crenshaw May Soon Lose Her SeatA member of the Securities and Exchange Commission (SEC) who is emphatically critical of Bitcoin and crypto may lose her spot at the agency’s high table on June 5, government records suggest.Per the SEC’s website, Commissioner Caroline A. Crenshaw was sworn into her position alongside Commissioner Hester M. Peirce (aka “Crypto Mom”) on August 17, 2020. Both have terms that are due to expire on June 5 – less than 50 days from today.SEC Commissioner Approaches End Of TermAccording to Fox Business journalist Eleanor Terret, recent White House statements and nominations show no signs that Crenshaw or anyone else has been nominated to fill her position after her term is finished.🚨NEW: l got lots of messages yesterday asking if the @GaryGensler resignation rumor was true.Firstly, it’s an election year and there’s a high possibility these could be his final few months as chairman, a position he likes, so it’s unlikely he would throw in the towel early.… pic.twitter.com/DBihpCeLjY— Eleanor Terrett (@EleanorTerrett) April 19, 2024“The White House had no comment on the matter,” Terret said.The revelation follows rumors earlier this week that SEC chairman Gary Gensler may soon resign after he posted a Twitter thread on Tuesday that read somewhat like a goodbye message.Several crypto-supportive congressmen, including Tom Emmer, have called on Gensler to resign for his hostile treatment of the industry and failure to adequately protect investors from its true bad actors.Under his leadership, the agency has filed dozens of enforcement actions against top crypto firms accusing them of securities law violations, while their leaders say the regulator’s evaluation of the law with respect to crypto is both unclear and outdated.Terret believes the likelihood of Gensler actually resigning during an election year is slim to none, and the odds of finding a nominee to replace him are “virtually impossible.”Crenshaw’s Views On BitcoinCrenshaw’s potential exit could be more important for the industry. Unlike Gensler, she voted not to approve Bitcoin spot ETFs for U.S. markets in January even though the agency had already lost a court case on the matter months prior.“These Commission actions are unsound and ahistorical,” Crenshaw wrote in a dissenting letter at the time. “And worse, they put us on a wayward path that could further sacrifice investor protection.”The commissioner added that spot Bitcoin ownership is highly concentrated and said the crypto spot markets are a “petri dish” of fraudulent conduct.“If the technology is so revolutionary, why do so many of its uses seem to revolve around recreating the existing financial system, except with less regulation, more opacity, fewer investor protections, and more risk?” she added."]},"publishedDate":"2024-04-19T22:25:14"},{"id":-717757435,"title":"Hedgey Finance Suffers Dual Exploits, Losing $44.7 Million in Funds","sourceUrl":"https://cryptonews.com/news/hedgey-finance-suffers-dual-exploits-losing-44-7-million-in-funds.htm","author":"Hassan Shittu","content":{"elements":["Hedgey Finance Suffers Dual Exploits, Losing $44.7 Million in FundsHedgey Finance suffered a devastating blow on April 19 when two simultaneous exploits drained $44.7 million from the token infrastructure platform.During the two-hour attack, the hacker utilized the ‘createLockedCampaign’ function with flash-loaned funds across multiple blockchains.Hedgey Finance Hacked: $1.9 Million Stolen on Ethereum, $42.8 Million on ArbitrumCyvers reported that Hedgey Finance suffered two exploits, one on the Ethereum (ETH) blockchain and another on the Arbitrum (ARB) network. The ETH attack resulted in a loss of $1.9 million, while the Arbitrum exploit led to a theft of $42.8 million in ARB tokens.🚨UPDATE🚨@hedgeyfinance has experienced security breach with their Hedgey Token Claim Contract!Total loss is around $1.9M. Attacker is funded by @ChangeNOW_io.All stolen funds are swapped to $DAI and transferred to an EOA at https://t.co/MT78LFSQ7GWe urge all users to… https://t.co/hwuBjTiebp— 🚨 Cyvers Alerts 🚨 (@CyversAlerts) April 19, 2024On-chain analytics showed that the attacker’s address was funded from web3 crypto exchange ChangeNOW, while the attacker swiftly deposited a portion of the stolen funds onto the Bybit cryptocurrency exchange.All stolen funds have been converted to $DAI and transferred to an External Owned Account (EOA).Security Alert: We\u0027re investigating an attack on the Hedgey Token Claim Contract. If you have created active claims, please cancel them using the \"End Token Claim\" button at https://t.co/Tt7Aq0n2dh.We are are actively working with our auditors and team to understand the attack…— Hedgey 🦔 (@hedgeyfinance) April 19, 2024In response to the exploits, Hedgy Finance promptly confirmed the incidents and initiated a thorough investigation into the attack on their Token Claim Contract. They advised users with active claims to utilize the “End Token Claim” feature on their platform to mitigate further risks.Hedgy Finance is collaborating with internal and external security experts to investigate the vulnerabilities exploited during the attacks and will provide further updates as new information becomes available.Crypto Hacks Decrease by Nearly 50% in March: PeckShield ReportCrypto investors enjoyed a reprieve in March as losses from hacks plummeted by nearly 50% compared to February, according to a PeckShield report.#PeckShieldAlert March 2024 witnessed 30+ hacks in the crypto space, resulting in ~$187.29 million in losses, with ~$98.8 million recovered. This marks a decrease of ~48% from February 2024.#Top5 hacks:#Munchables (#Juice affected): $97 million (recovered)#CurioNetwork: $40… pic.twitter.com/u3zejt9Ygn— PeckShieldAlert (@PeckShieldAlert) April 1, 2024While the month still saw over 30 hacking incidents, resulting in $187.29 million in losses, this marked a notable improvement from February’s $360 million. PeckShield also highlighted the recovery of $98.8 million in stolen funds.Despite the positive trend, March’s losses still exceed January’s, which saw $182.5 million disappear due to hacks. Looking at the broader picture, the first quarter of 2024 experienced a 17.5% reduction in losses compared to the same period in 2023.Data from Immunefi further revealed that hacking remains the primary method of crypto theft, accounting for 95.6% of total losses, with fraud constituting a mere 4.4%."]},"publishedDate":"2024-04-19T21:44:49"},{"id":1767676227,"title":"Veteran Trader Peter Brandt Predicts Major Bitcoin Price Action Coming Soon – Here’s the Latest","sourceUrl":"https://cryptonews.com/news/veteran-trader-peter-brandt-suggests-significant-bitcoin-move.htm","author":"Jimmy Aki","content":{"elements":["Veteran Trader Peter Brandt Predicts Major Bitcoin Price Action Coming Soon – Here’s the LatestVeteran trader Peter Brandt suggested the probability of an upward price trajectory for Bitcoin on April 18, citing recurring patterns in its market behavior. His analysis showed that Bitcoin prices tend to follow a repeating pattern, suggesting a bullish trajectory.Peter Brandt Bitcoin Price Prediction Entails Three PhasesThe seasoned trader analyzed Bitcoin’s market behavior in a thread on X, where he classified the asset into three phases: Hump-Slump, Bump-Rump, and Pump-Dump.According to the chart presented by Brandt, the current Bitcoin market has completed the first and second phases and is in the third phase.He noted that the “dump” part of the third stage had taken place while the “pump” phase was yet to materialize, suggesting a forthcoming BTC price increase.His deduction of a potential major Bitcoin price move comes amid a bearish trend in the cryptocurrency market, largely due to the news of the geopolitical tensions between Israel and Iran.Brandt’s analysis offers a potentially deeper perspective on the recent trajectory of BTC’s price, however.For instance, when Israel launched a retaliatory attack on Iran overnight, Bitcoin briefly dipped to $59K from its prior price of $63.4K before recovering to $65K. This rapid shift in trend has also fueled gains in other cryptocurrencies, indicating the possibility of an altcoin rally.Meanwhile, CryptoQuant data indicates that large Bitcoin holders (crypto whales) may have used the price dip to accumulate more cryptocurrencies at a discount.Earlier this week, Cryptonews.com reported a transfer of over 27.7K BTC ($1.75 billion) sent into accumulation wallet addresses between April 16 and April 17. This exceeded the previous record of 25,500 BTC (almost $1.6 billion) sent to such wallets on March 23, when the Bitcoin price was around $63.5K.Additionally, the impending Bitcoin halving event strengthens Brandt’s Bitcoin price prediction. The halving is designed to reduce incentives for mining new blocks, thereby slowing down the rate at which new Bitcoins are created.JUST IN: 100 blocks remain until #Bitcoin halving. pic.twitter.com/w6NkuxlqF5— Watcher.Guru (@WatcherGuru) April 19, 2024Bitcoin halving has a history of driving up the demand and price of BTC.Peter Brandt’s “Pump” Phase May Kickoff SoonPeter Brandt’s optimism for a BTC price increase aligns with market analysis insights from other experts as well, including pseudonymous trader Rekt Capital.The trader claimed that the current dip period of BTC, which is dubbed as the third or “Dump” stage in Brandt’s projection, might be the last opportunity for Bitcoin holders to purchase BTC at a relatively low value before post-halving sets in.In a post on X, Rekt Capital explained that recent BTC price movement features are similar to previous Bitcoin halving cycles, during which price declines gave way to rallies.#BTC3 Phases of The Bitcoin Halving1. Final Pre-Halving RetraceBitcoin has produced two -18% retraces prior to the Halving in the span of just over a monthIn mid-March, BTC pulled back -18% before recovering to $70000 and now in mid-April BTC has retraced -18% againThis… pic.twitter.com/2BKBQXpPOV— Rekt Capital (@rektcapital) April 17, 2024Rekt projected a “re-accumulation phase” for Bitcoin following the halving event scheduled for April 20, adding that this phase has a history of lasting over a year (385 days).Due to current market conditions, however, Rekt Capital suggested that this phase could be shorter, leading to a potential BTC price increase sooner compared to previous cycles."]},"publishedDate":"2024-04-19T21:03:49"},{"id":1156171186,"title":"Top Crypto Gainers Today on DEXScreener – RBOT, BRUNES, ALK","sourceUrl":"https://cryptonews.com/news/top-crypto-gainers-today-on-dexscreener-rbot-brunes-alk.htm","author":"Joel Frank","content":{"elements":["Top Crypto Gainers Today on DEXScreener – RBOT, BRUNES, ALKAs Bitcoin (BTC) hovers just above the $64,000 level with the issuance rate halving just hours away and most other major altcoins trade with little by way of impetus, traders are turning to on-chain crypto market monitoring tools like DEXScreener as they hunt for top crypto gainers today.On-chain markets refer to crypto assets issued and traded directly on the blockchain.Ethereum, Solana, and BNB are the most commonly used chains by those issuing or trading on-chain tokens.These on-chain markets are highly illiquid compared to centralized spot cryptocurrency exchanges or traditional financial markets.The Halving is Coming. #Bitcoin pic.twitter.com/JCD677j4Md— Michael Saylor⚡️ (@saylor) April 19, 2024That makes them highly volatile. A newly launched coin can easily see gains of 100x in days as its market cap surges from the tens of thousands to millions.Equally, a small amount of sell pressure can trigger huge price drops. And that’s not the only risk.There is virtually no barrier to entry for someone to issue their own token. That means scammers flock to the on-chain crypto markets to attempt to scam unaware investors.They can do this by inserting malicious code into the token’s smart contract creating unfair trading conditions.Alternatively, the token might be a pump-and-dump scheme. This is where the team behind a token builds up artificial hype to create demand, cashes in, and abandons ship.One popular technique is for a token’s issuer to watch the ETH in the token’s liquidity pool rise as the token’s price pumps, only to withdraw and make off with this ETH abruptly.That’s why many on-chain investors look for “locked liquidity,” which prevents such rug pull attempts.All that being said, let’s take a look at some of the top crypto gainers today in the on-chain markets.Top Crypto Gainers TodayThe newly launched Ethereum token RunesBot (RBOT) is up nearly 26,000% in the past 24 hours, as per DEXScreener.RunesBot is a telegram trading bot built to function on the soon-to-be-launched Runes ecosystem.The token’s market cap was last around $1.8 million, with just over $200,000 in locked liquidity.While it looks like a legitimate project, RBOT has a few aspects that are concerning to its smart contract.Transfers are pausable and there is a 5% buy and sell tax.Traders should always exercise caution before involving themselves in the on-chain market.Another Runes protocol-linked token called BitRunes (BRUNES) is pumping hard on Friday.As per DEXScreener, it was last up 150,000% in the past 24 hours with a market cap of $9.5 million.BitRunes allows users to bridge their Ethereum funds to the Bitcoin network through the Rune Launchpad.The token last had $520,000 in locked liquidity and has seen 24-hour trading volumes of $4.5 million.Like RBOT, it looks like a legitimate project. But like RBOT, its smart contract has concerning aspects.BitRunes has a modifiable tax and transfers are pausable. Additionally, the ownership of the token hasn’t yet been renounced.A Base launched meme coin called Alien King (ALK) has pumped hard since its launch on Friday.As per DEXScreener, ALK was last up 11,500% in the past 24 hours, with its market cap reaching $1 million.I\u0027m visiting somewhere in the earth. I will send you the secret gift if someone own ALK 👽 The King said 👑👑👑#AlienKing #ALK #Base pic.twitter.com/Fz346lG9gL— Alien King (@AlienKi_) April 19, 2024The token has locked liquidity of $244,000 and has seen over $13.3 million in volume so far.As per Go+ Security, the token has zero smart contract issues. But that doesn’t mean it isn’t a pump and dump. Traders must always be cautious and do their own research.Crypto Alternatives to ConsiderInvesting in low-cap shitcoins is a very risky strategy.An innocent-looking project could easily be a scam, and a few big sell orders could easily drive the price 80% lower.A strategy that is still risky, but arguably has a better risk reward is getting involved in crypto presales.The idea is that investors secure tokens of up-and-coming, high-potential crypto projects/protocols at a discounted early price.These projects then put those funds to work, paying for protocol development and marketing.While lots can go wrong when investing in crypto presales—unforeseen circumstances can prevent a project from delivering on its vision—savvy presale investors routinely secure gains of 10x or more.With hundreds of presale projects vying for investor funds, analysts at Cryptonews have been combing the market.Here are 19 of the presale projects with the highest potential.See the 19 Cryptocurrencies"]},"publishedDate":"2024-04-19T19:47:02"},{"id":-1193261671,"title":"Telegram to Introduce USDT Payments With Telegram Wallet and the Open Network","sourceUrl":"https://cryptonews.com/news/usdt-payments-launching-with-telegram-wallet-and-the-open-network.htm","author":"Julia Smith","content":{"elements":["Telegram to Introduce USDT Payments With Telegram Wallet and the Open NetworkEncrypted messaging platform Telegram and Tether have joined forces, enabling users to send USDT payments through The Open Network (TON) and the Telegram wallet, as formally announced by the companies’ founders on Friday at Token2049 in Dubai.USDT Payments On Telegram Via The Open Network and Telegram WalletAccording to the official announcement, Telegram users can now purchase USDT and send the stablecoin to others through TON, an independent blockchain network previously developed by the messaging app.With a user base exceeding 900 million globally, this integration could drive a surge in the stablecoin’s adoption.We are making history! TON + Telegram + Tether 🔥 pic.twitter.com/VXz4vljUHt— andrew.ton (@rogozov) April 19, 2024“We’re excited to bring USDT to The Open Network because we support its vision of an open and decentralized internet and a borderless financial system,” said Paolo Ardoino, CEO at Tether. “The launch of USDT on TON will allow seamless value transfer globally in a simple experience that can match even the traditional financial system.”Tether Launches Massive RestructuringNews of the collaboration comes amidst massive restructuring for Tether, which announced four new business divisions focused on sustainability, data, finance, and education yesterday.Tether Advances Beyond Stablecoins, Introduces New Framework Embracing Core Divisions to Foster Resilient, Future-Ready Financial SystemsRead more:https://t.co/O9ljdyaHw4— Tether (@Tether_to) April 18, 2024“Tether’s expansion beyond its well-established USDT stablecoin signifies a paradigm shift in its approach to financial empowerment,” a Thursday statement from Tether reads.“By focusing on sustainable solutions adaptive to the needs of individuals, communities, cities and countries, responsible Bitcoin mining, Artificial Intelligence infrastructure and decentralized communication platforms,” the company continued, “Tether is actively contributing to a future-proof financial and tech ecosystem.”Expanding beyond the company’s flagship stablecoin may prove to be a promising long-term strategy, given U.S. lawmakers’ recent efforts to advance legislation related to stablecoins.On Wednesday, representatives Cynthia Lummis and Kirsten Gillibrand introduced the Lummis-Gillibrand Payment Stablecoin Act of 2024. The act seeks to establish regulatory frameworks for stablecoin issuers at federal and state levels.🚨@gillibrandny and I are introducing the most comprehensive stablecoin bill to date.Crypto assets are revolutionizing the world and as the undisputed leader in financial innovation, the U.S. must embrace crypto assets, but it cannot be done without clear rules for stablecoins. pic.twitter.com/vwRUEBUdsl— Senator Cynthia Lummis (@SenLummis) April 17, 2024The proposed act would require stablecoin issuers to maintain one-to-one reserves, prohibit unbacked algorithmic stablecoins, and prevent unauthorized use of stablecoins by both issuers and users.“Passing a regulatory framework for stablecoins is absolutely critical to maintaining the U.S. dollar’s dominance, promoting responsible innovation, protecting consumers and cracking down on money laundering and illicit finance,” said Senator Gillibrand.It remains to be seen how emerging stablecoin regulation could impact Tether and Telegram’s plans for increased public use of peer-to-peer payment systems."]},"publishedDate":"2024-04-19T19:42:15"},{"id":-172633605,"title":"Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: Reuters","sourceUrl":"https://cryptonews.com/news/mango-markets-hacker-guilty-in-110m-theft-faces-20-years.htm","author":"Hassan Shittu","content":{"elements":["Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: ReutersThe Mango Markets hacker, Avraham Eisenberg, was found guilty on Thursday in a Manhattan federal court for orchestrating a scheme that resulted in the theft of approximately $110 million from the Solana-based DeFi platform.Prosecutors argued that Eisenberg orchestrated a complex exploit on the platform, leading to substantial financial losses. Eisenberg, who has been in custody since January 2023, could face a maximum sentence of 20 years in prison.Eisenberg Found Guilty of Commodities Fraud and Manipulation in Mango Markets CaseAs reported by Reuters, On April 18, a federal jury in New York found Eisenberg guilty of commodities fraud, commodities manipulation, and wire fraud in connection with the exploit, which involved manipulating Mango Markets’ native token, $MNGO.The decision followed hours of deliberations after closing arguments on April 17.Trader convicted of Mango Markets fraud in first US crypto manipulation case https://t.co/6nBaMGNZGQ pic.twitter.com/ywsFEj73B8— Reuters (@Reuters) April 19, 2024The trial began on April 9 and lasted a little over a week. Eisenberg was arrested in December 2022 in Puerto Rico.During the closing arguments on April 17, Eisenberg’s legal team contended that he had not committed any criminal acts but rather orchestrated a “successful and legal trading strategy,” resulting in approximately $110 million in gains.In contrast, prosecutors argued that Eisenberg “had to lie” to facilitate the withdrawal of funds from Mango Markets, suggesting fraudulent intent.Eisenberg\u0027s lawyer: Ladies and gentlemen, Avraham Eisenberg did not commit any crimes. He engaged in a successful and legal trading strategy. He put his own money at risk. They talked about a con man. But you know that\u0027s not the case— Inner City Press (@innercitypress) April 17, 2024Eisenberg’s lawyer, Brian Klein, asserted that his client fully adhered to Mango Markets’ smart contracts and withdrew his capital without borrowing.Additionally, Eisenberg returned $67 million worth of cryptocurrency to Mango Markets following the exploit, claiming he had legally obtained the remainder of the funds.Klein expressed disappointment at the verdict but affirmed their intention to continue fighting for their client.“We’re obviously disappointed, but we will keep fighting for our client,” he stated, indicating plans to file post-trial motions.Hacker Convicted in $110 Million Mango Markets Exploit CaseOn October 11, 2022, Mango Markets was the victim of an attack in which approximately $110 million was drained from its treasury.Shortly after the attack, Avraham Eisenberg came forward as the perpetrator, asserting that the exploit was merely a “highly profitable trading strategy” and claiming it was conducted within the bounds of legality and the protocol’s intended design.According to prosecutors, Eisenberg utilized two accounts to engage in manipulative trading involving futures contracts tied to the values of Mango’s token MNGO and the stablecoin USD Coin.These trades purportedly inflated the value of his contracts by 1,300% within 20 minutes, allowing him to borrow against his holdings and withdraw $110 million in various cryptocurrencies.Subsequently, Eisenberg agreed to return $67 million in exchange for other token holders refraining from pursuing legal action or freezing his assets.He was arrested on December 26, 2022, in San Juan, Puerto Rico, where he resided, and has remained in custody since then, deemed a flight risk by prosecutors.NEWS: Today, the CFTC charged Avraham Eisenberg with a manipulative and deceptive scheme to misappropriate more than $110 million from Mango Markets, a digital asset exchange. Read the details: https://t.co/Rj5FKu5hgn— CFTC (@CFTC) January 10, 2023On January 9, the Commodity Futures Trading Commission (CFTC) supplemented the FBI’s charges, levying two counts of market manipulation against Eisenberg.The legal ramifications continued to mount for Eisenberg as the U.S. Securities and Exchange Commission (SEC) filed charges on January 20, alleging violations of anti-fraud and market manipulation provisions of U.S. securities laws.A lawsuit filed by Mango Labs characterized Eisenberg as a “notorious online personality” with a history of attacking multiple cryptocurrency platforms and manipulating cryptocurrency markets.Eisenberg’s scheduled July 29 sentencing carries a potential maximum sentence of 20 years in prison, although the actual sentence is expected to be less severe.This verdict comes shortly after the sentencing of Sam Bankman-Fried, founder of the now-defunct FTX cryptocurrency exchange, to 25 years in prison for embezzling $8 billion from customers, highlighting increasing scrutiny and enforcement within the cryptocurrency industry."]},"publishedDate":"2024-04-19T18:40:29"},{"id":1320246865,"title":"Binance Co-Founder Says Former CEO CZ Is in a ‘Positive Situation’ Ahead of Sentencing","sourceUrl":"https://cryptonews.com/news/binance-co-founder-says-former-ceo-cz-is-in-a-positive-situation-ahead-of-sentencing.htm","author":"Hassan Shittu","content":{"elements":["Binance Co-Founder Says Former CEO CZ Is in a ‘Positive Situation’ Ahead of SentencingBinance co-founder He Yi provided insights into Changpeng Zhao’s (CZ) legal situation at a Dubai event on April 19, expressing optimism despite his upcoming sentencing in the United States.This follows CZ’s plea deal, which resulted in his departure from Binance and the company’s substantial $4.3 billion forfeiture.While there’s potential for a sentence of up to 10 years, sentencing guidelines suggest a more probable term of 12 to 18 months, with the final verdict expected on April 30.Binance Co-Founder Discusses Regulatory ConfidenceYi also addressed broader implications for Binance’s regulatory stance, emphasizing the company must take a proactive approach to fight the constant threat of regulators.Binance recently obtained its highly anticipated crypto license in Dubai, allowing the cryptocurrency exchange to operate in the country.The final requirement for the Virtual Asset Service Provider (VASP) license granted by the Virtual Assets Regulatory Authority (VARA) was that CZ relinquish his voting power in Binance FZE, the exchange’s Dubai-based unit.In November 2023, Binance agreed to pay US authorities $4.3 billion as a settlement for violating the Bank Secrecy Act and failing to adhere to Anti-Money Laundering (AML) guidelines.This settlement came after CZ pleaded guilty to violating US anti-money laundering regulations and resigned as CEO as part of the plea deal.Following Zhao’s resignation, Richard Teng assumed leadership, ushering in a new strategic trajectory. Under Teng’s guidance, Binance has undergone restructuring, including establishing a newly formed board of directors and reinforcing its commitments to operational stability and regulatory compliance.Yi also shed light on CZ’s personal life, clarifying their current relationship status. As the mother of some of CZ’s children, Yi emphasized that they are not romantic partners but good friends.Binance Progress in Spite Regulatory TightnessBinance CEO Richard Teng also recently revealed that the exchange is currently discussing several jurisdictions for a new headquarters location. However, a final decision has yet to be made.Binance is considering re-entering India’s market after having been banned there in late 2023. It would involve a $2m penalty.#Binance #India #cryptohttps://t.co/QhLPTFd9uE— Cryptonews.com (@cryptonews) April 18, 2024Binance is also reportedly considering a return to India’s market after being banned in late 2023, with plans to pay a penalty of approximately $2 million.The potential re-entry hinges on registration with India’s Financial Intelligence Unit (FIU) and compliance with relevant legislation, including the Prevention of Money Laundering Act (PMLA) and the country’s crypto taxation framework.Among its regulatory issues, Binance is also actively cooperating with Nigerian authorities following the detention of its head of financial crime compliance, Tigran Gambaryan, on accusations of laundering over $35 million.Gambaryan’s situation and that of another Binance official facing similar charges highlight the exchange’s challenges in navigating regulatory environments across different jurisdictions."]},"publishedDate":"2024-04-19T18:01:44"},{"id":2014047538,"title":"Best Crypto to Buy Now April 19 – Bitcoin, Dogwifhat, THORChain","sourceUrl":"https://cryptonews.com/news/best-crypto-to-buy-now-april-19-bitcoin-dogwifhat-thorchain.htm","author":"Joel Frank","content":{"elements":["Best Crypto to Buy Now April 19 – Bitcoin, Dogwifhat, THORChainWith the Bitcoin halving event now just hours away, investors are asking whether BTC is the best crypto to buy now.BTC’s issuance rate to miners will drop by 50% in just over 8 hours, as per nicehash.com. It will fall from the current 6.25 BTC tokens per block to 3.125 BTC tokens per block.This will reduce Bitcoin’s annual inflation rate to around 1%. In the long run, the halving will directly reduce spot market sell pressure from miners, who constantly need to sell some of their Bitcoin stash to fund their mining operations.That all sounds very bullish, and in the past, Bitcoin halvings have preceded massive run-ups in the crypto’s price.Bitcoin Halving predicted almost on 4/20 at almost 4:20pm in 42 minutes WTF. pic.twitter.com/IIk4O4EFQT— MartyParty (@martypartymusic) April 19, 2024The 2012 halving was followed by a 93x rally, 2016 by a 30x rally, and 2020 by an 8x rally.But the Bitcoin price had never rallied to fresh record highs ahead of these prior halvings. That’s not been the case this time, with Bitcoin hitting new record levels in March 2024 near $74,000.Some think the arrival of spot Bitcoin ETFs in January brought some of Bitcoin’s expected post-halving rally forward. That suggests that Bitcoin may have less room to run higher this time than in the past.Bitcoin (BTC) – The Best Crypto to Buy Now For New Investors?But even if Bitcoin was “only” able to post a 3x rally after the halving this time, that would see it reach $180,000.And the post-halving rally may have to wait a few months as these typically don’t kick in for 4-6 months. That could reflect a short-term rise in miner sell pressure while they cope with a sudden drop in revenue.Also, macro headwinds have been building recently. Strong US data and hawkish Fed speak have forced traders to price out rate cut bets lately.But Bitcoin’s long-term outlook still looks bullish. The halving event is great marketing for Bitcoin, reinforcing the narrative that it is “sound money” and akin to digital gold.Additionally, the Fed will likely cut interest rates at some point. Meanwhile, spot Bitcoin ETF demand is likely to keep acting as a tailwind. And this year’s US election will probably see a pro-crypto shift in the US regulatory landscape.The odds that Bitcoin will hit $100,000 in the coming quarters is strong. For any new investor in the crypto space, Bitcoin is definitely the best crypto to buy now.Bitcoin halving price history:2012: $12 at halving – $964 1 year later2016: $663 at halving – $2,550 1 year later2020: $8740 at halving – $55,801 1 year later2024: $63,300 at halving…This is the most bullish event.Don’t be shaken out by whales pushing price down to…— Layah Heilpern (@LayahHeilpern) April 19, 2024But for investors with a sizeable Bitcoin exposure already looking to up their risk, altcoins markets may be attractive.While Bitcoin could yet post 3x gains in this bull market, many altcoins might see even larger gains.Smaller and lesser-known altcoins are riskier than Bitcoin. However, they also offer much greater upside potential, as they are generally at much earlier stages in their adoption curves.Here are some strong performers on Monday that could also be the best crypto to buy now.dogwifhat (WIF)Solana’s top meme coin, dogwifhat (WIF), is attempting to rebound from its recent record highs on Friday.WIF was last up 19% in 24 hours, making it the best performer in the top 100 by market cap.According to CoinMarketCap, WIF’s valuation is now back over $3 billion.After WIF’s strong rebound at $2.0, a lasting recovery above $3.0 could see bullish momentum build.WIF could easily post a quick 60% upside from here as it returns to late-March record highs in the $4.80s, suggesting it could be the best crypto to buy now.THORChain (RUNE)Multi-chain DEX/bridge THORChain (RUNE) is pumping hard on Friday, last up 13% in the past 24 hours.Having recently found decent support around $4.40, the crypto is eyeing a swift recovery back towards resistance-turned-support near $7.25.THORChain Q1 Highlights: ⚡️+53% volume growth ⚡️+48% liquidity growth ⚡️+57% in savers growth ⚡️$8m collected in liquidity fees ⚡️$4.9m collected by interfaces ⚡️+$160m in lending collateral ⚡️ New features \u0026 integrationsRead the full report on Medium:https://t.co/ar3HbCX2QI pic.twitter.com/8lyyKbRFGX— THORChain (@THORChain) April 15, 2024THORChain’s modest market cap of under $2 billion suggests there could still be plenty of room for growth in this bull market. 5-10x gains could easily be on the cards, making it one of the best crypto to buy now.Crypto Alternatives to ConsiderAll of the above coins offer potential investors a great chance to make 10x gains.But, for those looking for a better probability of near-term gains, an alternative high-risk, high-reward investment strategy to consider is getting involved in crypto presales.This is where investors buy the tokens of upstart crypto projects to help fund their development.These tokens are nearly always sold cheaply, and there is a long history of presales delivering huge exponential gains to early investors.Many of these projects have fantastic teams behind them and a great vision to deliver a revolutionary crypto application/platform.If an investor can identify such projects, the risk/reward of their presale investment is very good.The team at Cryptonews spends a lot of time combing through presale projects to help investors.Here is a list of 19 of what the project deems as the best crypto presales of 2024.See the 19 Cryptocurrencies"]},"publishedDate":"2024-04-19T17:48:08"},{"id":841196256,"title":"Litecoin Price Prediction as LTC Consolidates at $80 Level – $1,000 LTC Possible?","sourceUrl":"https://cryptonews.com/news/litecoin-price-prediction-as-ltc-consolidates-at-80-level-1000-ltc-possible.htm","author":"Joel Frank","content":{"elements":["Litecoin Price Prediction as LTC Consolidates at $80 Level – $1,000 LTC Possible?As the Litecoin (LTC) price consolidates at the $80 level, some are asking whether 10x gains, or even a rally to $1,000 might be possible this crypto bull market.Bitcoin (BTC) rallied to record levels near $74,000 last month. At the same time, Litecoin was only able to rally to highs just above $110 this month.That left it still down around 73% versus its December 2017 record highs at $420. But in light of the latest market dip, the Litecoin price is closer to 80% down from all-time highs.Compare that to Bitcoin, which was last down by only around 14% since last month’s record peaks. BTC was last changing hands in the mid-$63,000s.To be fair to Litecoin, it’s not the only major altcoin that remains a long way below record levels.Solana (SOL) is still down 45% versus its 2021 record peaks. And XRP (XRP) and Cardano (ADA) are down around 85%.Bitcoin has been able to recover back to record levels ahead of other coins given bullish narratives such as the approval of spot Bitcoin ETFs, the fact that it faces a favorable regulatory environment worldwide, and the growing idea that it is “digital gold” and therefore a great safe-haven asset and hedge against currency debasement.Litecoin’s Narrative ProblemLitecoin, by comparison, is suffering from a significant narrative problem. That is to say, while Litecoin has a lot going for it, it lacks narrative momentum.Litecoin is attempting to position itself as the “digital silver” to complement Bitcoin as “digital gold”. Thanks to its fair launch (a Bitcoin fork) and high level of decentralization, Litecoin is one of the only cryptocurrencies besides Bitcoin that global regulators widely agree is not a security, meaning it also faces a friendly regulatory environment worldwide.And its blockchain is much faster and cheaper than Bitcoin and able to bare a much higher load.Despite only ranking as the 19th largest crypto by market cap, LTC is the leader in crypto payments.https://t.co/NYpNlhtF0x— Litecoin (@litecoin) March 15, 2024But the cryptocurrency’s continued adoption as a medium of payment, its intended use case, is failing to lift its price.Indeed, on-chain data this week revealed that a record-high 62.5% of Litecoin investors now qualify as HODLers.\u0027On-chain data shows that Litecoin’s long-term holders have achieved a new record: 62.5% of all $LTC investors now qualify as these HODLers.\u0027 – @bitcoinist https://t.co/MZVFrEHLJ2— Litecoin (@litecoin) April 16, 2024Litecoin Price Prediction – Can LTC Hit $1,000?Record high Litcoin HODLing suggests a lack of retail investor interest in the cryptocurrency. Broader use amongst retail and short-term investors is a key part of a cryptocurrency’s adoption.And an influx of new short-term investors will be needed for the LTC price to drive higher.But the lack of participation by retail/short-term investors is a strong bottom signal for the Litecoin price.The HODLers who now dominate the LTC market are much less likely to sell their coins. The transfer of holdings from weak-handed short-term/retail investors has seemingly already taken place.The bull market in Bitcoin and many other cryptos is well underway. At some point it is likely to bleed into LTC in a more meaningful way.At such a cheap valuation below $100 and with a market cap of $6 billion, Litecoin has a strong risk-reward.Calling a more than 10x rally to $1,000 per token is a big call. Narratives surrounding Litecoin would have to gain a lot more traction.But Litecoin stands a very good chance of posting 5x gains to challenge record highs above $400.Fun Meme Coin Alternative to Consider – Dogeverse (DV)Litecoin offers the prospect of 5x potential gains this bull market.But some traders wish to take bigger risks for bigger potential upside. They should look no further than the meme coin market.New meme coins are popping up all the time. Most never gain traction. But those that do can post huge gains of 100x or more.One fun new meme coin that comes backed by compelling cross-chain bridging technology is Dogeverse.The new meme coin presale has already been able to attract north of $7.5 million from early investors and will soon sell out.Another incredible achievement unlocked for #DOGEVERSE! 🚀Exceeding the $7,500,000 milestone already! 💸Cosmo is over the moon! 🐾😄Way to go, #DOGE enthusiasts! 🌠 pic.twitter.com/jAZ7xZjkjw— DogeVerse (@The_DogeVerse) April 19, 2024Dogeverse has been attracting a lot of hype on social media in the run-up to Doge Day on 20 April.Dogeverse is launching on the six most used blockchains, excluding Bitcoin, with multi-chain bridge capabilities.There are a host of chains out there vying to be the go-to destination for meme coin launches–but Dogeverse plans to fit the bill by being present on all chains that matter.Dogeverse is already live on Ethereum, BNB Smart Chain, and Polygon but has Solana, Base, and Avalanche in the works for launch day. This multi-bridge utility is a massive expansion to the power of the Doge universe.🌌 Embarking on a journey through the #DOGEVERSE, the pioneering multi-chain #Doge #Token, inspired by #Cosmo\u0027s epic adventures. 🚀Leading in #Blockchain connectivity, uniting diverse #Crypto communities with Doge memes and a vision of a unified ecosystem across chains! 🌍 pic.twitter.com/Woe1wYvxqh— DogeVerse (@The_DogeVerse) April 16, 2024Dogeverse is doing something no other meme coin has attempted. There are multi-chains already, but none are as expansive and interconnected as Dogeverse plans to be.The new crypto presale Dogeverse is inserting itself into the narrative of the quickly growing opportunity of meme coins being spun up on multiple chains.Keep in touch with developments on the project’s X/Twitter and Telegram.Visit Dogeverse Here"]},"publishedDate":"2024-04-19T17:06:49"},{"id":416495584,"title":"Bitcoin’s Fourth Halving Imminent: Less Than 100 Blocks Away – Here’s What Happens Next","sourceUrl":"https://cryptonews.com/news/bitcoins-fourth-halving-imminent-less-than-100-blocks-away-heres-what-happens-next.htm","author":"Thomas Musgrave","content":{"elements":["Bitcoin’s Fourth Halving Imminent: Less Than 100 Blocks Away – Here’s What Happens NextBitcoin’s fourth halving event is imminent and will occur just after midnight UTC on April 20 (8 pm ET today), which will reduce the block subsidy reward for miners from 6.25 BTC to 3.125 BTC per block, potentially impacting the cryptocurrency’s price and mining operations.Bitcoin halvings occur automatically every 210,000 blocks or approximately every four years.To understand the importance of this event, let’s examine previous halving events and their historical impact on the industry.A Look Back at Previous Bitcoin Halving EventsBitcoin halving events have historically contributed to major Bitcoin price rallies.Bitcoin’s protocol has mandated three halving events thus far, gradually decreasing the block reward for miners from 50 BTC to 25 BTC in 2012, then to 12.5 BTC in 2016, and most recently to 6.25 BTC on May 11, 2020.The 2024 halving event will see the subsidy reward for miners on the network drop from 6.25 BTC to 3.125 BTC per block. In the long term, only 21 million Bitcoins will exist.What comes after 2024’s Halving Event?Bernstein predicts that Bitcoin will continue on its bullish path after the halving event and could reach $150,000 by the end of 2025.Coinify CEO Rikke Staer warned about #Bitcoin sales after halving in the @TheBlock__ interview.☑️ He attributed his expectations to the strengthening presence of institutional investors and the increased experience of retail investors ☑️ \"Historically, the main growth after… pic.twitter.com/iaVrCAQ8qj— Web3_Vibes (@W3Vibes) April 18, 2024However, Coinify’s Rikke Staer believes that the halving event is a “sell-the-news” event as less efficient miners may need to sell their existing BTC holdings, which could potentially create sell pressure.While Bitcoin miners have profited this year, the extent the halving will impact less efficient mining operations has yet to be determined.Bitcoin’s price is hovering around $64,500 as of writing, representing a 1.33% increase over the past 24 hours, as reported by CoinMarketCap.Bitcoin’s price fell below $60,000 earlier today amid reports of Israeli missiles hitting a site in Iran but has rebounded strongly since."]},"publishedDate":"2024-04-19T17:06:30"},{"id":-1913990148,"title":"SEC Reworks Justin Sun Tron Lawsuit, Claims Founder “Traveled Extensively”","sourceUrl":"https://cryptonews.com/news/justin-sun-tron-lawsuit-edited-after-trn-foundation-founder-tries-to-dismiss-claims.htm","author":"Julia Smith","content":{"elements":["SEC Reworks Justin Sun Tron Lawsuit, Claims Founder “Traveled Extensively”The United States Securities and Exchange Commission (SEC) has edited its Tron lawsuit against Justin Sun and his crypto companies, Tron Foundation, the BitTorrent Foundation, and Rainberry, following his attempted dismissal of the litigation late last month, amended court docs filed on Thursday reveal.Tron Lawsuit Edited After Justin Sun’s Attempted DismissalIn the updated court filings, the SEC claims that the Tron founder “traveled extensively” to the U.S. throughout “his work on behalf of the Tron Foundation, the BitTorrent Foundation, and/or Rainberry.”Big news in the crypto world! SEC revamps lawsuit against Tron founder Justin Sun for alleged sale of unregistered securities via Tron and BitTorrent tokens. Sun denies allegations, challenging SEC\u0027s jurisdiction. Complex legal battle ahead in the cryptocurrency industry.— Kelvin Zinck (@KelvinZinck) April 19, 2024The original lawsuit alleges Sun and the aforementioned crypto entities broke federal law by offering and selling unregistered securities in the form of Tronix (TRX) and BitTorrent (BTT).In his March dismissal, Sun largely argued that the federal agency was overstepping its authority in attempting to prosecute him, citing jurisdictional overreach.“The SEC is not a worldwide regulator,” lawyers for Sun wrote in the March 28th dismissal. “Its efforts to leverage highly attenuated contacts to the United States, to extend U.S. securities laws to cover predominantly foreign conduct, go too far and should be rejected.”In addition to Sun, several notable celebrities including Lindsay Lohan, Jake Paul, and Austin Mahone, were charged “for illegally touting TRX and/or BTT without disclosing that they were compensated for doing so.”SEC Presses Forward with Crypto CrackdownThe SEC’s amended lawsuit against Tron arrives amidst growing criticism of its “regulation-by-enforcement” approach to the crypto industry.Critics argue that the SEC has failed to establish a clear regulatory framework for cryptocurrencies, opting instead to pursue legal action against key industry players.Sun’s March dismissal motion challenges the SEC’s jurisdiction and asserts that neither TRX nor BTT qualify as investment contracts or securities.Under Chair Gary Gensler, the SEC has pursued lawsuits against major crypto entities like Coinbase, Ripple, and Binance, alleging violations of federal securities laws.Coinbase recently attempted to dismiss its case, arguing that the SEC’s claims regarding selling unregistered securities exceed the agency’s authority.However, U.S. District Court Judge Katherine Polk Failla ruled in favor of the SEC, allowing the lawsuit to proceed.And we’re not done.On our agenda: further equity market structure rules and additional cybersecurity rules, among others.— Gary Gensler (@GaryGensler) April 17, 2024Despite mounting pushback, the commission shows no signs of slowing down. In a recent X post, Gensler outlined the SEC’s ongoing agenda, which includes further equity market structure rules and additional cybersecurity regulations."]},"publishedDate":"2024-04-19T16:33:14"},{"id":143785089,"title":"Discover Why Crypto Whales Are Quietly Stocking Up on This GambleFi Token for the 2024 Bull Run","sourceUrl":"https://cryptonews.com/news/discover-why-crypto-whales-are-quietly-stocking-up-on-this-gamblefi-token-for-the-2024-bull-run.htm","author":"Tim Hakki","content":{"elements":["Discover Why Crypto Whales Are Quietly Stocking Up on This GambleFi Token for the 2024 Bull RunA new ICO for Solana GambleFi token Mega Dice (DICE) started this week and it has already raised over $350,000 in just a few days of launching, according to an announcement on Mega Dice’s X account.The ICO began on Wednesday, and within 24 hours it had already netted a whopping $300,000. Early support came strong because Mega Dice has already established itself pretty well in the world of GambleFi, aka crypto casinos.It launched last year as the world’s first licensed crypto casino accessible through the popular messaging app Telegram.This week’s launch of the DICE token ratchets Mega Dice’s services to a whole new level. Being the platform’s native token, players can use it as casino chips, to fund games and receive payment, with some games requiring the token.DICE will serve as a funding and payment token on Mega Dice’s platform, with certain games requiring the token to play,Why GambleFi Bettors Fans Are Watching Mega DiceMega Dice has a staggering array of games for the casual player. The website currently offers over 4,500 games, including classic staples like slots, roulette and blackjack, in addition to a bookmaker.DICE has a hard supply cap of 420 million tokens, with 35% allocated to the presale, which can be accessed via the official website, where the token sells at a current fixed price of $0.069 per coin. This is the cheapest price investors can purchase it for in the ongoing presale.The token can also be staked to earn passive income, with 10% of the total supply earmarked by its progenitors for staking rewards.This indicates to early investors that DICE is a token from a well-established brand with strong fundamentals and utility.It shows promise for significant near-term growth as it integrates into the casino’s loyalty program, offering more generous rewards to native token users and access to competitions for lifestyle prizes and experiences.The casino has also announced a buyback and burn programme, which will reduce the supply, increasing scarcity and potentially pumping value.The DICE AirdropFinally, there will be a $2.25 million airdrop across three seasons of $750,000 each, including early bird bonuses, limited edition NFTs, and a referral program that gives people a 10% cut of the initial investment of any gamer they refer to the casino.The Mega Dice casino currently has around 50,000 players. Meanwhile, the sportsbook offers live streams of the most popular games in over 50 sports and esports, with average collective monthly wagers at $50 million between some 10,000 monthly active users.So, in short, the reason why investors love Mega Dice so much at the minute is because it offers clear direction, impressive fundamentals and multiple ways to increase wealth.Stay in touch with Mega Dice token ($DICE) news and developments on X/Twitter and Telegram.Don’t miss out.Join the presale now on the website."]},"publishedDate":"2024-04-19T16:09:07"},{"id":-360731975,"title":"Pepe Holders Are Moving Their Investments to a New Bitcoin Project – What’s Behind the Shift?","sourceUrl":"https://cryptonews.com/news/pepe-holders-are-moving-their-investments-to-a-new-bitcoin-project-whats-behind-the-shift.htm","author":"Joel Frank","content":{"elements":["Pepe Holders Are Moving Their Investments to a New Bitcoin Project – What’s Behind the Shift?As Pepe (PEPE) consolidates within recent ranges following its ugly sell-off last week, Pepe holders are moving their investments to an exciting new Bitcoin project called 99Bitcoins (99BTC) as they hunt for exponential gains.At current levels around $0.0000052, PEPE is down over 50% from its March highs. The meme coin dumped last week amid a widespread altcoin sell-off that was catalyzed at the time by geopolitical tensions.A bearish break below a pennant structure then triggered a wave of technical selling, exacerbating the drop.Strong US data and hawkish comments from Fed policymakers has since blocked a recovery. When expectations for Fed rate cuts fade, this is a headwind for liquidity and interest rate-sensitive assets like crypto.Despite this, the largest non-Shiba Inu dog-themed meme coin is still up 4x since the start of the year.But, amid concerns that the meme coin may have already seen its best days, some Pepe holders are diversifying.One project that is likely catching their attention is an exciting new Bitcoin project in the learn-to-earn (L2E) space, 99Bitcoins. Bitcoin is very much in focus right now thanks to the imminent halving.New Bitcoin Project 99Bitcoins Launches Exciting – Future L2E Leader?99Bitcoins produces courses to help investors make their first steps into the crypto space. It currently has over 100,000 enrolled students.Moreover, 99Bitcoin’s YouTube channel has over 700,000 subscribers and mailing list has nearly 3 million members. Already a household name in the crypto education space, 99Bitcoin’s is taking its web3 involvement to the next level.99Bitcoins is launching a new L2E token ($99BTC) that is designed to reward individuals for learning about cryptocurrency.The classic 99Bitcoins platform is integrating with BRC-20 to pioneer the L2E model on the Bitcoin blockchain.$99BTC is currently available in an exciting presale that has already raised more than $500,000 in one week.Crypto experts are already coming out of the woodwork as early birds in this project ahead of a potential listing.Jacob Crypto Bury thinks the innovative L2E token could present a 10x investment opportunity.Check Out $99BTC HereHow Does The 99Bitcoins’ Platform Work?99Bitcoins uses a blend of gamification and a leaderboard reward system to pay out rewards for engagement. The idea of “learn-to-earn” rests on the simple premise that users will be incentivized to learn more if learning bears tangible (spendable) benefits.The gamification aspect comes about through various different learning resources, like interactive learning modules, quizzes, and tutorials. Successful completion of these challenges raises a users’ 99Bitcoins rankings. The higher the ranking, the greater the payout.Users unlock more courses as they progress through the exercises, which means more rewards in a self-motivating and immersive experience that stays engaging and enjoyable for users of all levels of crypto knowledge.For today’s highly switched-on and video game and smartphone palming generation, it’s more familiar than textbooks.99Bitcoins platform will offer comprehensive curricula on various topics at all levels, from wallet basics and how-to guides all the way through to trading signals, strategies, trends, and technical knowledge.Exciting L2E Bitcoin Project $99BTC – 2024’s Best Crypto Presale99Bitcoins is making 10.5% of the supply of its $99BTC token available to early investors in the presale.Tokens are currently up for grabs for $0.00101, giving the token a current market cap of under $100 million.Given 99Bitcoins’ huge community and potential to become a leader in the fast-growing L2E space, that could be a bargain.14% of the token supply is being reserved for staking rewards. That means that early $99BTC investors not only have the opportunity to benefit from price appreciation, but also passive income.APYs for presale investors are currently sat at an insane 4,000%, according to 99Bitcoins’ official X account.🌟 Over 252 million $99BTC tokens are currently staked on our platform!Don\u0027t miss out on our impressive APY of over 4000%. Stake now and earn passive rewards! 🚀Start staking: https://t.co/NXD7DAamqr#99Bitcoins #Presale #BTC #Bitcoin pic.twitter.com/0eGEN5lgTs— 99Bitcoins (@99BitcoinsHQ) April 18, 202427.5% is being reserved for project funds, 23% for marketing, 8% for liquidity and 17% for community rewards.Readers can learn more about $99BTC by checking out the whitepaper.99 Bitcoins Airdrop and Giveaway99Bitcoins is currently running a massive airdrop of $99,999 worth of Bitcoin (BTC). This will go to 99 early supporters who follow the instructions on the official website.🎉 #99Bitcoins Airdrop Reminder! 🎉We\u0027re giving away $99,999 in $BTC! Be one of the 99 lucky winners to share this massive prize.Follow the link below and complete the task to enter. It\u0027s that simple! 🚀Join now: https://t.co/ZXji0s6ACe#99Bitcoins #Airdrop #Presale pic.twitter.com/7WulU2RKIx— 99Bitcoins (@99BitcoinsHQ) April 18, 2024In addition to the airdrop, there is a giveaway, according to an announcement on the platform’s X/Twitter.The protocol is collectively rewarding three participants with $9,999 worth of Bitcoin for either following, retweeting, or signing up on the website.The 99Bitcoins mobile app is available for download on Google Play and App Store, keeping users up-to-date on all the latest crypto prices and news.So, with Bitcoin leading the news cycle through April and beyond, there will likely be many new BTC neophytes in the coming months.What better incentive to learn about Bitcoin through expert learning materials than to get paid for it?Visit 99Bitcoins secure presale website ahead of Bitcoin’s halving.Buy 99BTC Here"]},"publishedDate":"2024-04-19T16:07:20"},{"id":-592644201,"title":"Galactic Group Launch AAA Web3 Play-to-Own Game Publisher With World-Class Talent","sourceUrl":"https://cryptonews.com/news/galactic-group-launch-aaa-web3-game-publisher.htm","author":"Harvey Hunter","content":{"elements":["Galactic Group Launch AAA Web3 Play-to-Own Game Publisher With World-Class TalentGalactic Group to launch AAA Web3 game publisher in the United Arab Emirates (UAE) with the backing of world-class talent from Hollywood and the gaming industry.The recently established business, known as Galactic Entertainment Publishing, is the first division of parent company Galactic Group.It is the brainchild of industry visionary Loren Roosendaal, who intends to redefine the gaming space as one of the world’s first play-to-own publishers, elevating Web3 gaming to Triple-A status.A goal that is not without support, bringing together renowned talent from the gaming and movie industry, including co-founder and former Head of Disney’s AAA Studios Mark Meyers.Planet Quest – Galactic Group’s First TitleThe first installment in this vision, Planet Quest, has been in development since 2022 – and has already drawn in a crowd with an invested fanbase.“PlanetQuest passport holders account for over 300,000 connected wallets, over 200,000 of which hold one or more PlanetQuest NFTs.”The team behind it draws from the experience of former employees of Epic, Disney, Warner Bros., and Activision-Blizzard. Their credits represent a range of franchises, spanning AAA games like Fortnite, Call of Duty, and Star Wars: Jedi Survivor to films like The Batman, Avengers, and Blade Runner.However, the team went far beyond the studio, with the involvement of the game’s fanbase having a significant impact on its development.Over 250,000 fans have co-created the storyline and lore of the Star Wars-esque franchise, culminating in an accompanying trilogy of books, comics, and another game to be revealed later, according to a report from VentureBeat.This has resulted in a real community with genuine investment in the product, born out of their shared passion, rewarded with in-game assets for their engagement.“Naturally no first attempt at something new is perfect, but it’s been amazing getting to create a sci-fi universe with the fans in a way that’s never been attempted before. I’ve gotten to fulfill a lot of my childhood dreams, working on Star Wars, Blade Runner and Marvel movies to name a few, but there’s little that compares to being able to interact and build with the fans from day one,” comments Chief Creative Officer Jon McCoy.The Play-to-Own RevolutionPlay-to-own titles leverage blockchain technology and develop non-fungible tokens (NFTs) to provide users with full ownership of in-game assets, such as characters, items, or land.Something that Co-Founder Mark Meyers has attributed to the community built behind the project.“Involving the community early on and rewarding them for their participation with in-game goods that they actually own benefits publishers, developers and players, by reducing publisher ad spend, providing the feedback developers need and getting the players better games,” said Meyers.Cracks are emerging in the dominant Free-to-Play model of today. The publishing costs of games are increased by spending tens of billions of dollars on advertising to draw in new players. These costs are then passed on to players through progressively more costly in-game purchases.Something Roosendaal seeks to correct, saying “It’s crazy to think that players are spending over $100 billion and 100’s of hours of their spare time each year, gathering in-game items they don’t actually own.”This may just be what the gaming community needs. Increasingly present monetization has caused the gaming industry to stray away from consumer engagement in favor of profits.Dominant publishers are churning out products designed to rinse players of their money and be discarded with annual releases, forcing those committed to the franchise into a worthless gameplay loop.Play-to-earn is the solution; community-driven decisions and ownership will become the new standard for global entertainment, establishing a transactional relationship between the publisher and the player rather than a parasitic one."]},"publishedDate":"2024-04-19T15:18:47"},{"id":-1780107105,"title":"Andreas Brekken, Founder of SideShift.ai, on Bull Run, Meme Coins, and Ethereum Sharding | Ep. 327","sourceUrl":"https://cryptonews.com/exclusives/andreas-brekken-founder-of-sideshift-ai-on-bull-run-meme-coins-and-ethereum-sharding-ep-327.htm","author":"Sead Fadilpašić","content":{"elements":["Andreas Brekken, Founder of SideShift.ai, on Bull Run, Meme Coins, and Ethereum Sharding | Ep. 327Andreas Brekken, the founder of SideShift.ai, a platform offering direct-to-wallet trading, sat down (in his hammock) for an exclusive interview with the Cryptonews Podcast.Talking with host Matt Zahab, Brekken recalled how difficult it was for people to buy BTC in 2011, noting that the ease of purchase today contributes to its adoption.He remarked that meme coins are actually great for the crypto space because they are fun, cheap to get, and generally harmless. Importantly, they are stress-testing the biggest chains in the sector.The crypto veteran talked about multiple markets happening simultaneously and the potential significance of the Ethereum Dencun upgrade.Brekken also touched upon the necessity to re-examine our interaction with centralized exchanges and the need for services like SideShift.In this interview, Brekken discussed:Brekken gave a wide-ranging exclusive interview, which you can see above or read below.How the Bitcoin Times Have Changed!Brekken discovered Bitcoin in 2011.At that time, he said, there were very few routes for people to get BTC. One option was dark web markets, including the infamous Silk Road.“But in my case, I’m just too much of a nerd,” Brekken remarked. He didn’t know about this avenue at the time.But he had an advantage over an average Joe: he was a programmer.Therefore, Brekken discovered information on BTC online and started learning about the novel technology.Notably, at the time, anyone interested in BTC needed to install a program on their PC to get it. This program would create addresses and allow users to find a place to buy the coin, receive it, and send it.This was obviously a much more difficult system than what we have today.But Brekken said another advantage a programmer or engineer would have at the time is the way they view and think of technology.They seek to understand how it’s made and how they can build upon it. They’ll to to find a way to improve it, create something similar, find another use case, etc.Not every shiny coin on social media will lead to generational wealth.AI recommends DYOR and safe trading.Good job! 🎈 pic.twitter.com/q4O0SXuMFO— SideShift.ai – Direct to Wallet Trading (@sideshiftai) March 24, 2024Direct-to-Wallet Trading: Recipe for Mass AdoptionAnd this is how SideShift.ai was created. There was a way to make a piece of tech that would help fulfill a demand, and Brekken went for it.The team developed an efficient, easy-to-use, newcomer-friendly platform that offers direct-to-wallet trading.When one uses a centralized crypto exchange, there are many steps to complete before finally getting the coins.This includes all the necessary log-ins, 2FA, KYC, choosing the deposit, finding the network, waiting for confirmations, and so on, says Brekken.However, it can get more complicated in certain cases, such as buying a specific meme coin. For example, the user needs to trade BTC for UDTS first before getting WIF.SideShift.ai performs the trade immediately and delivers the coins to the wallet, the founder said.// USD WEEKLY SHIFT VOLUME – APR 9 TO 15 //SideShift recorded a gross weekly volume of $22.9m alongside a SHIFT count of 11,669 shifts. These figures combined to produce healthy daily averages of $3.3m on 1,667 shifts. pic.twitter.com/8urons5elK— SideShift Research (@XAIResearch) April 19, 2024“That’s why we call it direct-to-wallet trading because it’s the only way I know to explain that you don’t have to click 700 buttons in order to do something as simple as just going from what you have to what you want.”There was lots of demand for this service, he added.But speaking of exchanges, Brekken gave a warning: take your funds out.The more long-term view for this industry is that people need to stop leaving their money on exchanges. It’s a huge problem, he said.Simply said, the incentives are not aligned between the user and the exchange.The exchanges have full control over users’ funds and make money off of it.Also, they may use the funds without telling users, be attacked, do a rug pull, etc. There are too many red flags.Oui oui! SideShift about to be available directly in the Ledger wallet https://t.co/ytGDcUxwHN— Andreas (@abrkn) April 16, 2024AI In Name OnlyBrekken briefly touched on the ‘AI’ part in ‘SideShift.ai.’“I’m going to be completely honest with you,” he said, “I just thought it sounded really awesome.”The closest the company will get to an actual AI is the amount of automation they’ve done.The company has a small team of people who deal with “quite a lot of volume.”Yet, they keep everything smooth and stable thanks to “excessive automation internally,” Brekken said.There’s very little human intervention, he added. “It’s like a giant machine” running nearly everything.AI advises HUMANS to do their own research to be confident in their financial journey.ATTACHING: Meme for motivationGood job! 🎈 pic.twitter.com/eRli2v5Iw1— SideShift.ai – Direct to Wallet Trading (@sideshiftai) April 13, 2024However, when talking to customer support, the team “makes it a bit confusing” for people to know if they’re talking to a human, a machine, or a machine pretending to be human.“More likely, you might be talking to a human pretending to be a machine,” Brekken said.And speaking of the team, the founder noted that SideShift.ai is currently hiring for a number of roles, especially engineers.Meme Coins Are Stress-Testing Major ChainsCommenting on the ongoing meme coin craze, Brekken said that he himself was “really into” Dogecoin when it launched in 2013.Looking at the craze now, “It was the exact same thing back when there was only Dogecoin, but obviously, this is on steroids.”There are many more of these coins now, many more communities, and more people involved – even those outside the crypto space. It’s difficult to visit a café without overhearing a conversation about WIF or BONK, Brekken remarked.But, generally speaking, meme coins are beneficial for the space, Brekken remarked. “I think it’s good in many ways that people are trading meme coins,” he said.He argued that these coins create fun for friends and communities, that they are harmless, and also an excellent way for people to enter crypto.Bitcoin’s $60,000-$70,000 price tag can be intimidating for newcomers. Once bought, there’s also a lot to lose.But with meme coins, it’s a lot easier to afford and trade them.Degens need something to gamble on, and the shiny new things are memecoins. 🤡Catch all of the PvP action, hot takes and more in this week\u0027s spicy newsletter!Read it now: https://t.co/dmEDPBMuyr pic.twitter.com/289DdZ9819— Shitcoin.com (@ShitcoinDotCom) March 23, 2024And this space is growing as well. Now, users have more advanced tools at their disposal trading BONK than they do trading Apple shares, Brekken argued.Additionally, trading meme coins is potentially becoming a competitor to another giant: sports betting.“It’s quality fun with your friends,” Brekken said.Lastly, but importantly, all this activity is stress-testing the technology, specifically the chains these tokens reside and move on.Solana and Ethereum, in particular, are being stress-tested. Different chains are competing. They must work hard not to fall behind and lose users.“I will bet you, [the developers] are all working day and night on all these platforms and chains […] to just keep this running and to try to find ways to deal with this record-level high demand for throughput and capacity,” Brekken said.Multiple Parallel Markets At WorkAnother exciting point Brekken made is that we currently seem to be witnessing multiple markets happening simultaneously.Previously, we’d see one sector at a time significantly rising above others, each with its own cycle.For example, in the last cycle, there was a decentralized finance (DeFi) summer that turned into a Solana summer. This gradually shifted into a “mania” centered around FTX, and so on.Today, however, we’re seeing the spot Bitcoin exchange-traded funds (ETFs) taking off, the meme coin market continuation, and a new DeFi wave.It also seems like these three have separate risks and somewhat separate users, Brekken opined.Don\u0027t be a piggy in the fight between bulls and the bears.Plan your trades wisely. Good job! 🎈 pic.twitter.com/WSm848Yp9V— SideShift.ai – Direct to Wallet Trading (@sideshiftai) April 13, 2024That said, he hopes that the meme coin cycle will continue to attract more newcomers to the space and encourage users within other cycles to explore other crypto-related markets.The bull market has been “creeping up on us since the desperation we all felt” when Bitcoin was $20,000-$25,000.Therefore, Brekken hopes the three different cycles will affect each other positively and prolong this bull run.“If you’re still alive with a good-looking meme coin portfolio [by the end of summer], I think you are a genius,” he added.Ethereum Dencun Upgrade and Path to ShardingLastly, Brekken briefly discussed certain developments in the space, including the Ethereum Dencun upgrade, which went live in March.The upgrade aimed to significantly boost the Ethereum ecosystem, reduce Ethereum layer-2 blockchain transaction fees, and pave the way for sharding in the future, which will finally lower Ethereum’s high layer-1 fees.What surprised Brekken about these Ethereum upgrades is that everybody connected to the Ethereum ecosystem, including other chains, was fully ready at the moment the update went live.This is a positive development.There is no longer a need to develop separate software for several years to support an upgrade. These are instantaneous now.Another notable thing is the ongoing talk about sharding.Deep dive on Ethereum\u0027s sharding roadmap from @Delphi_Digital. It\u0027s very good! https://t.co/oiTEqLFXGx— vitalik.eth (@VitalikButerin) May 27, 2022Sharding is a solution that optimizes the process of verifying transactions and smart contracts by splitting the blockchain network into partitions called shards.This way, every node does not need to review the entire transaction history on the network.Instead, specific nodes are assigned to specific shards, optimizing the process of nodes verifying transactions.This, said Brekken, has the potential to send ETH to $5,000.Therefore, the upgrades we’re seeing now are the developers gradually building a path towards sharding. Brekken said it’s a large project that will likely take a few years to complete.__________Andreas Brekken is the founder of SideShift.ai, a platform offering direct-to-wallet trading. To date, the exchange has processed over $1.25 billion in volume.Brekken first discovered Bitcoin in 2011 and has a deep technical understanding of the cryptocurrency space.In addition to being a long-term crypto supporter, he has substantial hands-on industry experience.In 2013, he founded Justcoin.com, a Norway-based cryptocurrency exchange (later acquired by ANX INTL), and then worked as a software engineer at Kraken in 2015 and 2016.Brekken is also the founder of Shitcoin.com, a wide-reaching crypto content platform."]},"publishedDate":"2024-04-19T15:15:25"},{"id":718968130,"title":"$SNUKE Meme Coin Launches On Solana – Could This Be the Next BOME?","sourceUrl":"https://cryptonews.com/news/snuke-meme-coin-launches-on-solana-could-this-be-the-next-bome.htm","author":"","content":{"elements":["$SNUKE Meme Coin Launches On Solana – Could This Be the Next BOME?As the cryptocurrency market prepares for the Bitcoin halving, which historically triggers significant gains. A new meme coin called $SNUKE is preparing to capitalize on the hype to make its debut on the Solana blockchain.Introducing $SNUKE, the latest meme coin set to make waves on the Solana blockchain, aspiring to become a major player in the meme coin arena.Why $SNUKE and Why Now?Meme coins on Solana aren’t just catching on; they’re booming, quickly raising millions and reaching multi-billion dollar valuations. This vibrant activity underscores Solana’s thriving ecosystem, making it a prime location for innovative projects like $SNUKE.How to Get InvolvedThe Pre-Sale will have a 25 days duration, all Solana Memers are free to join with no restrictions on the minimum or maximum amount that can be purchased. This open approach ensures that $SNUKE coin is accessible to everyone, from small-time hobbyists to serious investors.Following the Pre-Sale, $SNUKE tokens will be airdropped to participants and listed on Raydium and on Centralized exchanges.Why $SNUKE Could Be the Next Big HitGiven the remarkable success of other meme coins on Solana like BOME, WIF, SLERF, SLOT etc. $SNUKE is poised to follow in the footsteps of giants, offering an unmissable opportunity to be part of the next big surge in the meme coin trend.Don’t miss out on $SNUKE’s Pre-Sale which starts on Thursday 25th of April. Be a part of the next major meme coin success story on Solana.Join the $SNUKE CommunityGet ready for the launch and join the vibrant $SNUKE community on platforms like Telegram and Discord.Stay updated with all the latest announcements, including the much-anticipated Pre-Sale beginning on Thursday 25th April, 2024.Website: https://snuke.wtfTwitter: https://twitter.com/SnukeCoinTelegram: https://t.me/snukecoin"]},"publishedDate":"2024-04-20T02:10:26"},{"id":804514593,"title":"Countdown to Bitcoin Halving, Quant \u0026 AI Altcoin Expected to Excel","sourceUrl":"https://cryptonews.com/news/countdown-to-bitcoin-halving-quant-ai-altcoin-expected-to-excel.htm","author":"Matt Williams","content":{"elements":["Countdown to Bitcoin Halving, Quant \u0026 AI Altcoin Expected to ExcelChaos has taken over the cryptocurrency space as we move closer to Bitcoin’s (BTC) April 19 halving event. Investors haven’t seen the considerable growth many analysts predicted would occur leading to its halving event.Instead, BTC’s price has pulled back considerably since traders set an all-time high (ATH) at $73,750 on March 14. Bitcoin’s recent correction lowered prices to the $60,000 support level, leading to a massive decline in investor confidence. Some analysts blamed the recent price drop on miners selling off their tokens before the halving event.While investors are now uncertain about what direction BTC’s price will trend after its halving event, InQubeta (QUBE) investors are feeling extremely bullish as tokens launch on Uniswap (UNI) and MEXC after its initial coin offering raised over $13.6 million. Early investors have already accrued 300% returns, and the party is just getting started as some analysts believe prices will surge by over 10,000% before the year ends.Emerging crypto InQubeta (QUBE) offers BTC investors an opportunity to earn back some of their profitsInQubeta has emerged as the world’s first crowdfunding crypto that gives everyone access to artificial intelligence (AI) investment opportunities. The entire ecosystem revolves around InQubeta’s native currency and governance coin, QUBE.QUBE is a deflationary ERC20 coin with a 1.5 billion supply limit and burn taxes that further cut down the supply. The small token supply encourages long-term price growth as its market capitalization grows. QUBE would be worth more than a dollar once its market cap reaches around $1.5 billion, a long way from the $0.028 it sold for during the final stage of its presale.InQubeta plans to revolutionize how AI startups engage with their communities and raise capital by creating an NFT marketplace where investment opportunities get tokenized into non-fungible tokens. Anyone can easily invest in startups they believe in on the ecosystem by buying their NFTs with QUBE. Fractionalization allows investors to invest in a way that suits their budgets by allowing them to acquire portions of tokens they are interested in.InQubeta uses a democratic governance model to ensure those who invest in it have a say regarding its daily operations and plans for the future. The size of a user’s QUBE bag determines how much weight their vote carries when ideas are proposed and discussed.The artificial intelligence industry is poised for substantial growth as investments in the sector grow considerably, and more than $1.5 trillion will flow into companies like InQubeta in the next several years. Even a fraction of these funds coming InQubeta’s way would increase QUBE prices exponentially. It’s one of the best altcoins to invest in.Visit InQubeta WebsiteSome Bitcoin investors remain optimistic that a reversal will occur before the 19th as bolder investors open up long positions in anticipation of the supply shock the milestone will cause by reducing miner rewards by half.Miners are concerned about the halving not bringing the tremendous growth many analysts have predicted, and they are being blamed for BTC’s recent price drop as some opt to sell their remaining BTC. However, the good news is that prices have held steady above $60,000 despite the massive sell-offs.QNT price has dropped by over 15% in the past week as BTC’s price correction has led to bears dominating the broader cryptocurrency space.Quant plays a considerable role in the decentralized finance space as it links blockchains with its Overledger. That utility should lead to substantial long-term price growth.QUBE is the best new cryptocurrency to buy right now, given the 100x growth predicted now that tokens are available on exchanges. BTC and QNT remain decent investments, given how cheap tokens currently are.Visit InQubeta Website"]},"publishedDate":"2024-04-19T23:56:15"},{"id":1901461079,"title":"Analysts Pick New Altcoin To Buy As Litecoin and Uniswap Face Prices Drops","sourceUrl":"https://cryptonews.com/news/analysts-pick-new-altcoin-to-buy-as-litecoin-and-uniswap-face-prices-drops.htm","author":"Matt Williams","content":{"elements":["Analysts Pick New Altcoin To Buy As Litecoin and Uniswap Face Prices DropsTLDR:Since the rally that occurred at the start of March, most altcoins have been in a downtrend. Selling pressure has hit top altcoins such as Litecoin and Uniswap, forcing them to lose the gains they picked up last month.At the same time, a new alternative digital currency is becoming the talk of the market. The recently introduced altcoin, Rebel Satoshi Arcade, is going through a huge inflow of attention from both investors and traders.Rebel Satoshi Arcade ($RECQ) Changing the Meme Coin NarrativeRebel Satoshi Arcade (RECQ) is transforming what a meme coin can be by launching a memecoin that has utility in the gaming world. Traditional memecoins are usually just for fun with no other function. However, Rebel Satoshi Arcade is taking things a step further and has a bigger mission. The team is developing a gaming platform that includes different play to earn games.These games are not just for entertainment; they are designed to reward players for their time. Players can win free ERC20 tokens, NFTs, and gaming assets, which they can sell for actual money. This approach provides players with a passive income based on how much they play and what they achieve in the games.The platform will also offer unique digital collectibles and merchandise. RECQ, the native token for Rebel Satoshi, is a very important part of this gaming community. Apart from being the key to accessing these games, it is used for buying and selling game items and NFTs. Presently, RECQ is available for sale at just $0.0037 per token.Litecoin (LTC) Under Strong Bearish PressureLitecoin (LTC) has experienced a decline of over 7.8% in the past month, following a local peak of around $112.32. The altcoin price had jumped from a low of $71.31 to get to this local peak. Unfortunately, the bulls could not keep up with the bearish sentiment in the market.On the lower timeframe, the Litecoin price has decreased by 24.4% over the last seven days. The altcoin is trading in the $70 range and might plummet even further in case buyers don’t enter. Furthermore, Litecoin has only 4 creating bullish signals among its 31 technical analysis indicators. Thus, the likelihood of recuperation is quite low.Uniswap (UNI) Still Battling With BearsUniswap (UNI) is yet to recover from the ripple effects of the SEC’s well notice it received on April 10, 2024. The price of the DeFi crypto went down after the news hit the crypto market. Investors were dumping their tokens for fear of more price dips.Currently, Uniswap is down 38.3% on the weekly price chart. The DeFi token dropped from its weekly peak of $11.62 to a low of $6.34. Meanwhile, Uniswap is green on the year-to-date chart with a gain of 15.7%. However, Uniswap’s chances of recovery are low and will depend on how its battle with the SEC turns out.Final ThoughtsLitecoin and Uniswap are yet to regain their footing in the market. However, all this could change in the coming days if positive momentum returns to the crypto market. As for Rebel Satoshi Arcade, its move to merge memecoin with gaming utility is a top move. This dual utility makes it a good crypto to buy.For the latest updates and more information, be sure to visit the official Rebel Satoshi Website or contact Rebel Red via Telegram."]},"publishedDate":"2024-04-19T23:43:14"},{"id":1889957142,"title":"Is The Bull Market Over Before The Bitcoin Halving? Glassnode Report","sourceUrl":"https://cryptonews.com/news/bitcoin-halving-bull-market-glassnode.htm","author":"Andrew Throuvalas","content":{"elements":["Is The Bull Market Over Before The Bitcoin Halving? Glassnode ReportBitcoin’s latest price dip to under $60,000 has raised questions as to whether the asset’s spectacular bull run this year could be ending earlier than expected.Lead Glassnode analyst James Check, however, says bull have very little to worry about.Bitcoin’s Pullback: Dip Or Doom?In a video analysis posted on Friday, Check reviewed various on-chain metrics concerning short-term Bitcoin holders, who first acquired their coins less than five months prior.Firstly, Bitcoin’s short-term holder MVRV ratio is now re-approaching 1.0, meaning its unrealized profit and loss have reached a break-even point. This level can serve as support after a bull market dip, but also major resistance during bear markets when most Bitcoin holders are underwater.“Little undercuts are good,” said Check. “In 2023 we had several of these retests. If we assume this is a resilient uptrend, we should expect the short-term holder cost basis to hold, somewhere in that $58,000 to $59,000 region. “Similarly, short-term holder SOPR has also recently dipped beneath 1.0, meaning that short-term holders are now beginning to realize more losses than profits. Should SOPR fall significantly under this level without resurfacing, it may be a sign of a sustained bear market to come.As of this week, short-term holders realized losses have spiked substantially – a sign that new buyers were panic selling at a loss amid news of rising conflict between Iran and Israel.“This is essentially what you do want to see, as a contrarian,” Check added. “As a contrarian, you kind of want to see people doing the wrong thing at the wrong time.”Days ago, Check noted that Bitcoin’s price may transition into being “top-heavy” if its price moves below $58,800. The asset trades for $64,000 at writing time.Bitcoin’s Long Term MomentumOther metrics like the AVIV momentum indicator suggest that Bitcoin price momentum remains positive on longer time frames, merely experiencing a cooldown on the 30-day timeframe for a “proper reset.”The AVIV Momentum indicator also remains in positive territory, with all timeframes hitting higher altitudes on each successive peak.A cooldown is underway on the faster 30-day indicator, which is what we want to see for a proper reset.https://t.co/hk4UJ1FZ7x pic.twitter.com/aSDhff53AM— _Checkmate 🟠🔑⚡☢️🛢️ (@_Checkmatey_) April 18, 2024Regarding the Bitcoin halving itself, Check believes its financial impact may be overhyped. Compared to Bitcoin futures volume, spot volume, and ETF trade volume, the daily BTC issued to miners is a tiny fraction of the market.“The size of the halving, is a narrative game more than it is in terms of size now… it’s just very very small,” he said."]},"publishedDate":"2024-04-19T23:21:11"},{"id":-13565968,"title":"Crypto Education Gains Traction During Financial Capability Month","sourceUrl":"https://cryptonews.com/news/crypto-education-gains-traction-during-financial-capability-month.htm","author":"Rachel Wolfson","content":{"elements":["Crypto Education Gains Traction During Financial Capability MonthApril is recognized as National Financial Capability Month in the U.S. to highlight financial education across the country. And while initiatives have been taking place to educate Americans about the traditional finance sector, opportunities around crypto education are also being presented this month.Crypto Education Becomes Important In The U.S.A recent study from Security.org found that the rate of crypto ownership in the U.S. grew by 10% last year. According to the study, 93 million people hold one or more cryptocurrencies.The upcoming Bitcoin Halving event has also sparked increasing interest in Bitcoin (BTC).Given the rising popularity of digital assets in the U.S., industry experts believe that education about cryptocurrency has become increasingly necessary.Bitcoin Educational Initiatives In The U.S.Kendra Cole, Co-founder and CEO of Sparrow Finance, told Cryptonews that the recent approval of Spot Bitcoin ETFs in the U.S. has pushed digital assets to the mainstream.Cole believes that individuals—particularly women and children—must be presented with better educational opportunities regarding Bitcoin adoption.“The impetus for women to get involved in Bitcoin now is to build stronger bonds through shared experiences and interests,” said Cole. “We know that women are oftentimes the chief financial officers of the home, making the majority of the financial and gifting decisions. Sparrow Finance aims to provide the tools to do this through Bitcoin education.”During Financial Capability Month, Cole shared that Sparrow Finance participated in Chicago’s Ultimate Baby Shower. This was a community-wide event for parents to discuss financial education.“During this gathering, we met with new parents to provide information about how women can get involved with digital assets,” she said. “We also discussed ways for women to leverage Bitcoin to build connections with loved ones.”Cryptocurrency exchange Coinbase is also focused on crypto education this month. A Coinbase spokesperson told Cryptonews that 87% of Americans want to update the financial system.“The top drivers of this discontent are frustration over fees and speed,” the spokesperson noted. “The current system costs regular Americans too much, takes too long, and gets you less for your money over time.”In order to shed light on this, Coinbase released a commercial this week explaining the Bitcoin halving event to the masses.“The spot will air on major U.S. channels, including TNT, ESPN, and ABC during the NBA Playoff games,” the spokesperson said. “The commercial will run from April 17 through April 22.”Food for thought: What if money was designed to get you more over time, not less?#Bitcoin pic.twitter.com/z8eHF8JltQ— Coinbase 🛡️ (@coinbase) April 15, 2024Coinbase believes that this advertisement sends viewers an important educational message.“This April, the rate of new Bitcoins created will be cut in half—just like it has been every four years or so since it was created in 2009,” the spokesperson explained. “This halving ensures its supply remains finite over time (similar to gold).”Coinbase added that the company’s marketing philosophy seeks to meet audiences where they are “in a tech-forward way.” “All of our campaigns have both online and offline components, and we invite the audience to participate,” the spokesperson said.BlackRock, the San Francisco-based asset management giant with over $10.5 trillion in assets under management, also recently released an educational series covering Bitcoin.A series of four short videos focused on different Bitcoin topics are available on Blackrock’s official website. Bitcoin ETFs, the halving event, security, and Bitcoin adoption are all discussed in easy-to-understand language.For example, Blackrock’s educational video on the Bitcoin halving notes, “To ensure no more than 21 million coins enter circulation, every four years there is what is known as a halving event, where the amount of bitcoin issued to miners for completing each block is cut in half.”Crypto Education Increases Across The WorldWhile crypto education is becoming increasingly important in the U.S., a number of initiatives are being launched throughout the world as well.For example, cryptocurrency exchange Bitget recently announced that it will allocate up to $10 million to the corporate social responsibility Blockchain4Youth project.Gracy Chen, Managing Director of Bitget, told Cryptonews that the purpose of this undertaking is to support young talent while establishing a blockchain-friendly educational environment.“Since the launch of Blockchain4Youth in May 2023, the program has been hosting campus roadshows around the world to educate global youth about blockchain knowledge,” said Chen. “This month, Bitget hosted a Blockchain4Youth event at Ton Duc Thang University in Ho Chi Minh City as part of the HUB FORUM 2024 event, gathering over 1,000 students from various universities in Ho Chi Minh City.”Chen pointed out that hosting events like Blockchain4Youth has become a necessity, noting that a recent Bitget study found that Millennials and GenZ’s are likely to become the main drivers of crypto adoption.Chen added that Bitget has other educational crypto events planned in the Philippines and Japan later this month as well.“Cryptocurrencies have the potential to provide financial access to people who are underserved or excluded by traditional banking systems,” she said. “Education can help bridge the gap by teaching people how to use cryptocurrencies and access financial services in a decentralized manner.”Stablecoin issuer Tether also recently established an educational initiative in the Middle East.The USDT issuer partnered with digital asset infrastructure provider Fuze to create digital asset awareness for businesses and individuals across Turkey, the Middle East, and North Africa.Tether and Fuze Forge Strategic Collaboration to Elevate Digital Asset Education in Turkey and the Middle Easthttps://t.co/QafmslCcke— Tether (@Tether_to) April 15, 2024Tether and Fuze will develop programs and workshops to enhance awareness and understanding of cryptocurrency and blockchain technology among local financial institutions.Crypto Education Remains ChallengingWhile it’s notable that crypto education is becoming prioritized, challenges associated with digital assets may create barriers.For instance, Cole believes that the biggest challenge involved with digital asset education is overcoming the knowledge and confidence gap.“This gap disproportionately affects women, who juggle multifaceted responsibilities —like their career, family, and finances —all while navigating the complexities of digital assets,” she said. “Amidst all of this, finding time to delve into digital asset education can seem daunting.”To overcome these obstacles, Cole views the power of community and in-person events as ways to help women and families understand cryptocurrency.While this may be the case, Chen believes the crypto industry’s fast-paced nature is problematic for most individuals.“The cryptocurrency industry may see new innovations emerge every month, week, or even daily,” she said. “Only learners with a high level of curiosity and initiative are able to keep up with the crypto industry’s pace effectively.”Given this, Chen noted that individuals wanting to learn about digital assets shouldn’t rely solely on articles, videos, books, or the internet to grasp the industry fully."]},"publishedDate":"2024-04-19T22:43:47"},{"id":1749422058,"title":"Anti-Bitcoin SEC Commissioner Caroline Crenshaw May Soon Lose Her Seat","sourceUrl":"https://cryptonews.com/news/bitcoin-sec-commissioner.htm","author":"Andrew Throuvalas","content":{"elements":["Anti-Bitcoin SEC Commissioner Caroline Crenshaw May Soon Lose Her SeatA member of the Securities and Exchange Commission (SEC) who is emphatically critical of Bitcoin and crypto may lose her spot at the agency’s high table on June 5, government records suggest.Per the SEC’s website, Commissioner Caroline A. Crenshaw was sworn into her position alongside Commissioner Hester M. Peirce (aka “Crypto Mom”) on August 17, 2020. Both have terms that are due to expire on June 5 – less than 50 days from today.SEC Commissioner Approaches End Of TermAccording to Fox Business journalist Eleanor Terret, recent White House statements and nominations show no signs that Crenshaw or anyone else has been nominated to fill her position after her term is finished.🚨NEW: l got lots of messages yesterday asking if the @GaryGensler resignation rumor was true.Firstly, it’s an election year and there’s a high possibility these could be his final few months as chairman, a position he likes, so it’s unlikely he would throw in the towel early.… pic.twitter.com/DBihpCeLjY— Eleanor Terrett (@EleanorTerrett) April 19, 2024“The White House had no comment on the matter,” Terret said.The revelation follows rumors earlier this week that SEC chairman Gary Gensler may soon resign after he posted a Twitter thread on Tuesday that read somewhat like a goodbye message.Several crypto-supportive congressmen, including Tom Emmer, have called on Gensler to resign for his hostile treatment of the industry and failure to adequately protect investors from its true bad actors.Under his leadership, the agency has filed dozens of enforcement actions against top crypto firms accusing them of securities law violations, while their leaders say the regulator’s evaluation of the law with respect to crypto is both unclear and outdated.Terret believes the likelihood of Gensler actually resigning during an election year is slim to none, and the odds of finding a nominee to replace him are “virtually impossible.”Crenshaw’s Views On BitcoinCrenshaw’s potential exit could be more important for the industry. Unlike Gensler, she voted not to approve Bitcoin spot ETFs for U.S. markets in January even though the agency had already lost a court case on the matter months prior.“These Commission actions are unsound and ahistorical,” Crenshaw wrote in a dissenting letter at the time. “And worse, they put us on a wayward path that could further sacrifice investor protection.”The commissioner added that spot Bitcoin ownership is highly concentrated and said the crypto spot markets are a “petri dish” of fraudulent conduct.“If the technology is so revolutionary, why do so many of its uses seem to revolve around recreating the existing financial system, except with less regulation, more opacity, fewer investor protections, and more risk?” she added."]},"publishedDate":"2024-04-19T22:25:14"},{"id":-717757435,"title":"Hedgey Finance Suffers Dual Exploits, Losing $44.7 Million in Funds","sourceUrl":"https://cryptonews.com/news/hedgey-finance-suffers-dual-exploits-losing-44-7-million-in-funds.htm","author":"Hassan Shittu","content":{"elements":["Hedgey Finance Suffers Dual Exploits, Losing $44.7 Million in FundsHedgey Finance suffered a devastating blow on April 19 when two simultaneous exploits drained $44.7 million from the token infrastructure platform.During the two-hour attack, the hacker utilized the ‘createLockedCampaign’ function with flash-loaned funds across multiple blockchains.Hedgey Finance Hacked: $1.9 Million Stolen on Ethereum, $42.8 Million on ArbitrumCyvers reported that Hedgey Finance suffered two exploits, one on the Ethereum (ETH) blockchain and another on the Arbitrum (ARB) network. The ETH attack resulted in a loss of $1.9 million, while the Arbitrum exploit led to a theft of $42.8 million in ARB tokens.🚨UPDATE🚨@hedgeyfinance has experienced security breach with their Hedgey Token Claim Contract!Total loss is around $1.9M. Attacker is funded by @ChangeNOW_io.All stolen funds are swapped to $DAI and transferred to an EOA at https://t.co/MT78LFSQ7GWe urge all users to… https://t.co/hwuBjTiebp— 🚨 Cyvers Alerts 🚨 (@CyversAlerts) April 19, 2024On-chain analytics showed that the attacker’s address was funded from web3 crypto exchange ChangeNOW, while the attacker swiftly deposited a portion of the stolen funds onto the Bybit cryptocurrency exchange.All stolen funds have been converted to $DAI and transferred to an External Owned Account (EOA).Security Alert: We\u0027re investigating an attack on the Hedgey Token Claim Contract. If you have created active claims, please cancel them using the \"End Token Claim\" button at https://t.co/Tt7Aq0n2dh.We are are actively working with our auditors and team to understand the attack…— Hedgey 🦔 (@hedgeyfinance) April 19, 2024In response to the exploits, Hedgy Finance promptly confirmed the incidents and initiated a thorough investigation into the attack on their Token Claim Contract. They advised users with active claims to utilize the “End Token Claim” feature on their platform to mitigate further risks.Hedgy Finance is collaborating with internal and external security experts to investigate the vulnerabilities exploited during the attacks and will provide further updates as new information becomes available.Crypto Hacks Decrease by Nearly 50% in March: PeckShield ReportCrypto investors enjoyed a reprieve in March as losses from hacks plummeted by nearly 50% compared to February, according to a PeckShield report.#PeckShieldAlert March 2024 witnessed 30+ hacks in the crypto space, resulting in ~$187.29 million in losses, with ~$98.8 million recovered. This marks a decrease of ~48% from February 2024.#Top5 hacks:#Munchables (#Juice affected): $97 million (recovered)#CurioNetwork: $40… pic.twitter.com/u3zejt9Ygn— PeckShieldAlert (@PeckShieldAlert) April 1, 2024While the month still saw over 30 hacking incidents, resulting in $187.29 million in losses, this marked a notable improvement from February’s $360 million. PeckShield also highlighted the recovery of $98.8 million in stolen funds.Despite the positive trend, March’s losses still exceed January’s, which saw $182.5 million disappear due to hacks. Looking at the broader picture, the first quarter of 2024 experienced a 17.5% reduction in losses compared to the same period in 2023.Data from Immunefi further revealed that hacking remains the primary method of crypto theft, accounting for 95.6% of total losses, with fraud constituting a mere 4.4%."]},"publishedDate":"2024-04-19T21:44:49"},{"id":1767676227,"title":"Veteran Trader Peter Brandt Predicts Major Bitcoin Price Action Coming Soon – Here’s the Latest","sourceUrl":"https://cryptonews.com/news/veteran-trader-peter-brandt-suggests-significant-bitcoin-move.htm","author":"Jimmy Aki","content":{"elements":["Veteran Trader Peter Brandt Predicts Major Bitcoin Price Action Coming Soon – Here’s the LatestVeteran trader Peter Brandt suggested the probability of an upward price trajectory for Bitcoin on April 18, citing recurring patterns in its market behavior. His analysis showed that Bitcoin prices tend to follow a repeating pattern, suggesting a bullish trajectory.Peter Brandt Bitcoin Price Prediction Entails Three PhasesThe seasoned trader analyzed Bitcoin’s market behavior in a thread on X, where he classified the asset into three phases: Hump-Slump, Bump-Rump, and Pump-Dump.According to the chart presented by Brandt, the current Bitcoin market has completed the first and second phases and is in the third phase.He noted that the “dump” part of the third stage had taken place while the “pump” phase was yet to materialize, suggesting a forthcoming BTC price increase.His deduction of a potential major Bitcoin price move comes amid a bearish trend in the cryptocurrency market, largely due to the news of the geopolitical tensions between Israel and Iran.Brandt’s analysis offers a potentially deeper perspective on the recent trajectory of BTC’s price, however.For instance, when Israel launched a retaliatory attack on Iran overnight, Bitcoin briefly dipped to $59K from its prior price of $63.4K before recovering to $65K. This rapid shift in trend has also fueled gains in other cryptocurrencies, indicating the possibility of an altcoin rally.Meanwhile, CryptoQuant data indicates that large Bitcoin holders (crypto whales) may have used the price dip to accumulate more cryptocurrencies at a discount.Earlier this week, Cryptonews.com reported a transfer of over 27.7K BTC ($1.75 billion) sent into accumulation wallet addresses between April 16 and April 17. This exceeded the previous record of 25,500 BTC (almost $1.6 billion) sent to such wallets on March 23, when the Bitcoin price was around $63.5K.Additionally, the impending Bitcoin halving event strengthens Brandt’s Bitcoin price prediction. The halving is designed to reduce incentives for mining new blocks, thereby slowing down the rate at which new Bitcoins are created.JUST IN: 100 blocks remain until #Bitcoin halving. pic.twitter.com/w6NkuxlqF5— Watcher.Guru (@WatcherGuru) April 19, 2024Bitcoin halving has a history of driving up the demand and price of BTC.Peter Brandt’s “Pump” Phase May Kickoff SoonPeter Brandt’s optimism for a BTC price increase aligns with market analysis insights from other experts as well, including pseudonymous trader Rekt Capital.The trader claimed that the current dip period of BTC, which is dubbed as the third or “Dump” stage in Brandt’s projection, might be the last opportunity for Bitcoin holders to purchase BTC at a relatively low value before post-halving sets in.In a post on X, Rekt Capital explained that recent BTC price movement features are similar to previous Bitcoin halving cycles, during which price declines gave way to rallies.#BTC3 Phases of The Bitcoin Halving1. Final Pre-Halving RetraceBitcoin has produced two -18% retraces prior to the Halving in the span of just over a monthIn mid-March, BTC pulled back -18% before recovering to $70000 and now in mid-April BTC has retraced -18% againThis… pic.twitter.com/2BKBQXpPOV— Rekt Capital (@rektcapital) April 17, 2024Rekt projected a “re-accumulation phase” for Bitcoin following the halving event scheduled for April 20, adding that this phase has a history of lasting over a year (385 days).Due to current market conditions, however, Rekt Capital suggested that this phase could be shorter, leading to a potential BTC price increase sooner compared to previous cycles."]},"publishedDate":"2024-04-19T21:03:49"},{"id":1156171186,"title":"Top Crypto Gainers Today on DEXScreener – RBOT, BRUNES, ALK","sourceUrl":"https://cryptonews.com/news/top-crypto-gainers-today-on-dexscreener-rbot-brunes-alk.htm","author":"Joel Frank","content":{"elements":["Top Crypto Gainers Today on DEXScreener – RBOT, BRUNES, ALKAs Bitcoin (BTC) hovers just above the $64,000 level with the issuance rate halving just hours away and most other major altcoins trade with little by way of impetus, traders are turning to on-chain crypto market monitoring tools like DEXScreener as they hunt for top crypto gainers today.On-chain markets refer to crypto assets issued and traded directly on the blockchain.Ethereum, Solana, and BNB are the most commonly used chains by those issuing or trading on-chain tokens.These on-chain markets are highly illiquid compared to centralized spot cryptocurrency exchanges or traditional financial markets.The Halving is Coming. #Bitcoin pic.twitter.com/JCD677j4Md— Michael Saylor⚡️ (@saylor) April 19, 2024That makes them highly volatile. A newly launched coin can easily see gains of 100x in days as its market cap surges from the tens of thousands to millions.Equally, a small amount of sell pressure can trigger huge price drops. And that’s not the only risk.There is virtually no barrier to entry for someone to issue their own token. That means scammers flock to the on-chain crypto markets to attempt to scam unaware investors.They can do this by inserting malicious code into the token’s smart contract creating unfair trading conditions.Alternatively, the token might be a pump-and-dump scheme. This is where the team behind a token builds up artificial hype to create demand, cashes in, and abandons ship.One popular technique is for a token’s issuer to watch the ETH in the token’s liquidity pool rise as the token’s price pumps, only to withdraw and make off with this ETH abruptly.That’s why many on-chain investors look for “locked liquidity,” which prevents such rug pull attempts.All that being said, let’s take a look at some of the top crypto gainers today in the on-chain markets.Top Crypto Gainers TodayThe newly launched Ethereum token RunesBot (RBOT) is up nearly 26,000% in the past 24 hours, as per DEXScreener.RunesBot is a telegram trading bot built to function on the soon-to-be-launched Runes ecosystem.The token’s market cap was last around $1.8 million, with just over $200,000 in locked liquidity.While it looks like a legitimate project, RBOT has a few aspects that are concerning to its smart contract.Transfers are pausable and there is a 5% buy and sell tax.Traders should always exercise caution before involving themselves in the on-chain market.Another Runes protocol-linked token called BitRunes (BRUNES) is pumping hard on Friday.As per DEXScreener, it was last up 150,000% in the past 24 hours with a market cap of $9.5 million.BitRunes allows users to bridge their Ethereum funds to the Bitcoin network through the Rune Launchpad.The token last had $520,000 in locked liquidity and has seen 24-hour trading volumes of $4.5 million.Like RBOT, it looks like a legitimate project. But like RBOT, its smart contract has concerning aspects.BitRunes has a modifiable tax and transfers are pausable. Additionally, the ownership of the token hasn’t yet been renounced.A Base launched meme coin called Alien King (ALK) has pumped hard since its launch on Friday.As per DEXScreener, ALK was last up 11,500% in the past 24 hours, with its market cap reaching $1 million.I\u0027m visiting somewhere in the earth. I will send you the secret gift if someone own ALK 👽 The King said 👑👑👑#AlienKing #ALK #Base pic.twitter.com/Fz346lG9gL— Alien King (@AlienKi_) April 19, 2024The token has locked liquidity of $244,000 and has seen over $13.3 million in volume so far.As per Go+ Security, the token has zero smart contract issues. But that doesn’t mean it isn’t a pump and dump. Traders must always be cautious and do their own research.Crypto Alternatives to ConsiderInvesting in low-cap shitcoins is a very risky strategy.An innocent-looking project could easily be a scam, and a few big sell orders could easily drive the price 80% lower.A strategy that is still risky, but arguably has a better risk reward is getting involved in crypto presales.The idea is that investors secure tokens of up-and-coming, high-potential crypto projects/protocols at a discounted early price.These projects then put those funds to work, paying for protocol development and marketing.While lots can go wrong when investing in crypto presales—unforeseen circumstances can prevent a project from delivering on its vision—savvy presale investors routinely secure gains of 10x or more.With hundreds of presale projects vying for investor funds, analysts at Cryptonews have been combing the market.Here are 19 of the presale projects with the highest potential.See the 19 Cryptocurrencies"]},"publishedDate":"2024-04-19T19:47:02"},{"id":-1193261671,"title":"Telegram to Introduce USDT Payments With Telegram Wallet and the Open Network","sourceUrl":"https://cryptonews.com/news/usdt-payments-launching-with-telegram-wallet-and-the-open-network.htm","author":"Julia Smith","content":{"elements":["Telegram to Introduce USDT Payments With Telegram Wallet and the Open NetworkEncrypted messaging platform Telegram and Tether have joined forces, enabling users to send USDT payments through The Open Network (TON) and the Telegram wallet, as formally announced by the companies’ founders on Friday at Token2049 in Dubai.USDT Payments On Telegram Via The Open Network and Telegram WalletAccording to the official announcement, Telegram users can now purchase USDT and send the stablecoin to others through TON, an independent blockchain network previously developed by the messaging app.With a user base exceeding 900 million globally, this integration could drive a surge in the stablecoin’s adoption.We are making history! TON + Telegram + Tether 🔥 pic.twitter.com/VXz4vljUHt— andrew.ton (@rogozov) April 19, 2024“We’re excited to bring USDT to The Open Network because we support its vision of an open and decentralized internet and a borderless financial system,” said Paolo Ardoino, CEO at Tether. “The launch of USDT on TON will allow seamless value transfer globally in a simple experience that can match even the traditional financial system.”Tether Launches Massive RestructuringNews of the collaboration comes amidst massive restructuring for Tether, which announced four new business divisions focused on sustainability, data, finance, and education yesterday.Tether Advances Beyond Stablecoins, Introduces New Framework Embracing Core Divisions to Foster Resilient, Future-Ready Financial SystemsRead more:https://t.co/O9ljdyaHw4— Tether (@Tether_to) April 18, 2024“Tether’s expansion beyond its well-established USDT stablecoin signifies a paradigm shift in its approach to financial empowerment,” a Thursday statement from Tether reads.“By focusing on sustainable solutions adaptive to the needs of individuals, communities, cities and countries, responsible Bitcoin mining, Artificial Intelligence infrastructure and decentralized communication platforms,” the company continued, “Tether is actively contributing to a future-proof financial and tech ecosystem.”Expanding beyond the company’s flagship stablecoin may prove to be a promising long-term strategy, given U.S. lawmakers’ recent efforts to advance legislation related to stablecoins.On Wednesday, representatives Cynthia Lummis and Kirsten Gillibrand introduced the Lummis-Gillibrand Payment Stablecoin Act of 2024. The act seeks to establish regulatory frameworks for stablecoin issuers at federal and state levels.🚨@gillibrandny and I are introducing the most comprehensive stablecoin bill to date.Crypto assets are revolutionizing the world and as the undisputed leader in financial innovation, the U.S. must embrace crypto assets, but it cannot be done without clear rules for stablecoins. pic.twitter.com/vwRUEBUdsl— Senator Cynthia Lummis (@SenLummis) April 17, 2024The proposed act would require stablecoin issuers to maintain one-to-one reserves, prohibit unbacked algorithmic stablecoins, and prevent unauthorized use of stablecoins by both issuers and users.“Passing a regulatory framework for stablecoins is absolutely critical to maintaining the U.S. dollar’s dominance, promoting responsible innovation, protecting consumers and cracking down on money laundering and illicit finance,” said Senator Gillibrand.It remains to be seen how emerging stablecoin regulation could impact Tether and Telegram’s plans for increased public use of peer-to-peer payment systems."]},"publishedDate":"2024-04-19T19:42:15"},{"id":-172633605,"title":"Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: Reuters","sourceUrl":"https://cryptonews.com/news/mango-markets-hacker-guilty-in-110m-theft-faces-20-years.htm","author":"Hassan Shittu","content":{"elements":["Mango Markets Hacker Found Guilty, Faces 20 Years in Prison: ReutersThe Mango Markets hacker, Avraham Eisenberg, was found guilty on Thursday in a Manhattan federal court for orchestrating a scheme that resulted in the theft of approximately $110 million from the Solana-based DeFi platform.Prosecutors argued that Eisenberg orchestrated a complex exploit on the platform, leading to substantial financial losses. Eisenberg, who has been in custody since January 2023, could face a maximum sentence of 20 years in prison.Eisenberg Found Guilty of Commodities Fraud and Manipulation in Mango Markets CaseAs reported by Reuters, On April 18, a federal jury in New York found Eisenberg guilty of commodities fraud, commodities manipulation, and wire fraud in connection with the exploit, which involved manipulating Mango Markets’ native token, $MNGO.The decision followed hours of deliberations after closing arguments on April 17.Trader convicted of Mango Markets fraud in first US crypto manipulation case https://t.co/6nBaMGNZGQ pic.twitter.com/ywsFEj73B8— Reuters (@Reuters) April 19, 2024The trial began on April 9 and lasted a little over a week. Eisenberg was arrested in December 2022 in Puerto Rico.During the closing arguments on April 17, Eisenberg’s legal team contended that he had not committed any criminal acts but rather orchestrated a “successful and legal trading strategy,” resulting in approximately $110 million in gains.In contrast, prosecutors argued that Eisenberg “had to lie” to facilitate the withdrawal of funds from Mango Markets, suggesting fraudulent intent.Eisenberg\u0027s lawyer: Ladies and gentlemen, Avraham Eisenberg did not commit any crimes. He engaged in a successful and legal trading strategy. He put his own money at risk. They talked about a con man. But you know that\u0027s not the case— Inner City Press (@innercitypress) April 17, 2024Eisenberg’s lawyer, Brian Klein, asserted that his client fully adhered to Mango Markets’ smart contracts and withdrew his capital without borrowing.Additionally, Eisenberg returned $67 million worth of cryptocurrency to Mango Markets following the exploit, claiming he had legally obtained the remainder of the funds.Klein expressed disappointment at the verdict but affirmed their intention to continue fighting for their client.“We’re obviously disappointed, but we will keep fighting for our client,” he stated, indicating plans to file post-trial motions.Hacker Convicted in $110 Million Mango Markets Exploit CaseOn October 11, 2022, Mango Markets was the victim of an attack in which approximately $110 million was drained from its treasury.Shortly after the attack, Avraham Eisenberg came forward as the perpetrator, asserting that the exploit was merely a “highly profitable trading strategy” and claiming it was conducted within the bounds of legality and the protocol’s intended design.According to prosecutors, Eisenberg utilized two accounts to engage in manipulative trading involving futures contracts tied to the values of Mango’s token MNGO and the stablecoin USD Coin.These trades purportedly inflated the value of his contracts by 1,300% within 20 minutes, allowing him to borrow against his holdings and withdraw $110 million in various cryptocurrencies.Subsequently, Eisenberg agreed to return $67 million in exchange for other token holders refraining from pursuing legal action or freezing his assets.He was arrested on December 26, 2022, in San Juan, Puerto Rico, where he resided, and has remained in custody since then, deemed a flight risk by prosecutors.NEWS: Today, the CFTC charged Avraham Eisenberg with a manipulative and deceptive scheme to misappropriate more than $110 million from Mango Markets, a digital asset exchange. Read the details: https://t.co/Rj5FKu5hgn— CFTC (@CFTC) January 10, 2023On January 9, the Commodity Futures Trading Commission (CFTC) supplemented the FBI’s charges, levying two counts of market manipulation against Eisenberg.The legal ramifications continued to mount for Eisenberg as the U.S. Securities and Exchange Commission (SEC) filed charges on January 20, alleging violations of anti-fraud and market manipulation provisions of U.S. securities laws.A lawsuit filed by Mango Labs characterized Eisenberg as a “notorious online personality” with a history of attacking multiple cryptocurrency platforms and manipulating cryptocurrency markets.Eisenberg’s scheduled July 29 sentencing carries a potential maximum sentence of 20 years in prison, although the actual sentence is expected to be less severe.This verdict comes shortly after the sentencing of Sam Bankman-Fried, founder of the now-defunct FTX cryptocurrency exchange, to 25 years in prison for embezzling $8 billion from customers, highlighting increasing scrutiny and enforcement within the cryptocurrency industry."]},"publishedDate":"2024-04-19T18:40:29"},{"id":1320246865,"title":"Binance Co-Founder Says Former CEO CZ Is in a ‘Positive Situation’ Ahead of Sentencing","sourceUrl":"https://cryptonews.com/news/binance-co-founder-says-former-ceo-cz-is-in-a-positive-situation-ahead-of-sentencing.htm","author":"Hassan Shittu","content":{"elements":["Binance Co-Founder Says Former CEO CZ Is in a ‘Positive Situation’ Ahead of SentencingBinance co-founder He Yi provided insights into Changpeng Zhao’s (CZ) legal situation at a Dubai event on April 19, expressing optimism despite his upcoming sentencing in the United States.This follows CZ’s plea deal, which resulted in his departure from Binance and the company’s substantial $4.3 billion forfeiture.While there’s potential for a sentence of up to 10 years, sentencing guidelines suggest a more probable term of 12 to 18 months, with the final verdict expected on April 30.Binance Co-Founder Discusses Regulatory ConfidenceYi also addressed broader implications for Binance’s regulatory stance, emphasizing the company must take a proactive approach to fight the constant threat of regulators.Binance recently obtained its highly anticipated crypto license in Dubai, allowing the cryptocurrency exchange to operate in the country.The final requirement for the Virtual Asset Service Provider (VASP) license granted by the Virtual Assets Regulatory Authority (VARA) was that CZ relinquish his voting power in Binance FZE, the exchange’s Dubai-based unit.In November 2023, Binance agreed to pay US authorities $4.3 billion as a settlement for violating the Bank Secrecy Act and failing to adhere to Anti-Money Laundering (AML) guidelines.This settlement came after CZ pleaded guilty to violating US anti-money laundering regulations and resigned as CEO as part of the plea deal.Following Zhao’s resignation, Richard Teng assumed leadership, ushering in a new strategic trajectory. Under Teng’s guidance, Binance has undergone restructuring, including establishing a newly formed board of directors and reinforcing its commitments to operational stability and regulatory compliance.Yi also shed light on CZ’s personal life, clarifying their current relationship status. As the mother of some of CZ’s children, Yi emphasized that they are not romantic partners but good friends.Binance Progress in Spite Regulatory TightnessBinance CEO Richard Teng also recently revealed that the exchange is currently discussing several jurisdictions for a new headquarters location. However, a final decision has yet to be made.Binance is considering re-entering India’s market after having been banned there in late 2023. It would involve a $2m penalty.#Binance #India #cryptohttps://t.co/QhLPTFd9uE— Cryptonews.com (@cryptonews) April 18, 2024Binance is also reportedly considering a return to India’s market after being banned in late 2023, with plans to pay a penalty of approximately $2 million.The potential re-entry hinges on registration with India’s Financial Intelligence Unit (FIU) and compliance with relevant legislation, including the Prevention of Money Laundering Act (PMLA) and the country’s crypto taxation framework.Among its regulatory issues, Binance is also actively cooperating with Nigerian authorities following the detention of its head of financial crime compliance, Tigran Gambaryan, on accusations of laundering over $35 million.Gambaryan’s situation and that of another Binance official facing similar charges highlight the exchange’s challenges in navigating regulatory environments across different jurisdictions."]},"publishedDate":"2024-04-19T18:01:44"},{"id":2014047538,"title":"Best Crypto to Buy Now April 19 – Bitcoin, Dogwifhat, THORChain","sourceUrl":"https://cryptonews.com/news/best-crypto-to-buy-now-april-19-bitcoin-dogwifhat-thorchain.htm","author":"Joel Frank","content":{"elements":["Best Crypto to Buy Now April 19 – Bitcoin, Dogwifhat, THORChainWith the Bitcoin halving event now just hours away, investors are asking whether BTC is the best crypto to buy now.BTC’s issuance rate to miners will drop by 50% in just over 8 hours, as per nicehash.com. It will fall from the current 6.25 BTC tokens per block to 3.125 BTC tokens per block.This will reduce Bitcoin’s annual inflation rate to around 1%. In the long run, the halving will directly reduce spot market sell pressure from miners, who constantly need to sell some of their Bitcoin stash to fund their mining operations.That all sounds very bullish, and in the past, Bitcoin halvings have preceded massive run-ups in the crypto’s price.Bitcoin Halving predicted almost on 4/20 at almost 4:20pm in 42 minutes WTF. pic.twitter.com/IIk4O4EFQT— MartyParty (@martypartymusic) April 19, 2024The 2012 halving was followed by a 93x rally, 2016 by a 30x rally, and 2020 by an 8x rally.But the Bitcoin price had never rallied to fresh record highs ahead of these prior halvings. That’s not been the case this time, with Bitcoin hitting new record levels in March 2024 near $74,000.Some think the arrival of spot Bitcoin ETFs in January brought some of Bitcoin’s expected post-halving rally forward. That suggests that Bitcoin may have less room to run higher this time than in the past.Bitcoin (BTC) – The Best Crypto to Buy Now For New Investors?But even if Bitcoin was “only” able to post a 3x rally after the halving this time, that would see it reach $180,000.And the post-halving rally may have to wait a few months as these typically don’t kick in for 4-6 months. That could reflect a short-term rise in miner sell pressure while they cope with a sudden drop in revenue.Also, macro headwinds have been building recently. Strong US data and hawkish Fed speak have forced traders to price out rate cut bets lately.But Bitcoin’s long-term outlook still looks bullish. The halving event is great marketing for Bitcoin, reinforcing the narrative that it is “sound money” and akin to digital gold.Additionally, the Fed will likely cut interest rates at some point. Meanwhile, spot Bitcoin ETF demand is likely to keep acting as a tailwind. And this year’s US election will probably see a pro-crypto shift in the US regulatory landscape.The odds that Bitcoin will hit $100,000 in the coming quarters is strong. For any new investor in the crypto space, Bitcoin is definitely the best crypto to buy now.Bitcoin halving price history:2012: $12 at halving – $964 1 year later2016: $663 at halving – $2,550 1 year later2020: $8740 at halving – $55,801 1 year later2024: $63,300 at halving…This is the most bullish event.Don’t be shaken out by whales pushing price down to…— Layah Heilpern (@LayahHeilpern) April 19, 2024But for investors with a sizeable Bitcoin exposure already looking to up their risk, altcoins markets may be attractive.While Bitcoin could yet post 3x gains in this bull market, many altcoins might see even larger gains.Smaller and lesser-known altcoins are riskier than Bitcoin. However, they also offer much greater upside potential, as they are generally at much earlier stages in their adoption curves.Here are some strong performers on Monday that could also be the best crypto to buy now.dogwifhat (WIF)Solana’s top meme coin, dogwifhat (WIF), is attempting to rebound from its recent record highs on Friday.WIF was last up 19% in 24 hours, making it the best performer in the top 100 by market cap.According to CoinMarketCap, WIF’s valuation is now back over $3 billion.After WIF’s strong rebound at $2.0, a lasting recovery above $3.0 could see bullish momentum build.WIF could easily post a quick 60% upside from here as it returns to late-March record highs in the $4.80s, suggesting it could be the best crypto to buy now.THORChain (RUNE)Multi-chain DEX/bridge THORChain (RUNE) is pumping hard on Friday, last up 13% in the past 24 hours.Having recently found decent support around $4.40, the crypto is eyeing a swift recovery back towards resistance-turned-support near $7.25.THORChain Q1 Highlights: ⚡️+53% volume growth ⚡️+48% liquidity growth ⚡️+57% in savers growth ⚡️$8m collected in liquidity fees ⚡️$4.9m collected by interfaces ⚡️+$160m in lending collateral ⚡️ New features \u0026 integrationsRead the full report on Medium:https://t.co/ar3HbCX2QI pic.twitter.com/8lyyKbRFGX— THORChain (@THORChain) April 15, 2024THORChain’s modest market cap of under $2 billion suggests there could still be plenty of room for growth in this bull market. 5-10x gains could easily be on the cards, making it one of the best crypto to buy now.Crypto Alternatives to ConsiderAll of the above coins offer potential investors a great chance to make 10x gains.But, for those looking for a better probability of near-term gains, an alternative high-risk, high-reward investment strategy to consider is getting involved in crypto presales.This is where investors buy the tokens of upstart crypto projects to help fund their development.These tokens are nearly always sold cheaply, and there is a long history of presales delivering huge exponential gains to early investors.Many of these projects have fantastic teams behind them and a great vision to deliver a revolutionary crypto application/platform.If an investor can identify such projects, the risk/reward of their presale investment is very good.The team at Cryptonews spends a lot of time combing through presale projects to help investors.Here is a list of 19 of what the project deems as the best crypto presales of 2024.See the 19 Cryptocurrencies"]},"publishedDate":"2024-04-19T17:48:08"},{"id":841196256,"title":"Litecoin Price Prediction as LTC Consolidates at $80 Level – $1,000 LTC Possible?","sourceUrl":"https://cryptonews.com/news/litecoin-price-prediction-as-ltc-consolidates-at-80-level-1000-ltc-possible.htm","author":"Joel Frank","content":{"elements":["Litecoin Price Prediction as LTC Consolidates at $80 Level – $1,000 LTC Possible?As the Litecoin (LTC) price consolidates at the $80 level, some are asking whether 10x gains, or even a rally to $1,000 might be possible this crypto bull market.Bitcoin (BTC) rallied to record levels near $74,000 last month. At the same time, Litecoin was only able to rally to highs just above $110 this month.That left it still down around 73% versus its December 2017 record highs at $420. But in light of the latest market dip, the Litecoin price is closer to 80% down from all-time highs.Compare that to Bitcoin, which was last down by only around 14% since last month’s record peaks. BTC was last changing hands in the mid-$63,000s.To be fair to Litecoin, it’s not the only major altcoin that remains a long way below record levels.Solana (SOL) is still down 45% versus its 2021 record peaks. And XRP (XRP) and Cardano (ADA) are down around 85%.Bitcoin has been able to recover back to record levels ahead of other coins given bullish narratives such as the approval of spot Bitcoin ETFs, the fact that it faces a favorable regulatory environment worldwide, and the growing idea that it is “digital gold” and therefore a great safe-haven asset and hedge against currency debasement.Litecoin’s Narrative ProblemLitecoin, by comparison, is suffering from a significant narrative problem. That is to say, while Litecoin has a lot going for it, it lacks narrative momentum.Litecoin is attempting to position itself as the “digital silver” to complement Bitcoin as “digital gold”. Thanks to its fair launch (a Bitcoin fork) and high level of decentralization, Litecoin is one of the only cryptocurrencies besides Bitcoin that global regulators widely agree is not a security, meaning it also faces a friendly regulatory environment worldwide.And its blockchain is much faster and cheaper than Bitcoin and able to bare a much higher load.Despite only ranking as the 19th largest crypto by market cap, LTC is the leader in crypto payments.https://t.co/NYpNlhtF0x— Litecoin (@litecoin) March 15, 2024But the cryptocurrency’s continued adoption as a medium of payment, its intended use case, is failing to lift its price.Indeed, on-chain data this week revealed that a record-high 62.5% of Litecoin investors now qualify as HODLers.\u0027On-chain data shows that Litecoin’s long-term holders have achieved a new record: 62.5% of all $LTC investors now qualify as these HODLers.\u0027 – @bitcoinist https://t.co/MZVFrEHLJ2— Litecoin (@litecoin) April 16, 2024Litecoin Price Prediction – Can LTC Hit $1,000?Record high Litcoin HODLing suggests a lack of retail investor interest in the cryptocurrency. Broader use amongst retail and short-term investors is a key part of a cryptocurrency’s adoption.And an influx of new short-term investors will be needed for the LTC price to drive higher.But the lack of participation by retail/short-term investors is a strong bottom signal for the Litecoin price.The HODLers who now dominate the LTC market are much less likely to sell their coins. The transfer of holdings from weak-handed short-term/retail investors has seemingly already taken place.The bull market in Bitcoin and many other cryptos is well underway. At some point it is likely to bleed into LTC in a more meaningful way.At such a cheap valuation below $100 and with a market cap of $6 billion, Litecoin has a strong risk-reward.Calling a more than 10x rally to $1,000 per token is a big call. Narratives surrounding Litecoin would have to gain a lot more traction.But Litecoin stands a very good chance of posting 5x gains to challenge record highs above $400.Fun Meme Coin Alternative to Consider – Dogeverse (DV)Litecoin offers the prospect of 5x potential gains this bull market.But some traders wish to take bigger risks for bigger potential upside. They should look no further than the meme coin market.New meme coins are popping up all the time. Most never gain traction. But those that do can post huge gains of 100x or more.One fun new meme coin that comes backed by compelling cross-chain bridging technology is Dogeverse.The new meme coin presale has already been able to attract north of $7.5 million from early investors and will soon sell out.Another incredible achievement unlocked for #DOGEVERSE! 🚀Exceeding the $7,500,000 milestone already! 💸Cosmo is over the moon! 🐾😄Way to go, #DOGE enthusiasts! 🌠 pic.twitter.com/jAZ7xZjkjw— DogeVerse (@The_DogeVerse) April 19, 2024Dogeverse has been attracting a lot of hype on social media in the run-up to Doge Day on 20 April.Dogeverse is launching on the six most used blockchains, excluding Bitcoin, with multi-chain bridge capabilities.There are a host of chains out there vying to be the go-to destination for meme coin launches–but Dogeverse plans to fit the bill by being present on all chains that matter.Dogeverse is already live on Ethereum, BNB Smart Chain, and Polygon but has Solana, Base, and Avalanche in the works for launch day. This multi-bridge utility is a massive expansion to the power of the Doge universe.🌌 Embarking on a journey through the #DOGEVERSE, the pioneering multi-chain #Doge #Token, inspired by #Cosmo\u0027s epic adventures. 🚀Leading in #Blockchain connectivity, uniting diverse #Crypto communities with Doge memes and a vision of a unified ecosystem across chains! 🌍 pic.twitter.com/Woe1wYvxqh— DogeVerse (@The_DogeVerse) April 16, 2024Dogeverse is doing something no other meme coin has attempted. There are multi-chains already, but none are as expansive and interconnected as Dogeverse plans to be.The new crypto presale Dogeverse is inserting itself into the narrative of the quickly growing opportunity of meme coins being spun up on multiple chains.Keep in touch with developments on the project’s X/Twitter and Telegram.Visit Dogeverse Here"]},"publishedDate":"2024-04-19T17:06:49"},{"id":416495584,"title":"Bitcoin’s Fourth Halving Imminent: Less Than 100 Blocks Away – Here’s What Happens Next","sourceUrl":"https://cryptonews.com/news/bitcoins-fourth-halving-imminent-less-than-100-blocks-away-heres-what-happens-next.htm","author":"Thomas Musgrave","content":{"elements":["Bitcoin’s Fourth Halving Imminent: Less Than 100 Blocks Away – Here’s What Happens NextBitcoin’s fourth halving event is imminent and will occur just after midnight UTC on April 20 (8 pm ET today), which will reduce the block subsidy reward for miners from 6.25 BTC to 3.125 BTC per block, potentially impacting the cryptocurrency’s price and mining operations.Bitcoin halvings occur automatically every 210,000 blocks or approximately every four years.To understand the importance of this event, let’s examine previous halving events and their historical impact on the industry.A Look Back at Previous Bitcoin Halving EventsBitcoin halving events have historically contributed to major Bitcoin price rallies.Bitcoin’s protocol has mandated three halving events thus far, gradually decreasing the block reward for miners from 50 BTC to 25 BTC in 2012, then to 12.5 BTC in 2016, and most recently to 6.25 BTC on May 11, 2020.The 2024 halving event will see the subsidy reward for miners on the network drop from 6.25 BTC to 3.125 BTC per block. In the long term, only 21 million Bitcoins will exist.What comes after 2024’s Halving Event?Bernstein predicts that Bitcoin will continue on its bullish path after the halving event and could reach $150,000 by the end of 2025.Coinify CEO Rikke Staer warned about #Bitcoin sales after halving in the @TheBlock__ interview.☑️ He attributed his expectations to the strengthening presence of institutional investors and the increased experience of retail investors ☑️ \"Historically, the main growth after… pic.twitter.com/iaVrCAQ8qj— Web3_Vibes (@W3Vibes) April 18, 2024However, Coinify’s Rikke Staer believes that the halving event is a “sell-the-news” event as less efficient miners may need to sell their existing BTC holdings, which could potentially create sell pressure.While Bitcoin miners have profited this year, the extent the halving will impact less efficient mining operations has yet to be determined.Bitcoin’s price is hovering around $64,500 as of writing, representing a 1.33% increase over the past 24 hours, as reported by CoinMarketCap.Bitcoin’s price fell below $60,000 earlier today amid reports of Israeli missiles hitting a site in Iran but has rebounded strongly since."]},"publishedDate":"2024-04-19T17:06:30"},{"id":-1913990148,"title":"SEC Reworks Justin Sun Tron Lawsuit, Claims Founder “Traveled Extensively”","sourceUrl":"https://cryptonews.com/news/justin-sun-tron-lawsuit-edited-after-trn-foundation-founder-tries-to-dismiss-claims.htm","author":"Julia Smith","content":{"elements":["SEC Reworks Justin Sun Tron Lawsuit, Claims Founder “Traveled Extensively”The United States Securities and Exchange Commission (SEC) has edited its Tron lawsuit against Justin Sun and his crypto companies, Tron Foundation, the BitTorrent Foundation, and Rainberry, following his attempted dismissal of the litigation late last month, amended court docs filed on Thursday reveal.Tron Lawsuit Edited After Justin Sun’s Attempted DismissalIn the updated court filings, the SEC claims that the Tron founder “traveled extensively” to the U.S. throughout “his work on behalf of the Tron Foundation, the BitTorrent Foundation, and/or Rainberry.”Big news in the crypto world! SEC revamps lawsuit against Tron founder Justin Sun for alleged sale of unregistered securities via Tron and BitTorrent tokens. Sun denies allegations, challenging SEC\u0027s jurisdiction. Complex legal battle ahead in the cryptocurrency industry.— Kelvin Zinck (@KelvinZinck) April 19, 2024The original lawsuit alleges Sun and the aforementioned crypto entities broke federal law by offering and selling unregistered securities in the form of Tronix (TRX) and BitTorrent (BTT).In his March dismissal, Sun largely argued that the federal agency was overstepping its authority in attempting to prosecute him, citing jurisdictional overreach.“The SEC is not a worldwide regulator,” lawyers for Sun wrote in the March 28th dismissal. “Its efforts to leverage highly attenuated contacts to the United States, to extend U.S. securities laws to cover predominantly foreign conduct, go too far and should be rejected.”In addition to Sun, several notable celebrities including Lindsay Lohan, Jake Paul, and Austin Mahone, were charged “for illegally touting TRX and/or BTT without disclosing that they were compensated for doing so.”SEC Presses Forward with Crypto CrackdownThe SEC’s amended lawsuit against Tron arrives amidst growing criticism of its “regulation-by-enforcement” approach to the crypto industry.Critics argue that the SEC has failed to establish a clear regulatory framework for cryptocurrencies, opting instead to pursue legal action against key industry players.Sun’s March dismissal motion challenges the SEC’s jurisdiction and asserts that neither TRX nor BTT qualify as investment contracts or securities.Under Chair Gary Gensler, the SEC has pursued lawsuits against major crypto entities like Coinbase, Ripple, and Binance, alleging violations of federal securities laws.Coinbase recently attempted to dismiss its case, arguing that the SEC’s claims regarding selling unregistered securities exceed the agency’s authority.However, U.S. District Court Judge Katherine Polk Failla ruled in favor of the SEC, allowing the lawsuit to proceed.And we’re not done.On our agenda: further equity market structure rules and additional cybersecurity rules, among others.— Gary Gensler (@GaryGensler) April 17, 2024Despite mounting pushback, the commission shows no signs of slowing down. In a recent X post, Gensler outlined the SEC’s ongoing agenda, which includes further equity market structure rules and additional cybersecurity regulations."]},"publishedDate":"2024-04-19T16:33:14"}]